{
    "new_fields_data": {
        "womens_college": "No",
        "cost_of_living_min": "Null\n\nThe minimum cost of living for students at Middle Tennessee State University cannot be provided as it is not explicitly stated on the university's official website, mtsu.edu. While information on housing and meal plan rates is available, a complete and explicit statement of the minimum cost of living that includes tuition and all mandatory fees for the requested academic year is not published.",
        "cost_of_living_max": "null",
        "orientation_available": "Yes.\n\nEvidence: The official Middle Tennessee State University website explicitly states that orientation, called \"New to Blue Orientation,\" is available for new undergraduate students. The \"New to Blue: Student Orientation\" page provides details about the program, which is designed to help new students transition into the university. Another page on registration also mentions that new freshmen and transfer students should attend the \"New to Blue Orientation\" before registering for classes. The Office of New Student and Family Programs also lists \"New to Blue Orientation\" as one of its services.\n\nURL:\n*   [https://www.mtsu.edu/orientation/](https://www.mtsu.edu/orientation/)\n*   [https://www.mtsu.edu/registration/new-students.php](https://www.mtsu.edu/registration/new-students.php)\n*   [https://www.mtsu.edu/nsfp/](https://www.mtsu.edu/nsfp/)",
        "college_tour_after_admissions": "yes\n\nEvidence: [https://www.mtsu.edu/rsvp/admitted-day-schedule.php](https://www.mtsu.edu/rsvp/admitted-day-schedule.php)"
    },
    "university_data": {
        "university_name": "Middle Tennessee State University\n\nEvidence:\nhttps://www.mtsu.edu/",
        "college_setting": "null",
        "type_of_institution": "null",
        "student_faculty": "null",
        "number_of_campuses": "null",
        "total_faculty_available": "975\nEvidence: https://www.mtsu.edu/iepr/factbook/2023_Fact_Book.pdf",
        "total_programs_available": "null",
        "total_students_enrolled": "20,540\n\nEvidence: https://www.mtsu.edu/news/2024/09/10/mtsu-fall-enrollment-up-1-7-despite-fafsa-challenges.php",
        "total_graduate_programs": "Null\n\nEvidence: After a thorough search of the Middle Tennessee State University (MTSU) official website (mtsu.edu), a specific total number of graduate programs offered is not explicitly stated. While the website provides lists and descriptions of individual graduate programs, there is no single page or document, such as a \"Fact Book\" or \"Quick Facts\" page, that aggregates and presents a definitive total count of these programs. Searches for an \"A-Z list of graduate programs\" also did not yield a page with a cumulative number. Without a direct statement from the university on its website, any provided number would be an estimation based on manually counting from various program listings, which could be inaccurate and would not meet the criteria of being \"explicitly stated.\"",
        "total_international_students": "634\n\nhttps://www.mtsu.edu/president/f24-international-enrollment.php",
        "total_students": "20,540\nEvidence: https://www.mtsu.edu/president/board-of-trustees/reports-and-presentations/2024-09-10_Presidents_Report.pdf",
        "total_undergrad_majors": "null",
        "countries_represented": "73\nEvidence: https://www.mtsu.edu/president/communications/2024/08/26/fall-2024-international-enrollment.php"
    },
    "address_data": {
        "street1": "1301 East Main Street.",
        "street2": null,
        "county": "Rutherford County\nhttps://www.rutherfordchamber.org/colleges--universities",
        "city": "Murfreesboro\nhttps://www.mtsu.edu/maps/",
        "state": "Tennessee\nhttps://www.mtsu.edu/maps/",
        "country": "United States\nhttps://www.isepstudyabroad.org/programs/university-studies/middle-tennessee-state-university/",
        "zip_code": "37132\nEvidence:"
    },
    "application_data": {
        "application_requirements": "### First-Time Freshmen Application Requirements:\n\nFor guaranteed admission, applicants are required to have completed the recommended college preparatory courses and meet one of the following criteria:\n*   A high school GPA of 3.0 or higher.\n*   A minimum composite ACT score of 22 or a minimum SAT total score of 1100 (Evidence-Based Reading/Writing & Math).\n*   A minimum high school GPA of 2.7 along with a minimum ACT score of 19 or a minimum SAT score of 990.\n\nApplicants who do not meet the guaranteed admission requirements may be considered for admission through a review process, which requires submitting a personal statement. This review will take into account factors such as high school coursework, honors or advanced placement, and dual credit.\n\n### Transfer Students Application Requirements:\n\nTo be eligible for guaranteed admission, transfer students must meet one of the following requirements:\n*   Have earned 24 or more semester hours with a cumulative GPA of 2.00 or higher from all previously attended post-secondary institutions.\n*   If fewer than 24 semester hours have been earned, the applicant must meet the freshman guaranteed admission standards and have a cumulative college GPA of 2.0 or higher.\n*   Applicants who have not been enrolled in any post-secondary institution in the 12 months prior to their application term and have 24 or more earned semester hours will be considered for admission on academic probation if their cumulative GPA is less than 2.00.\n\nTransfer applicants who do not meet these standards can submit a personal statement for consideration by the Admissions Review Board. All applicants under the age of 21 are required to submit ACT scores.\n\n### General Application Process:\n\nAll applicants must:\n*   Complete the online application for admission.\n*   Pay the nonrefundable $25 application fee.\n*   Submit official transcripts from all previously attended institutions (high school and/or college).\n\nEvidence: The application requirements are explicitly stated on the Middle Tennessee State University website on the \"How to Apply\" pages for undergraduate and transfer students.\n*   Undergraduate Admissions: https://www.mtsu.edu/how-to-apply/undergraduate.php\n*   Transfer Students Admissions: https://www.mtsu.edu/how-to-apply/transfer-students.php",
        "application_fees": "The application fee for domestic applicants is $25 and for international applicants is $30.\n\nEvidence: https://www.mtsu.edu/costs/",
        "test_policy": "Undergraduate: \"All entering degree-seeking students less than 21 years of age will be assessed initially for prescribed course placement according to valid ACT/SAT scores.\"\n\nGraduate: \"Many of our programs waive the GRE, GMAT, and other admission test requirements for applications.\"",
        "courses_and_grades": "### Freshman Admission Requirements:\n\nFor guaranteed admission as a first-time freshman, applicants are expected to have completed college preparatory courses and meet one of the following criteria:\n*   A high school GPA of 3.0 or higher.\n*   A minimum composite ACT score of 22 or a minimum SAT total score of 1100 (Evidence-Based Reading/Writing & Math).\n\nApplicants who do not meet the above requirements may be admitted through a review process if they have:\n*   A minimum 2.7 GPA combined with an ACT score of 19 or an SAT score of 990 (Evidence-Based Reading/Writing & Math).\n\nSuggested High School Courses:\nThe university recommends a distribution of college preparatory courses similar to the Tennessee High School Diploma. A sample of suggested units includes:\n*   English: 4 units\n*   Algebra I & II: 2 units\n*   Geometry or higher: 1 unit\n*   Additional math: 1 unit\n*   Natural Science: 3 units\n*   United States History: 1 unit\n*   European, World History, or World Geography: 1 unit\n*   Single Foreign Language: 2 units\n*   Visual & Performing Arts: 1 unit\n\n### Transfer Admission Requirements:\n\nTo be eligible for guaranteed admission, transfer students must meet one of the following criteria:\n*   Have earned 24 or more semester hours with a cumulative GPA of 2.00 or higher from all previously attended post-secondary institutions.\n*   If fewer than 24 semester hours have been earned, the applicant must meet the freshman guaranteed admission standards and have a cumulative college GPA of 2.0 or higher.",
        "recommendations": "Undergraduate Programs:\n\nFor general undergraduate admission to Middle Tennessee State University, letters of recommendation are not required. They are considered if submitted but are not a mandatory part of the application. However, it is noted that specific undergraduate programs may have their own distinct requirements, which could include letters of recommendation.\n\nEvidence:\n*   Middle Tennessee State University's undergraduate admissions information on BigFuture College Search states that recommendations are \"Considered but not required.\"\n*   College Factual's profile on Middle Tennessee State University lists recommendations as \"Neither Required nor Recommended\" for academic factors considered for admission.\n*   CollegeVine advises that \"Letters of recommendation are not a part of MTSU's general admissions process, but specific programs may require them, so always check the specific requirements of your desired program.\"\n\nGraduate Programs:\n\nThe number of recommendations required for graduate programs at Middle Tennessee State University varies by the specific program. However, several graduate programs explicitly require three letters of recommendation.\n\nEvidence:\n*   Applicants to the Master of Science in Professional Science (MSPS) program are required to submit \"3 letters of recommendation.\" The College of Graduate Studies provides a recommendation form for this purpose. The information can be found on the \"Apply Now!\" page for the MSPS program on the mtsu.edu website.\n*   The Master of Professional Studies (MPS) program requires applicants to \"Send three letters of reference to the College of Graduate Studies.\" This is stated on the \"MPS Admission Requirements\" page on the mtsu.edu website.\n*   The graduate programs in English (M.A. and Ph.D.) require \"three letters of recommendation.\" This requirement is listed in the MTSU English Graduate Student Handbook on the university's website.",
        "personal_essay": "Required.\n\nFor undergraduate applicants who do not meet the requirements for guaranteed admission, a personal statement form is required for the admission by review process. Transient student applicants who do not meet the standard of a 2.0 or higher overall GPA are also able to fill out a personal statement form for consideration.\n\nFor graduate applicants, the requirement of a personal essay or statement of purpose varies by program. For example, the Master of Arts and Doctor of Philosophy in English programs require a 500-word statement of purpose.\n\nEvidence can be found on the following Middle Tennessee State University webpages:\n- Undergraduate Admissions: https://www.mtsu.edu/how-to-apply/undergraduate.php\n- English Graduate Program Admissions: https://www.mtsu.edu/english/graduate-student-handbook-1.php",
        "writing_sample": "Not Required.\n\nHowever, for applicants who do not meet the requirements for guaranteed admission, a personal statement is required for the admission by review process. This applies to both first-time freshmen and transfer students who fall into this category. The admissions review committee will assess the personal statement to evaluate the student's potential for success.\n\nIt is important to note that some specific programs at the university, such as \"MTSU Write,\" require a separate writing sample as part of their application process. Additionally, a personal statement is typically required for admission to competitive graduate programs at MTSU.",
        "additional_information": "For students who do not meet the criteria for guaranteed admission, a personal statement form will be required for review. International applicants are required to provide a copy of their passport photo page, a financial affidavit of support, and proof of English proficiency. Furthermore, individual graduate programs may have admission requirements that exceed those of the College of Graduate Studies, and prospective graduate students should consult the Graduate Catalog or their specific department for these requirements.",
        "additional_deadlines": "### Additional Deadlines at Middle Tennessee State University\n\nFinancial Aid Deadlines:\n\n*   October 1, 2025: The Free Application for Federal Student Aid (FAFSA) becomes available for the 2026-27 academic year.\n*   March 1, 2026: This is the priority filing date for the FAFSA to be considered for maximum financial aid assistance for the 2026-27 academic year.\n\nScholarship Deadlines:\n\n*   December 1, 2025: Deadline for incoming freshmen to apply for guaranteed scholarships. This is also the application deadline for the Buchanan Fellowship, the highest academic award for freshmen.\n*   February 15: Priority deadline for the National Merit Scholarship. This date also serves as the deadline for transfer guaranteed scholarships, most foundation and departmental scholarships, and the Honors Transfer Fellowship.\n*   March 1: Deadline for most foundation and departmental scholarships. The scholarship application portal opens on October 1st and closes on March 1st.\n*   May 1: Deadline for students to accept their scholarship offers.\n*   August 1, 2026: For freshmen who missed the December 1st deadline for guaranteed scholarships, MTSU offers other scholarship opportunities with a deadline of August 1, 2026.\n\nHousing Deadlines:\n\n*   September 15, 2025: Housing applications for the Fall 2026 - Spring 2027 academic year open on this date.\n*   October 15, 2025: To be eligible for the room lottery process, current residents living on campus during Fall 2025 must have their housing application completed by this date.\n*   February 20, 2026: New incoming students must have a complete housing application by this date to be eligible for the room lottery process.",
        "tuition_fees": ""
    },
    "contact_data": {
        "contact_information": "Middle Tennessee State University\n1301 East Main Street\nMurfreesboro, TN 37132-0001\nUSA\n+1 (615) 898-2300\n\nUndergraduate Admissions\nStudent Services & Admissions Center, Room 120\nPhone: 615-898-2233\nEmail: admissions@mtsu.edu\n\nGraduate Admissions\nCollege of Graduate Studies\nIngram Building, MTSU Box 42\nPhone: 615-898-2840\nEmail: askgrad@mtsu.edu\n\nMT One Stop (Financial Aid, Registration, Class Schedules, and Transcript Requests)\nStudent Services and Admissions Center, Room 210\nPhone: 615-898-2111\nEmail: mtonestop@mtsu.edu\n\nStudent Affairs\nKeathley University Center, Room 212\nMurfreesboro, TN 37132\n\nUniversity College\n503 E. Bell Street\nMurfreesboro, TN\nMain Number: 615-494-7714",
        "logo_path": "null\nEvidence:\n*   https://goblueraiders.com/sports/2018/10/18/middle-tennessee-branding-logos-and-music\n*   https://www.mtsu.edu/creativesolutions/branding/",
        "phone": "(615) 898-2300",
        "email": "admissions@mtsu.edu",
        "secondary_email": "null",
        "website_url": "https://www.mtsu.edu",
        "admission_office_url": "https://www.mtsu.edu/how-to-apply/",
        "virtual_tour_url": "https://www.mtsu.edu/housing/virtual-tours.php",
        "financial_aid_url": "https://www.mtsu.edu/financial-aid/"
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/MTSU/\n\nEvidence:\n\nThe Facebook URL is explicitly stated on the Middle Tennessee State University's official \"Social Media Directory\" website:\n\n*   URL of the page: https://www.mtsu.edu/socialmedia/directory.php",
        "instagram": "https://www.instagram.com/mtsu/\n\nEvidence:\n\nThe Instagram URL is explicitly stated on the Middle Tennessee State University's \"Social Media Directory\" page: [https://www.mtsu.edu/socialmedia/](https://www.mtsu.edu/socialmedia/)",
        "twitter": "null\nEvidence: https://www.mtsu.edu/marketing/social-media.php",
        "youtube": "https://www.youtube.com/user/mtsu1",
        "tiktok": "null",
        "linkedin": "https://www.linkedin.com/school/middle-tennessee-state-university/"
    },
    "student_statistics_data": {
        "grad_avg_tuition": "null",
        "grad_international_students": "null",
        "grad_scholarship_high": "A Graduate Assistantship in the School of Music at Middle Tennessee State University is the highest graduate scholarship with an explicitly stated value, offering up to $21,066 per year for out-of-state students.\n\nThis assistantship provides a comprehensive financial package that includes a full tuition waiver and an annual stipend of $6,000. In exchange, students are required to work 20 hours per week within the School of Music. For in-state students, the total value of the assistantship is $12,552 per year, which also includes a full tuition waiver and the same $6,000 stipend.\n\nThe evidence for this is found on the \"Graduate Studies Financial Aid\" page of the MTSU School of Music's website. While other graduate scholarships are available at Middle Tennessee State University, such as the Mary W. and Chester Martin Graduate Academic Scholarship which offers a $500 tuition grant per semester, the Graduate Assistantship in the School of Music provides the highest explicitly stated monetary value. It is important to note that the value of tuition-based scholarships can vary depending on the student's residency status and the number of credit hours taken.",
        "grad_scholarship_low": "## The lowest graduate scholarship explicitly stated for Middle Tennessee State University is $1,000.\n\nSeveral scholarships for graduate students at Middle Tennessee State University (MTSU) are valued at $1,000. These include the Butler-Fouts Memorial Graduate Scholarship and the Mary C. Dunn Graduate Scholarship.\n\nThe Butler-Fouts Memorial Graduate Scholarship is awarded to female graduate students from underrepresented ethnic or racial groups who demonstrate academic promise and financial need. An article from MTSU News specifies that the winner of this scholarship will receive $1,000 for the fall semester. The Mary C. Dunn Graduate Scholarship is available to graduate students in the biological sciences who are conducting research, with the award amount also being $1,000.\n\nWhile the university's College of Education offers an \"ASPIRE to Teach Grant\" with a typical range of $250 to $700 for teacher candidates, including graduate students, this is categorized as a grant for short-term financial assistance rather than a scholarship. Other graduate scholarships mentioned on the MTSU website do not have a specified monetary value, with the amount often being determined by a committee based on available funds.",
        "grad_total_students": "2,368\n\nEvidence:\n\nThe total number of graduate students is explicitly stated in the \"Enrollment Comparisons - Fall 2025\" document provided by Middle Tennessee State University's Office of Enrollment Technical Services.\n\nURL: https://www.mtsu.edu/iepr/docs/enrollment/Fall-2025-Enrollment-Comparisons.pdf",
        "ug_avg_tuition": "null",
        "ug_international_students": "449",
        "ug_scholarship_high": "Buchanan Fellowship\n\nThe Buchanan Fellowship is the highest undergraduate scholarship offered at Middle Tennessee State University. This prestigious award, granted through the university's Honors College, provides a full tuition scholarship for up to 16 credit hours each semester.\n\nRecipients of the Buchanan Fellowship also receive a book allowance, priority registration for classes, and special consideration for study abroad opportunities. The scholarship is guaranteed for four years, provided the student continues to meet the necessary requirements.\n\nEvidence:\nThe official Middle Tennessee State University website explicitly states that \"The Buchanan Fellowship is awarded through the prestigious MTSU Honors College, and is the highest academic award given to an entering freshman at Middle Tennessee State University.\" The page further details the comprehensive benefits of the scholarship, including the full tuition coverage. This information is available on the Financial Aid section of the MTSU website, specifically on the page detailing scholarship opportunities for first-time incoming freshmen (https://www.mtsu.edu/financial-aid/scholarships/freshmen.php).",
        "ug_scholarship_low": "$1,500/year\n\nEvidence: https://www.mtsu.edu/financial-aid/scholarships/freshmen.php",
        "ug_total_students": "18,042\n\nEvidence: https://www.mtsu.edu/iepr/factbook/2023_Fact_Book.pdf"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "null",
        "is_act_required": "True\nEvidence: Students under the age of 21 are required to submit a valid ACT or SAT test score. \nURL: https://catalog.mtsu.edu/content.php?catoid=38&navoid=1658",
        "is_analytical_not_required": "null",
        "is_analytical_optional": "True",
        "is_duolingo_required": "null",
        "is_els_required": "null",
        "is_english_not_required": "False\nEvidence:\nMultiple pages on the official Middle Tennessee State University website explicitly state that international students must provide proof of English proficiency. For example, the \"Frequently Asked Questions for International Students\" page states, \"Yes, all international applicants are required to take the TOEFL, IELTS or other accepted examination.\" Similarly, the admissions page for the Master of Accountancy program requires \"Evidence of English proficiency, with TOEFL computer-based minimum score of 195, paper-based minimum of 525, or IELTS overall score of 6.\" The university's page on \"Modifications of Options to Demonstrate English Language Proficiency\" also outlines the various tests and minimum scores accepted. While there are some exceptions, such as for applicants from countries where English is the native language or for those who have earned a degree from an accredited U.S. institution, a demonstration of English proficiency is a standard requirement for international applicants.\n\nURL:\n*   https://www.mtsu.edu/international/faq.php\n*   https://www.mtsu.edu/programs/accounting-ma/international\n*   https://www.mtsu.edu/graduate/faculty-staff/TBR%20Proposal%20-%20English%20Proficiency.pdf\n*   https://www.mtsu.edu/programs/mba-online/international\n*   https://www.mtsu.edu/programs/finance-ms-online/international",
        "is_english_optional": "True\nEvidence: https://www.mtsu.edu/international/grad-admissions.php\nOn this page, under the \"Proof of English Proficiency\" section, it explicitly states: \"Not Required if: English is the native language of the country of citizenship. The applicant has earned a bachelor's or master's degree from a U.S. accredited 4-year college or university.\"",
        "is_gmat_or_gre_required": "Null",
        "is_gmat_required": "Null\nEvidence: The Middle Tennessee State University website does not explicitly state that the GMAT is a requirement for the entire university. The requirement for an entrance exam like the GMAT is determined at the program level, and many programs offer waivers or do not require it at all. For example, while the Master of Business Administration (M.B.A.) program requires a GMAT or GRE score, this can be waived for applicants who meet certain criteria, such as a specific GPA or professional experience. The College of Graduate Studies explicitly states that many programs waive admission test requirements.\n\n*   MBA Program: [https://www.mtsu.edu/programs/business-administration-mba/](https://www.mtsu.edu/programs/business-administration-mba/)\n*   Admission Test Waivers: [https://www.mtsu.edu/graduate/admissions/waivers.php](https://www.mtsu.edu/graduate/admissions/waivers.php)",
        "is_gre_required": "null",
        "is_ielts_required": "True.\n\nEvidence can be found on the \"Frequently Asked Questions for International Students\" page on the official Middle Tennessee State University website. This page explicitly states that international applicants are required to submit scores from the TOEFL, IELTS, or other accepted examinations. The required minimum IELTS score is 5.5.\n\nAdditional information regarding English proficiency for graduate students can be found on the \"International Graduate Students\" admissions page, which also lists an IELTS overall score of 6 as a requirement. For undergraduate students, while the direct \"Undergraduate Admission\" page for international students does not explicitly mention IELTS, the comprehensive \"Frequently Asked Questions\" page confirms the requirement for all international applicants.",
        "is_lsat_required": "False.\n\nEvidence: Middle Tennessee State University (MTSU) does not have a law school that would require the LSAT for admission. The university offers a Pre-Law concentration as part of its Political Science degree program, which is designed to prepare students who plan to attend law school after graduating from MTSU. The Department of Political and Global Affairs at MTSU offers free LSAT preparation workshops for its students, indicating that the LSAT is a test students will take to apply to other institutions, not a requirement for admission to MTSU itself.",
        "is_mat_required": "False.\n\nEvidence:\n\nThe Middle Tennessee State University website states that submission of GRE, GMAT, and/or MAT scores may be required for admission by your program, but it is not a university-wide requirement. The Graduate Application Process page says, \"Please check the requirements of your program of interest and the Admissions Test Waiver website to determine if a test is needed.\" Additionally, the Admission Test Waivers page mentions that \"Many of our programs waive the GRE, GMAT, and other admission test requirements for applications. Some programs do not require an admissions test as a part of the requirements.\"\n\nURL:\n\n*   https://www.mtsu.edu/graduate/apply.php\n*   https://www.mtsu.edu/graduate/test-waivers.php",
        "is_mcat_required": "True\nEvidence: The Middle Tennessee State University (MTSU) and Meharry Medical College School of Medicine (MMCSOM) Medical School Early Acceptance Program (MSEAP) explicitly requires students \"To participate in an intense formal MCAT review, complete the MCAT exam, and to release scores to Meharry prior to matriculation at MMCSOM.\"\nURL: https://www.mtsu.edu/biology/MSEAP_application.php",
        "is_pte_required": "True\n\nEvidence:\n\nA document from Middle Tennessee State University's College of Graduate Studies explicitly states the addition of the PTE Academic as an accepted demonstration of English proficiency. The document, titled \"Modifications of Options to Demonstrate English Language Proficiency,\" lists \"PTE Academic (minimum score of 55)\" as one of the acceptable methods for international students to prove their English language skills. The document further notes that this change is intended to create greater consistency between undergraduate and graduate options, implying its acceptance for both levels of study.\n\nURL: [https://www.mtsu.edu/provost/forms/curriculum/4-20-17_UC-Minutes.pdf](https://www.mtsu.edu/provost/forms/curriculum/4-20-17_UC-Minutes.pdf) (This information is on page 7 of the PDF document)",
        "is_sat_required": "False\nEvidence: https://www.mtsu.edu/how-to-apply/undergraduate.php",
        "is_toefl_ib_required": "True\nEvidence: The official Middle Tennessee State University website, on its \"Frequently Asked Questions for International Students\" page, lists the TOEFL iBT as one of the options to meet the English language proficiency requirement. It states, \"Choose one of the following options: IELTS score of 5.5 or above... TOEFL iBT score of 61 or above... Duolingo English Test with a score of 85 or above... iTEP score of 3.5 or above.\" This requirement is also stated on the \"International Graduate Students\" admissions page and the \"Undergraduate Admission\" page.\n\nURL: https://www.mtsu.edu/international/faq.php, https://www.mtsu.edu/graduate/international.php, https://www.mtsu.edu/international/ug_admission.php",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": 0
    }
}