[
    {
        "Concentration name": null,
        "description": "Accountants are business professionals who prepare and analyze financial information for organizations of all types. An accounting degree prepares individuals to enter a career field that is very much in demand in all areas of the country and world. Accountants compile, categorize, interpret, and summarize financial data for use in analyzing and reporting on the financial position and operating performance of organizations. In addition to being responsible for maintaining accounting records and preparing financial statements, accountants perform a variety of related tasks, including: preparing tax forms, analyzing costs and revenues, auditing financial statements, and providing financial advice to individuals and organizations. Students earning a Bachelor of Science (BS) in Accounting will be prepared to work in public accounting, industry, government, or not-for-profit organizations. The accounting curriculum is designed to provide students with a broad business base and a strong accounting background including courses in financial accounting, managerial accounting, auditing, taxation, and accounting information systems. The coursework will provide a foundation for those students who wish to pursue professional certification such as the Certified Public Accountant (CPA) or Certified Management Accountant (CMA).",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/accounting-bs/",
        "Accreditation status": "The College of Business is accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Program name": "Accounting",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Accounting Minor",
        "Program Page url": "https://catalog.purdue.edu/preview_program.php?catoid=15&poid=24130"
    },
    {
        "Concentration name": null,
        "description": "The minor in Actuarial Science is designed to prepare students for the demands of the actuarial profession. Students completing this minor will gain a strong foundation in mathematics, statistics, and finance, essential for passing professional actuarial examinations and pursuing a career in various fields such as insurance, risk management, and pensions. The curriculum emphasizes analytical skills, problem-solving techniques, and an understanding of financial instruments and markets. This minor complements a wide range of majors, including Mathematics, Statistics, Finance, and Economics, providing a valuable interdisciplinary perspective for students interested in a career as an actuary.",
        "program website url": "https://www.mnsu.edu/academic-catalog/current/minors-and-certificates/actuarial-science-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Actuarial Science Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Advocating for Social Justice Minor provides students with knowledge, skills, and values to critically analyze structures of power and privilege, and to advocate for social justice in diverse contexts. The minor is interdisciplinary, drawing from fields such as sociology, psychology, political science, ethnic studies, gender and women's studies, and communication studies. Students will explore theoretical frameworks of social justice, engage in critical self-reflection, and develop practical skills for promoting equity and inclusion through activism, community organizing, and policy advocacy. The minor prepares students to address complex social issues such as inequality, discrimination, and human rights violations, and to contribute to positive social change.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/advocating-for-social-justice-minor/",
        "Accreditation status": null,
        "Program name": "Advocating for Social Justice Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Aeronautics Minor is open to all students and will provide knowledge of the various facets of aviation and aerospace. This includes topics in aviation history, fundamentals of flight, air traffic control, aviation safety, navigation, and human factors. The minor can be taken by students who are interested in aviation and provides a broad base of knowledge in Aeronautics.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/aeronautics-minor/",
        "Accreditation status": null,
        "Program name": "Aeronautics Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/undergraduate/aeronautics-minor/"
    },
    {
        "Concentration name": null,
        "description": "This minor is designed for nursing students to enhance knowledge and skills in aging and prepare for careers working with older adults. The minor consists of courses from multiple disciplines on campus to provide a breadth of knowledge and understanding on various aspects of aging. These courses provide nursing students with a deeper understanding of the aging process, common health challenges in older adults, and strategies for providing high-quality, person-centered care. The minor enhances the nursing curriculum by offering specialized knowledge in gerontology, preparing graduates to excel in diverse healthcare settings, including hospitals, long-term care facilities, home healthcare, and community-based programs. Overall, the minor in Aging Studies for Nursing Students aims to equip future nurses with the expertise and sensitivity required to meet the unique needs of the growing older adult population, fostering compassionate and effective care.",
        "program website url": "https://www.mnsu.edu/academic-catalog/aging-studies-nursing-students-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Aging Studies for Nursing Students Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Aging Studies minor provides students from a variety of disciplines with a multidisciplinary perspective on the aging process and older adults, focusing on the social, psychological, and biological aspects of aging. The minor is designed to complement most major fields of study and helps students prepare for career opportunities in the growing field of aging, as well as for further graduate study.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2021-2022/undergraduate/aging-studies/",
        "Accreditation status": null,
        "Program name": "Aging Studies Minor",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2021-2022/undergraduate/aging-studies/"
    },
    {
        "Concentration name": null,
        "description": "The Agribusiness and Food Innovation program at Minnesota State University, Mankato provides students with the business and technical skills necessary to meet the increasing demand for professionals in the food, agribusiness, and agricultural sectors. As the global population grows and consumer preferences evolve, the need for well-trained individuals who understand both the business aspects and the innovative practices within the food supply chain becomes critical. This program offers a unique blend of business administration principles, food science, and agricultural innovation, preparing students for dynamic careers in an essential global industry. Graduates will be equipped to tackle challenges related to food production, processing, distribution, marketing, and policy, while also driving innovation to create sustainable and efficient food systems. The curriculum emphasizes experiential learning through internships, case studies, and industry projects, ensuring students gain practical experience alongside theoretical knowledge. Our faculty, with diverse expertise in agribusiness, food science, and economics, are committed to fostering a learning environment that encourages critical thinking, problem-solving, and leadership development.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs-courses/agribusiness-food-innovation-bs/",
        "Accreditation status": null,
        "Program name": "Agribusiness and Food Innovation",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Agribusiness and Food Innovation minor provides students with knowledge and skills to understand the growing global food system and the essential role of agribusiness in providing food, fiber, and fuel. The curriculum provides a foundation in business management, economics, and marketing principles as they apply to the agricultural and food industries. It also emphasizes innovation, sustainability, and entrepreneurship within the food supply chain. This minor is open to all students, particularly those interested in careers in food production, distribution, marketing, and policy.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/agribusiness-and-food-innovation-minor/",
        "Accreditation status": null,
        "Program name": "Agribusiness and Food Innovation Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/undergraduate/agribusiness-and-food-innovation-minor/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Agricultural Sciences provides a broad-based curriculum leading to a variety of careers in agriculture. Students gain knowledge and skills in agribusiness, agricultural education, and agronomy, as well as a strong foundation in the sciences. The program emphasizes hands-on learning, research opportunities, and practical application of agricultural principles. Graduates are prepared for roles in agricultural business, production, education, research, and government.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2024-2025-academic-catalog/undergraduate/agricultural-sciences-bs/",
        "Accreditation status": null,
        "Program name": "Agricultural Sciences",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2024-2025-academic-catalog/undergraduate/agricultural-sciences-bs/"
    },
    {
        "Concentration name": null,
        "description": "The Agriculture minor is designed for students who want to learn more about food production, sustainable agriculture, and the business of agriculture, but are pursuing a major in a different field. This minor allows students to explore various aspects of agriculture, including plant science, animal science, agricultural economics, and environmental sustainability. It provides a foundational understanding of agricultural principles and practices, preparing students for careers or further study in agriculture-related fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/agriculture-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Agriculture Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/undergraduate/agriculture-minor/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science degree in Agronomy provides students with knowledge and skills to sustainably manage plants and soils for crop production. Through courses and experiential learning opportunities, students will learn to assess and improve soil health, identify and manage plant diseases and pests, implement nutrient management plans, and utilize precision agriculture technologies. Graduates are prepared for careers in various sectors, including crop consulting, seed production, agricultural research, soil conservation, and farm management. This program is offered on campus at Minnesota State University, Mankato. The program is part of the Department of Agriscience & Food Innovations, located in the College of Science, Engineering and Technology.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs-of-study/agriscience-food-innovations/agronomy-bs/",
        "Accreditation status": null,
        "Program name": "Agronomy",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (B.S.) degree in Alcohol and Drug Studies prepares students to become licensed alcohol and drug counselors. The program curriculum is designed to meet Minnesota licensure requirements for alcohol and drug counselors and includes coursework in pharmacology, physiology, assessment and diagnosis, ethics, counseling theories, and group counseling. Students gain valuable practical experience through a supervised internship placement in a chemical dependency treatment facility. Graduates are prepared for employment in a variety of settings, including inpatient and outpatient treatment centers, correctional facilities, and community-based agencies. The Alcohol and Drug Studies program is accredited by the Minnesota Board of Behavioral Health and Therapy (BBHT).",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/alcohol-and-drug-studies-b-s",
        "Accreditation status": "Accredited by the Minnesota Board of Behavioral Health and Therapy (BBHT)",
        "Program name": "Alcohol and Drug Studies",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The minor in Alcohol and Drug Studies is an interdisciplinary program designed to prepare students for professional positions in the treatment and prevention of alcohol and drug abuse, and to enhance career options for individuals majoring in other areas such as social work, criminal justice, nursing, psychology, corrections, and health. The minor also provides an excellent foundation for graduate education related to chemical dependency work or other related fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/minors/alcohol-drug-studies-minor/",
        "Accreditation status": null,
        "Program name": "Alcohol & Drug Studies Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "American Indigenous Studies (AIS) is an interdisciplinary program designed for students who wish to learn about the histories, cultures, politics, and contemporary experiences of Indigenous peoples in North America and globally. AIS prepares students to work with tribal nations, Indigenous communities, and organizations, as well as in fields such as education, law, social work, public policy, environmental studies, and museum studies. The program offers a minor and also provides a valuable complement to a wide range of majors including but not limited to Ethnic Studies, History, Political Science, Sociology, Anthropology, English, and Social Work.",
        "program website url": "https://www.mnsu.edu/academic-catalog/interdisciplinary-programs/american-indigenous-studies/",
        "Accreditation status": null,
        "Program name": "American Indigenous Studies",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "Anthropology is the study of people, past and present. It is a broad discipline that seeks to understand the human condition, from the origins of humankind to the diversity of cultures around the world. The Anthropology program at Minnesota State University, Mankato is designed to provide students with a comprehensive understanding of the major subfields of anthropology: cultural anthropology, archaeology, biological anthropology, and linguistic anthropology. Students will develop critical thinking skills, research abilities, and a global perspective, preparing them for a variety of careers or for further graduate studies.",
        "program website url": "https://www.mnsu.edu/academic-catalog/departments-programs/anthropology-geography-earth-science-department/anthropology-ba/",
        "Accreditation status": null,
        "Program name": "Anthropology",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "Anthropology is the systematic study of humanity throughout time and the world. Anthropology is a broad, holistic, and global discipline. Students will learn the interrelationship between social life, human biology, culture, and the environment. Anthropology is considered a social science, but it also has strong links to the humanities and natural sciences. A minor in Anthropology provides a rich foundation for understanding human diversity for students interested in a variety of careers and fields. Students will learn how to approach the human experience by using four different but related areas, including: cultural anthropology, physical anthropology, archaeology, and linguistic anthropology. The Anthropology minor is useful for students interested in careers related to cultural resource management, museums, forensic science, international relations, social justice, law, public health, medicine, education, public policy, marketing, and social research.",
        "program website url": "https://www.mnsu.edu/academic-catalog/minors/anthropology-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Anthropology Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": "Health Science, Pre-Physician Assistant, and Pre-Physical Therapy",
        "description": "The Bachelor of Science (BS) in Applied Health Science provides a flexible program of study for individuals interested in health-related careers. This degree is designed to articulate with the Minnesota State A.S. in Exercise Science, Health Sciences Broad Field, or Human Services degrees. Students with other A.S. degrees or significant transfer credits may be admitted to the program on a case-by-case basis. This program offers three concentrations related to allied health: Health Science, Pre-Physician Assistant, and Pre-Physical Therapy. Graduates from the Applied Health Science program are prepared to enter graduate programs in fields such as physical therapy, physician assistant, occupational therapy, chiropractic, public health, health administration, athletic training, clinical exercise physiology, and other allied health professions. Some graduates will also pursue careers in fields such as fitness, personal training, community health, and health education. This program is offered in both on-campus and online formats.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/programs-a-z/applied-health-science-bs/",
        "Accreditation status": null,
        "Program name": "Applied Health Science",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Applied Health Science Minor provides an interdisciplinary and applied perspective for students interested in a variety of health related areas including health promotion, disease prevention, physical activity, and sport. Students who complete this minor will be able to analyze and apply health behavior theories, communicate effectively using diverse health topics, promote and assess physically active lifestyles, and identify and utilize evidence-based health resources. The minor will offer students a foundation in health sciences that can be applied to many professions or as a foundation for graduate study in a variety of health-related fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/applied-health-science-minor/",
        "Accreditation status": null,
        "Program name": "Applied Health Science Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Applied Leadership is designed for students from all majors who want to learn leadership theories and apply them to their personal and professional lives. The Minor provides students with critical thinking, problem solving, decision making, team development, organizational change, and communication skills necessary for effectively leading and managing others in diverse environments. Students also learn how to identify their own leadership strengths and areas for growth to become impactful and ethical leaders. The Minor will provide an excellent complement to any major and will enhance students’ marketability for employment and further education.",
        "program website url": "https://www.mnsu.edu/academic-catalog/courses-programs/academic-programs/applied-leadership-minor/",
        "Accreditation status": null,
        "Program name": "Applied Leadership",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Studio Art degree provides students with a broad and rigorous exposure to various art media and theoretical issues. Students will learn how to analyze and critically evaluate works of art from multiple cultural perspectives. The program will enhance their understanding of art and its context and prepare them for careers in art-related fields or for graduate study.",
        "program website url": "https://www.mnsu.edu/academics/academic-catalog/2023-2024-academic-catalog/college-of-arts-humanities/department-of-art/art-studio-art-bs/",
        "Accreditation status": null,
        "Program name": "Art & Design",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Art & Design minor introduces students to the visual arts and prepares them for future work or graduate study in a variety of art related fields. Upon completion of the Art & Design Minor, students will be able to: Utilize creative design thinking skills in the process of art production. Critique and analyze artworks using appropriate art and design terminology. Describe the history and theory of art and design within diverse cultural contexts. Articulate aesthetic and philosophical concepts in visual art through written and oral presentations.",
        "program website url": "https://www.mnsu.edu/academic-catalog/minors/art-design-minor/",
        "Accreditation status": null,
        "Program name": "Art & Design Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Art History program provides students with the critical thinking, communication, and research skills necessary to analyze art and its historical and cultural contexts. The curriculum offers students a wide range of courses and topics from the ancient world to contemporary art. Through a combination of required and elective courses, students gain a comprehensive understanding of various art movements, styles, and theories. Students will also learn to interpret visual culture, articulate ideas through written and oral presentations, and conduct independent research. The program prepares students for careers in museums, galleries, archives, higher education, arts administration, or for graduate study in art history or related fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/art-history-ba",
        "Accreditation status": null,
        "Program name": "Art History",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "Welcome to the Art History Program at Minnesota State University, Mankato. We offer a challenging curriculum in the history of art and architecture, from antiquity to the contemporary period, taught by faculty who are active in research and scholarship. In the classroom, you will learn to hone your skills in visual analysis, critical thinking, research, and writing. Outside of the classroom, you will have opportunities to visit museums and galleries, participate in campus events and art organizations, complete internships, and travel abroad. If you wish to declare a major or minor in Art History or simply have questions about the program, please contact a faculty member or the Department Chair.",
        "program website url": "https://hss.mnsu.edu/academic-programs/art/art-degree-programs/art-history-program/",
        "Accreditation status": null,
        "Program name": "Art History Minor",
        "Program Page url": "https://hss.mnsu.edu/academic-programs/art/art-degree-programs/art-history-program/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts degree with an emphasis in Art Teaching K-12 is designed to prepare students for a Minnesota teaching license in Visual Arts (K-12). The program prepares students to teach visual art effectively to a wide range of students in diverse settings. Students develop knowledge and skills in art media, art history, art criticism, and aesthetics, and apply these within effective teaching methodologies. Students cultivate an understanding of learners, content knowledge, instructional practices, and professional dispositions required of successful teachers. The curriculum provides a strong studio art foundation and a comprehensive understanding of current practices in art education. Graduates will be prepared to teach art to children and adolescents in public and private schools.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2022-2023-academic-catalog/undergraduate/art-teaching-k-12/",
        "Accreditation status": null,
        "Program name": "Art Teaching (K-12)",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2022-2023-academic-catalog/undergraduate/art-teaching-k-12/"
    },
    {
        "Concentration name": null,
        "description": "The Astronomy Minor provides students with an in-depth understanding of the physical processes governing the universe. This minor is an excellent complement to majors in Physics, Chemistry, Geology, and Computer Science, providing a broader scientific perspective and analytical skills applicable to a wide range of careers in science, technology, and education. Students will explore topics such as celestial mechanics, stellar evolution, galaxies, cosmology, and observational astronomy through a combination of theoretical study and hands-on experience using telescopes and astronomical data analysis tools.",
        "program website url": "https://www.mnsu.edu/academic-catalog/minors/astronomy-minor/",
        "Accreditation status": null,
        "Program name": "Astronomy Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Athletic Coaching Minor is designed to prepare students for coaching positions at the youth, interscholastic, and intercollegiate levels. The 18-credit minor provides students with the foundational knowledge and skills necessary to effectively lead and develop athletes, encompassing areas such as sport psychology, exercise physiology, motor learning, and coaching methodology. It is suitable for students pursuing various majors who wish to combine their primary field of study with a credential in athletic coaching.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2022-2023-academic-catalog/undergraduate/athletic-coaching/athletic-coaching-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Athletic Coaching Minor",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2022-2023-academic-catalog/undergraduate/athletic-coaching/athletic-coaching-minor/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2021-2022/undergraduate/automotive-engineering-technology/",
        "Accreditation status": null,
        "Program name": "Automotive Engineering Technology",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2021-2022/undergraduate/automotive-engineering-technology/"
    },
    {
        "Concentration name": null,
        "description": "A minor in Automotive Engineering Technology will provide students with the foundational understanding of automotive systems, vehicle design, development, and manufacturing. This minor will broaden the student’s understanding of automotive systems for careers in the transportation field.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/automotive-engineering-technology-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Automotive Engineering Technology Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/undergraduate/automotive-engineering-technology-minor/"
    },
    {
        "Concentration name": "Aviation Management, Flight, Maintenance Management",
        "description": "The Bachelor of Science in Aviation prepares students for diverse careers within the aviation industry. Three options allow students to choose areas of specialization including Aviation Management, Flight, or Maintenance Management. The Aviation Management option prepares students for professional positions in airport management, air transportation, government agencies, and other aviation-related businesses. The Flight option prepares students for careers as professional pilots within the commercial, corporate, and airline industries. The Maintenance Management option prepares students for careers in aircraft maintenance management, including commercial airline maintenance, corporate aviation maintenance, repair stations, and fixed base operations. Graduates of this program will possess the knowledge and skills necessary to contribute to and lead in various sectors of the aviation industry, ensuring safety, efficiency, and innovation. The program emphasizes a strong foundation in aviation principles, regulations, and operations, complemented by practical experience and specialized knowledge relevant to their chosen option.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/undergraduate/aviation-department/aviation-bs/",
        "Accreditation status": "Accredited by Aviation Accreditation Board International (AABI).",
        "Program name": "Aviation",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Aviation Minor is intended to provide students from any major with introductory knowledge of the aviation industry and the technical skills associated with private pilot certification. The minor provides a foundation for students interested in careers in aviation, either as a professional pilot, or in other aviation related fields, while also allowing students to receive academic credit for flight training. All flight training and ground instruction is provided by the MSU, Mankato Department of Aviation. All students completing the minor will earn their Private Pilot Certificate through the courses included in the minor curriculum.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/2023-2024/academic-programs/aviation-minor/",
        "Accreditation status": "FAA Part 141 approved flight school",
        "Level": "Minor",
        "Program name": "Aviation Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "Biochemistry is an interdisciplinary major with the goal of preparing students for careers in fields related to chemistry and biology (biotechnology, forensics, medicine, pharmacy, veterinary medicine, environmental chemistry, and related sciences). A degree in biochemistry also prepares students for graduate studies in biochemistry, molecular biology, and other related health sciences. The biochemistry curriculum combines a strong foundation in chemistry and biology with laboratory experience. Our faculty are experts in a wide variety of chemical and biological disciplines, including forensic chemistry, analytical chemistry, computational chemistry, microbiology, organic synthesis, biochemistry, and plant biology.",
        "program website url": "https://www.mnsu.edu/contentassets/36d4dc099f7f4227bb5251c31d34be28/2024-biochemistry.pdf",
        "Accreditation status": null,
        "Program name": "Biochemistry",
        "Program Page url": "https://www.mnsu.edu/contentassets/36d4dc099f7f4227bb5251c31d34be28/2024-biochemistry.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Biology is designed for students desiring a flexible program in Biology. It is appropriate for pre-professional students interested in such areas as medicine, dentistry, physical therapy, optometry, and veterinary medicine. Students may also combine this degree with a minor in Chemistry or other related field. Since this degree provides a broad background in Biology, it is also suitable for students planning to continue their education in graduate school or those who plan to teach at the secondary level after obtaining the appropriate education licensure.",
        "program website url": "https://www.mnsu.edu/academic-catalog/college-of-science-engineering-and-technology/biological-sciences/biology-ba/",
        "Accreditation status": null,
        "Program name": "Biology",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Biology Minor",
        "Program Page url": "https://academics.charlotte.edu/program/biology-minor-on-campus-online/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Biology Teaching (5-12)",
        "Program Page url": "https://www.google.com/search?q=time+in+Nicollet+County,+US"
    },
    {
        "Concentration name": null,
        "description": "Biotechnology is a rapidly expanding field of study that encompasses the application of living organisms and their components for the benefit of humankind. This interdisciplinary major will provide students with a strong foundation in the basic sciences of biology and chemistry and their applications in areas such as agriculture, medicine, bioremediation, and industrial applications. This degree prepares students for careers in the biotechnology industry, as well as for graduate study in biotechnology and related fields. Students completing the degree will have the opportunity to engage in cutting-edge research through laboratory courses and/or independent research projects.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs-of-study/b/biotechnology-bs/",
        "Accreditation status": null,
        "Program name": "Biotechnology",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Business Administration program offers a broad-based business education focused on developing the knowledge and skills necessary to contribute to the success of an organization. This program provides a solid foundation in the functional areas of business, including accounting, finance, marketing, management, and information systems. Students develop critical thinking, problem-solving, communication, and leadership skills essential for a dynamic business environment. The curriculum is designed to prepare graduates for a wide range of entry-level professional positions in various industries or for further graduate studies.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/undergraduate/business-administration-bs/",
        "Accreditation status": "The College of Business is accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Program name": "Business Administration",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "This interdisciplinary minor provides students from any major with a basic understanding of business, its language, and the functional areas within business. The minor provides fundamental knowledge about business and is especially useful for students in fields such as health care, arts, science, and education who anticipate working in or with organizations that are profit-oriented or that apply business principles. Students completing this minor will be better prepared to enter graduate programs in business or related fields. Completion of this minor provides fundamental knowledge about business and is especially useful for students in fields such as health care, arts, science, and education who anticipate working in or with organizations that are profit-oriented or that apply business principles.",
        "program website url": "https://www.mnsu.edu/academic-catalog/minors/business-administration-minor/",
        "Accreditation status": null,
        "Program name": "Business Administration Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Business Law Minor enhances any major with a strong foundation in business law. Students will gain an understanding of the legal environment of business, the structure of contracts, the principles of business organization, and various contemporary topics relating to the law. Students from any major are encouraged to consider a Business Law Minor.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2024-2025-academic-catalog/undergraduate/business-law-minor/",
        "Accreditation status": null,
        "Program name": "Business Law Minor",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2024-2025-academic-catalog/undergraduate/business-law-minor/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Business Teaching (5-12)",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": "ACS Certified, Biochemistry, Chemical Education, Forensic Chemistry",
        "description": "The Bachelor of Science (BS) in Chemistry provides students with a strong background in analytical, biochemistry, inorganic, organic and physical chemistry. The BS degree is appropriate for students planning to pursue graduate studies in chemistry or biochemistry, or those seeking employment in chemical, pharmaceutical, biotechnological or other science-related industries. Students are prepared for a variety of careers including industrial chemist, research chemist, pharmaceutical chemist, forensic chemist, and materials scientist. Graduates are also prepared for pre-professional programs in medicine, dentistry, veterinary medicine, pharmacy, or other allied health fields. The BS degree in chemistry offers four concentrations: ACS Certified, Biochemistry, Chemical Education, Forensic Chemistry.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/chemistry-bs/",
        "Accreditation status": null,
        "Program name": "Chemistry",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The minor in Chemistry offers students the opportunity to learn fundamental concepts in chemistry beyond the general education courses. This minor provides a solid foundation for students interested in careers where chemical principles are used and can be paired with any major. Students completing this minor will take courses in general and organic chemistry, along with additional chemistry electives. The minor provides a strong science background for students going into health care professions, forensic science, engineering, and other science-related fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs-courses/minor-chemistry/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Chemistry Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": "Teaching",
        "description": "This track is designed to provide students with a solid background in all areas of chemistry while also meeting the requirements for licensure to teach chemistry in Minnesota high schools. Students pursuing this track will gain a deep understanding of chemical principles and develop the pedagogical skills necessary to effectively teach chemistry concepts to secondary school students.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2022-2023-academic-catalog/undergraduate/chemistry/",
        "Accreditation status": null,
        "Program name": "Chemistry Teaching",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2022-2023-academic-catalog/undergraduate/chemistry/"
    },
    {
        "Concentration name": null,
        "description": "The Civil Engineering program prepares students to become professional engineers. Civil engineers design and build infrastructure that supports society and impacts the quality of life. Infrastructure systems include buildings, bridges, dams, airports, highways, water treatment, wastewater treatment, and solid waste management. The program is developed to provide a strong background in engineering fundamentals, civil engineering design, project management, and related engineering applications. The curriculum includes courses in a broad range of civil engineering areas, including structural engineering, environmental engineering, geotechnical engineering, transportation engineering, and water resources engineering. Students complete design projects in several courses. The program emphasizes ethical, social, and environmental responsibility, professional development, and the importance of lifelong learning. Graduates are prepared for a diverse range of civil engineering careers in consulting, government, and industry.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/undergraduate/civil-engineering-bs/",
        "Accreditation status": "The BS Civil Engineering Program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Civil Engineering",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Cognitive Science Minor focuses on the interdisciplinary study of the mind, drawing from fields such as psychology, computer science, philosophy, linguistics, and neuroscience. It explores the nature of intelligence, perception, memory, language, reasoning, and consciousness from multiple perspectives. This minor prepares students for graduate study or careers in fields like artificial intelligence, human-computer interaction, data science, and cognitive neuroscience.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/minor-in-cognitive-science/",
        "Accreditation status": null,
        "Program name": "Cognitive Science",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Communication and Media provides advanced study in the theoretical, historical, critical, and applied dimensions of communication, media, and rhetoric. The program is designed to develop students’ analytical, research, and communication skills to prepare them for advanced graduate study, teaching, or professional positions in public and private organizations. Graduates are prepared for a variety of professions in fields such as communication, media, education, government, public relations, non-profit management, and consulting.",
        "program website url": "https://www.mnsu.edu/academic-catalog/communication-media-ma/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Communication and Media",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Communication and Media Minor is a 21-credit program designed to give students a comprehensive understanding of how communication and media shape our world. Students will learn about various communication theories, media forms, and their societal impacts. This minor is suitable for students in any major who wish to enhance their communication skills and media literacy. It provides a strong foundation for careers in media, public relations, marketing, and other communication-intensive fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate-certificates-minors/communication-media-minor/",
        "Accreditation status": null,
        "Program name": "Communication and Media Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "Students pursuing the Bachelor of Science in Earth Science will develop a strong foundation in geological processes and Earth history, as well as an understanding of the relationship between Earth science and other scientific disciplines. The program emphasizes hands-on experience through laboratory work and field trips. Students will gain skills in scientific inquiry, data analysis, and communication, preparing them for careers in environmental consulting, natural resource management, geological surveying, and education, or for graduate studies in Earth science or related fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/earth-science-bs/",
        "Accreditation status": null,
        "Program name": "Earth Science",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Earth Science minor focuses on the study of the solid Earth (geology), its oceans (oceanography), and its atmosphere (meteorology). Courses for the minor examine Earth processes and materials (e.g., minerals, rocks, water, and air), Earth's history, and the evolution of life. Through completing the minor, students will learn to apply fundamental physical and chemical principles to Earth systems, evaluate Earth processes and hazards (e.g., volcanoes, earthquakes, landslides, and floods), understand sustainable use of Earth resources, and analyze the human impact on Earth systems (climate change, pollution). The minor provides a strong scientific background in Earth processes and systems. It complements a variety of majors including Biology, Chemistry, Civil Engineering, Environmental Science, Geography, Global Studies, Urban and Regional Studies, and Water Resources, and helps prepare students for careers or graduate school in earth sciences, environmental studies, and education.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/earth-science-minor/",
        "Accreditation status": null,
        "Program name": "Earth Science Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/undergraduate/earth-science-minor/"
    },
    {
        "Concentration name": null,
        "description": "Gender and Women’s Studies (GWS) is an interdisciplinary program offering a Bachelor of Arts (B.A.), a minor, and a certificate. GWS courses explore the social construction of gender and its intersection with other categories of analysis such as race, class, ethnicity, sexuality, nation, and ability. The program helps students understand how gender is woven into cultural practices and institutions, and how individuals are shaped by gendered social worlds. Students learn to critically analyze social relations of power and to envision, promote, and create social change through feminist and other justice-oriented frameworks. GWS is an ideal complement to any major. Students in the program develop skills in critical thinking, research, and communication that are valuable in a wide range of careers and graduate programs including education, law, social work, public policy, non-profit administration, international relations, health care, and business.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/gender-womens-studies/",
        "Accreditation status": null,
        "Program name": "Gender and Women's Studies",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Latin American Studies Minor is an interdisciplinary program designed to give students a comprehensive knowledge of the region and its people. Students will examine the historical, political, economic, social, and cultural aspects of Latin America. The minor is flexible, allowing students to tailor their studies to their specific interests.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs-courses/majors-minors-certificates/latin-american-studies-minor/",
        "Accreditation status": null,
        "Program name": "Latin American Studies Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "This minor introduces students to the core concepts of networking and information security. Students will learn about network infrastructure, protocols, operating systems, and security principles. Topics include network design, configuration, troubleshooting, risk management, and ethical hacking. The minor prepares students for entry-level positions in network administration and cybersecurity, or for further study in related fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/undergraduate/networking-information-security-minor/",
        "Accreditation status": null,
        "Program name": "Networking & Information Security Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/undergraduate/networking-information-security-minor/"
    },
    {
        "Concentration name": null,
        "description": "Philosophy majors develop analytical, critical, and communicative skills relevant to a wide variety of careers and graduate programs. Philosophers learn how to formulate, develop, and defend arguments concerning fundamental issues, such as the nature of reality, knowledge, and value. The Philosophy program offers courses in such areas as metaphysics, epistemology, ethics, logic, social and political philosophy, aesthetics, and the history of philosophy. Our graduates have pursued careers in law, public policy, medicine, journalism, education, ministry, social work, business, information technology, government, and other fields requiring rigorous critical thinking. Many of our majors also pursue graduate study in philosophy and other fields.",
        "program website url": "https://www.mnsu.edu/academic-catalog/college-humanities-social-sciences/philosophy/",
        "Accreditation status": null,
        "Program name": "Philosophy",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Scandinavian Studies minor offers students the opportunity to learn about the languages, literatures, histories, and cultures of the Scandinavian countries (Denmark, Iceland, Norway, and Sweden) and Finland. Students are introduced to the field by taking an interdisciplinary course covering central aspects of Scandinavian culture and society. In addition, they gain knowledge of a specific aspect of the region that aligns with their interests, whether it be literature, history, politics, or art. Students are strongly encouraged to combine the minor with a study abroad experience in a Scandinavian country. The Scandinavian Studies minor is beneficial to students pursuing a wide range of majors, including Anthropology, Art, English, History, International Business, International Relations, Mass Media, Political Science, Psychology, and Sociology.",
        "program website url": "https://www.mnsu.edu/academic-catalog/programs/scandinavian-studies",
        "Accreditation status": null,
        "Program name": "Scandinavian Studies",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Scandinavian Studies Minor introduces students to the languages, cultures, histories, and societies of Denmark, Iceland, Norway, and Sweden. It is an interdisciplinary minor designed to complement a wide range of majors in the humanities, social sciences, and the arts. Courses taken for the minor will address topics such as Viking history, Scandinavian immigration to America, Nordic folklore, and contemporary Scandinavian literature, film, and politics. The Scandinavian Studies Minor also encourages students to undertake study abroad in Scandinavia (with scholarship support available through the Andrew J. and Mary C. Lindgren Scholarship for Scandinavian Studies). The minor consists of 18 credits.",
        "program website url": "https://www.mnsu.edu/academic-catalog/academic-programs/minors/scandinavian-studies-minor/",
        "Accreditation status": null,
        "Program name": "Scandinavian Studies Minor",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/"
    }
]