[
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.csulb.edu/college-of-business/accountancy",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Accountancy",
        "Program Page url": "https://www.csulb.edu/college-of-business/accountancy"
    },
    {
        "Concentration name": null,
        "description": "Africana Studies is an interdisciplinary field that examines the histories, cultures, intellectual traditions, and social, economic, and political experiences of African peoples and their descendants globally. The field began as a critical response to the traditional disciplines that largely ignored or distorted the experiences of African peoples in the diaspora and on the continent. As such, Africana Studies examines the global experiences of people of African descent, with a particular focus on the historical, political, economic, social, and cultural forces that shape their lives. Additionally, Africana Studies provides students with a multidisciplinary approach to understanding the world. The Africana Studies curriculum encourages critical thought and intellectual debate while providing a well-rounded liberal arts education. Students learn to think critically, communicate effectively, analyze complex issues, and engage in informed discussions about race, power, and identity. The program prepares students for a variety of careers in fields such as education, social work, law, public policy, journalism, and international relations.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/africana-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Africana Studies",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/africana-studies"
    },
    {
        "Concentration name": null,
        "description": "The American Indian Studies Program (AIS) at California State University, Long Beach, is an interdisciplinary program designed to meet the growing need for understanding the histories, cultures, and contemporary conditions of American Indians as indigenous peoples of the Americas. As an interdisciplinary program, AIS draws on a variety of academic disciplines within the humanities and social sciences to give students a comprehensive understanding of American Indian peoples and their experiences. The AIS program provides students with an opportunity to acquire an understanding of the diversity, complexity, and importance of the experiences of American Indians. Students who complete the program will be able to analyze and understand historical and contemporary issues facing American Indians as well as their contributions to American society and the world.",
        "program website url": "https://www.csulb.edu/program/american-indian-studies-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in American Indian Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in American Sign Language Linguistics and Deaf Culture is designed to provide students with a strong theoretical and practical background in the linguistics of American Sign Language (ASL) and in Deaf Culture. The program emphasizes the development of advanced ASL skills, an in-depth understanding of ASL phonology, morphology, syntax, and semantics, and a comprehensive exploration of Deaf culture, history, and social issues. Students will also gain expertise in interpreting and translation studies, and acquire the necessary skills for careers in education, communication access, research, and advocacy within the Deaf community. Graduates will be prepared to work in various professional settings where fluency in ASL and knowledge of Deaf culture are essential.",
        "program website url": "https://www.csulb.edu/major-degree/american-sign-language-linguistics-and-deaf-culture",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in American Sign Language Linguistics & Deaf Culture",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in American Studies",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-AMST%20BA%2023-24.pdf"
    },
    {
        "Concentration name": null,
        "description": "Anthropology is the systematic study of humanity, with the ultimate goal of understanding our human condition in all its diversity. This makes it one of the broadest and most inclusive of academic disciplines. It draws on insights from the social sciences, natural sciences, and humanities, and is usually divided into four subfields: cultural anthropology, archaeology, biological anthropology, and linguistic anthropology. All undergraduate students at CSULB learn about all four subfields, as well as the history and theory that ties them together as a holistic discipline. Students also learn how anthropologists do their research—the methods they use to gather and analyze data in various settings—from archaeological excavations, to laboratory settings, to interviews with people around the world. As a discipline focused on human diversity, Anthropology students learn to appreciate and value human differences, as well as the ethical principles involved in studying living people and the archaeological record. They graduate with a keen understanding of global diversity, and a well-honed set of skills in critical thinking, cross-cultural understanding, and communication, all of which prepare them for a wide range of career options.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/anthropology/bachelor-arts-anthropology",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Anthropology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Studio Art",
        "description": "The Bachelor of Arts (BA) in Art provides students with a broad and inclusive introduction to the visual arts, including studio art, art history, and art education. Students choose from one of four options, each providing a unique focus within the visual arts. The BA in Art provides a strong foundation for continued study in graduate school as well as a range of career paths within the visual arts, arts administration, or other areas requiring strong creative, critical thinking, and communication skills. The BA is highly recommended for students interested in combining their study of art with minors or other majors.",
        "program website url": "https://www.csulb.edu/academic-affairs/course-catalog/art-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Art, Option in Studio Art",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Department of Asian & Asian American Studies at California State University, Long Beach offers an interdisciplinary study of Asians in Asia and Asian Americans in the United States. Its curriculum examines the history, culture, political economy, and contemporary issues concerning Asian and Asian American communities.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/asian-and-asian-american-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Asian and Asian American Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Business Economics program is structured to provide students with a strong foundation in economic theory, quantitative methods, and analytical skills, preparing them for careers in various sectors, including finance, consulting, government, and business. The curriculum integrates economic principles with practical business applications, offering a comprehensive understanding of market dynamics, policy implications, and strategic decision-making. The Bachelor of Arts in Business Economics program at CSULB offers a rigorous curriculum that blends economic theory with real-world business applications. Students will develop critical thinking and analytical skills essential for understanding complex economic issues and making informed business decisions. The program emphasizes quantitative analysis, data interpretation, and economic modeling, preparing graduates for a wide range of career opportunities or advanced studies. With a focus on both microeconomic and macroeconomic principles, students gain insights into market behavior, public policy, and global economic trends. The program also provides flexibility for students to tailor their studies through elective courses in areas such as international economics, financial economics, and econometrics. Graduates are well-prepared for roles in financial analysis, market research, economic consulting, and data analysis.",
        "program website url": "https://www.csulb.edu/academic-affairs/academic-programs/business-economics-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Business Economics",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Chicano and Latino Studies is an interdisciplinary program designed to give students a critical understanding of the experiences of Mexican-origin, Latin American, and other Indigenous people residing in the United States and within broader transnational contexts. The program provides a multidisciplinary approach to understanding the rich, diverse, and complex historical and contemporary experiences of Chicana/o and Latina/o communities. Our faculty introduce students to the key issues, theories, and debates within the field. Students develop the analytical, methodological, and critical thinking skills required to engage with the experiences of racialized and colonized communities in ways that allow them to pursue graduate studies and contribute to various professional fields. The degree can prepare students for careers in law, public policy, social work, education, journalism, public health, and other fields. The program also offers students the opportunity to connect with faculty and students, build strong community ties, and develop leadership skills through local projects and campus organizations.",
        "program website url": "https://www.csulb.edu/program/chicano-and-latino-studies-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Chicano and Latino Studies",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS_CHLS-BA-ST_25-26.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Classics",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-CLSC%20BA%2022-23.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Department of Communication Studies is an integral part of the College of Liberal Arts at California State University, Long Beach, a large, diverse, urban university. We offer students a comprehensive program of study that promotes critical thinking, ethical reasoning, and effective communication skills. Our curriculum explores various areas within communication, including interpersonal communication, intercultural communication, rhetorical theory, media studies, organizational communication, and public address. Our faculty are dedicated teachers and scholars, committed to fostering an inclusive and engaging learning environment. We emphasize experiential learning opportunities, such as internships, service-learning, and student organizations, to help students apply theoretical knowledge to real-world contexts. Graduates of our program are prepared for diverse career paths in fields such as public relations, marketing, human resources, journalism, education, and non-profit management. Many also pursue graduate studies in communication or related disciplines.",
        "program website url": "https://www.csulb.edu/academic-affairs/college-liberal-arts/communication-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Communication Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Department of Comparative World Literature offers a Bachelor of Arts (BA) degree in Comparative World Literature that introduces students to works of literature from around the globe, from antiquity to the present. The program is specifically designed to expand students’ understanding of the relations among cultures as manifested in literature. With attention to theoretical, methodological, and historical approaches, students will learn how to critically analyze and interpret texts, articulate informed critical responses to literary works, and conduct independent research. The BA in Comparative World Literature encourages students to develop a global outlook in their studies, and equips them with vital skills in critical thinking, effective communication, and cultural analysis that are increasingly valuable in today’s diverse and globalized world. The program provides excellent preparation for further study in graduate school (including law school) and for a wide range of careers in fields such as publishing, journalism, education, arts management, non-profit work, civil service, and international relations.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/comparative-world-literature",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Comparative World Literature",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (BA) in Dance at CSULB is a rigorous academic and artistic program. This comprehensive undergraduate degree offers students a broad range of experiences in a diverse and inclusive learning environment. The BA curriculum is designed to cultivate students’ critical thinking and creative expression through study in dance technique, performance, choreography, history, cultural studies, pedagogy, and research. Students engage in in-depth theoretical and practical investigations, preparing them for a wide array of career paths in dance and related fields. The program emphasizes innovative approaches to dance education, fostering a deep understanding of dance as an art form, a cultural practice, and a field of academic inquiry. Graduates are equipped with the skills and knowledge necessary to contribute meaningfully to the evolving landscape of dance locally, nationally, and internationally. The BA is a comprehensive undergraduate degree offered in multiple tracks designed to meet the academic and artistic interests of a diverse student population. Students in the BA program delve into diverse styles and approaches to movement, embracing a global perspective on dance forms and practices. The curriculum balances studio work with academic study, encouraging students to develop as articulate thinkers, skilled practitioners, and imaginative artists. Through a combination of core courses, electives, and opportunities for performance and choreography, students craft a personalized academic journey that aligns with their professional aspirations and artistic goals. The program fosters a collaborative environment, encouraging students to engage with faculty and peers in creative projects, scholarly research, and community outreach initiatives.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/dance/dance-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Dance",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Visual Communication",
        "description": "The Bachelor of Arts (BA) in Design provides an exciting and comprehensive study that combines contemporary design theory and practice with creative application. The program promotes critical thinking while emphasizing a broad knowledge base within the visual arts. The BA Design degree is excellent preparation for continued study at the graduate level or for entry into the professional design industry. The Visual Communication Option is rooted in the rich and complex history of the field, while embracing and investigating emerging technologies and evolving professional practices. This option prepares students to critically engage and shape culture by designing visual information systems for local and global communities. Areas of study include typography, information design, interactive design, branding, publication design, and motion graphics. Students develop advanced technical and conceptual skills and cultivate a deep understanding of the relationship between form and content.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/design/program/ba-design-visual-communication-option",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Design and Visual Communications",
        "Program Page url": "https://www.csulb.edu/design"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Theatre Arts prepares students for careers in theatre and related fields through a curriculum that emphasizes a comprehensive study of drama and theatre production. Students engage in critical thinking about dramatic literature, theatre history, and theory, while developing skills in performance, design, technical production, and management. The program offers a broad liberal arts education with a focus on the collaborative nature of theatrical art. Students explore various facets of theatre, from acting and directing to costume and set design, stage management, and playwriting, fostering a well-rounded understanding of the discipline.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/theatre-arts/degrees/ba-theatre-arts",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Drama and Theatre Production",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The B.A. in Economics is a general economics degree. Students take a core of microeconomics, macroeconomics, and statistics, as well as a selection of upper-division electives. This program prepares students for a wide variety of career options, including analyst positions in business and government, and for graduate studies in economics, business, and law. Students pursuing the B.A. in Economics degree are encouraged to apply for membership in the national economics honor society, Omicron Delta Epsilon.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/economics/bachelor-of-arts-in-economics",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Economics",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Creative Writing, English Education, Literature, Rhetoric and Composition",
        "description": "The Bachelor of Arts (BA) in English provides students with a strong foundation in literary study and critical thinking, as well as opportunities for creative expression and professional development. Students develop skills in analytical reading, research, and written and oral communication, preparing them for a wide range of careers and further academic pursuits. The program encourages interdisciplinary approaches to understanding culture and society through language and literature.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/english/bachelor-of-arts-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in English",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/english/bachelor-of-arts-ba"
    },
    {
        "Concentration name": null,
        "description": "The Environmental Science and Policy Program (ES-P) offers an interdisciplinary Bachelor of Arts (BA) degree in Environmental Science and Public Policy and a minor in Environmental Science and Policy. The ES-PP BA program is designed to provide students with a broad and interdisciplinary understanding of environmental science and policy issues. It prepares students for a variety of careers in environmental management, policy analysis, advocacy, and education, as well as for graduate studies in environmental fields. The curriculum integrates natural sciences, social sciences, and humanities perspectives to address complex environmental challenges.",
        "program website url": "https://cla.csulb.edu/programs/es-p/",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in Environmental Science and Public Policy",
        "Program Page url": "https://cla.csulb.edu/programs/es-p/"
    },
    {
        "Concentration name": null,
        "description": "This program emphasizes the study of film and media history, theory, aesthetics, and criticism. The BA in Film and Video Studies is designed to prepare students for graduate study in film and media, as well as for work in fields such as programming, archival preservation, arts administration, exhibition, and journalism. Our curriculum focuses on critical analysis, historical research, and theoretical inquiry, providing students with a deep understanding of the cultural, social, and political impact of film and related media. Students will learn to analyze films from diverse perspectives, develop sophisticated arguments, and conduct independent research. The program also offers opportunities for students to engage with a range of media forms, including television, digital media, and emerging technologies.",
        "program website url": "https://www.csulb.edu/cinematic-arts/ba-film-and-video-studies-description",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Film and Video Studies",
        "Program Page url": "https://www.csulb.edu/cinematic-arts/academic-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in French and Francophone Studies offers students the opportunity to learn about the language, literature, and cultures of the French-speaking world. The program provides a broad cultural, historical, and linguistic understanding that can be applied to many different professions, including international business, law, international relations, journalism, translation, tourism, and teaching. Our students develop advanced proficiency in the French language and acquire a deep understanding of literary and cultural traditions and histories of France and the wider Francophone world. The program also offers students the opportunity to study abroad in a French-speaking country. The program is committed to developing students’ critical thinking, research, and communication skills, preparing them for a variety of careers or for graduate study.",
        "program website url": "https://www.csulb.edu/program/french-francophone-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in French & Francophone Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "General Geography, Geographic Information Science (GIScience)",
        "description": "Geography is an exciting, interdisciplinary field that examines the spatial organization and distribution of phenomena across the Earth's surface. Geographers study the interconnections between people, places, and environments, using diverse tools and methods to understand complex global challenges. Our undergraduate program offers a broad foundation in human geography, physical geography, and geographic techniques, preparing students for a wide range of careers and graduate studies.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/geography/undergraduate-program",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Geography",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "CSULB's German program offers a comprehensive study of German language, literature, and culture. The curriculum is designed to develop students' proficiency in German communication (speaking, listening, reading, writing) and provide a deep understanding of German-speaking cultures and societies. Students will explore diverse aspects of German history, politics, arts, and contemporary issues, preparing them for careers in various fields requiring cross-cultural competence and advanced language skills.",
        "program website url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs/german-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in German",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Dual Major Track",
        "description": null,
        "program website url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-GLST-BA-Dual-Major-Track-25-26.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Global Studies",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-GLST-BA-Dual-Major-Track-25-26.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in History",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-HIST%20BA%2024-25.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Human Development (BAHD) program at California State University, Long Beach (CSULB) focuses on human growth and development across the lifespan. The program is committed to a multidisciplinary approach, drawing from various fields such as psychology, sociology, anthropology, and education to understand the complex interplay of biological, cognitive, social, and emotional factors that shape individuals from conception through old age. Students in the BAHD program develop a comprehensive understanding of theoretical perspectives, research methodologies, and practical applications relevant to human development. The curriculum emphasizes critical thinking, ethical considerations, and cultural sensitivity in studying human behavior and social contexts. Graduates are prepared for a wide range of career paths in fields such as education, social services, counseling, healthcare, and public policy, as well as for advanced graduate studies in related disciplines.",
        "program website url": "https://www.csulb.edu/program/human-development-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Human Development",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Industrial Design",
        "description": "Industrial designers create products, systems, and services that address the needs, desires, and experiences of people. Through a multidisciplinary and iterative process of research, ideation, development, and testing, students learn how to identify problems and opportunities, empathize with users, and propose innovative and sustainable solutions. Our program emphasizes creative problem-solving, critical thinking, visual communication, and technical proficiency, preparing students for a wide range of careers in product development, user experience, and design leadership.",
        "program website url": "https://www.csulb.edu/design/bachelor-of-arts-design",
        "Accreditation status": null,
        "Level": "Bachelor of Arts",
        "Program name": "Bachelor of Arts in Industrial and Product Design",
        "Program Page url": "https://www.csulb.edu/design/bachelor-of-arts-design"
    },
    {
        "Concentration name": null,
        "description": "Interior design is a fascinating and diverse profession that shapes the world through the creation of a vast array of interior environments. The BA in Interior Design curriculum leads students toward the knowledge and skills necessary to enter the profession and to continue their professional education through experience, licensing, and graduate study.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/design/bachelor-of-arts-ba-in-interior-design",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Interior Design",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in International Studies",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-IST%20BA%2022-23.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Italian Studies",
        "Program Page url": "https://www.temple.edu/academics/degree-programs/italian-studies-major-la-itls-ba"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Jewish Studies is an interdisciplinary program that draws from the fields of History, Literature, Philosophy, Political Science, Religious Studies, and Sociology, among others. The program provides students with a broad and deep understanding of Jewish civilization from antiquity to the present. Students will explore Jewish history, culture, religion, and thought, as well as the diverse experiences of Jewish people around the world. The curriculum fosters critical thinking, research skills, and an appreciation for the complexities of Jewish identity and global Jewish life. Graduates are well-prepared for a variety of careers in education, non-profit organizations, community leadership, and further graduate studies in related fields.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/religious-studies/programs/bachelor-arts-jewish-studies",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in Jewish Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Department of Journalism & Public Relations offers a Bachelor of Arts (B.A.) degree in Journalism. The program prepares students to become ethical, competent and engaged multimedia journalists. Students learn skills applicable to many types of media platforms, including print, broadcast, web, social, mobile and multimedia content development. The curriculum focuses on writing, reporting, editing, visual communication, research, law, ethics, diversity and critical thinking. Graduates are prepared for careers in journalism and related professions.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/journalism-public-relations/journalism",
        "Accreditation status": "The Department of Journalism & Public Relations is one of 109 programs accredited by the Accrediting Council on Education in Journalism and Mass Communications (ACEJMC).",
        "Program name": "Bachelor of Arts in Journalism",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/journalism-public-relations"
    },
    {
        "Concentration name": null,
        "description": "Our Bachelor of Arts (BA) in Journalism & Public Relations offers an integrated curriculum that prepares students to work in a variety of media fields. We provide a rigorous professional education grounded in the liberal arts tradition and emphasize ethical, socially responsible and diverse coverage of news and information, strategic communication, storytelling and audience engagement. Our graduates are ethical communicators, critical thinkers, problem solvers and excellent writers who are prepared to excel in dynamic and diverse media environments.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/journalism-public-relations",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Journalism and Public Relations",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/journalism-public-relations"
    },
    {
        "Concentration name": null,
        "description": "Latin America Studies is an interdisciplinary program that draws on courses offered across the university by departments such as Anthropology, Art, Comparative World Literature, Economics, Geography, History, Human Development, Journalism, Political Science, Portuguese, Spanish, and Sociology. Students explore the cultures, histories, societies, and languages of Latin America, and develop a critical understanding of the region's relationship to the United States and the world. Through coursework and experiential learning opportunities, students gain valuable knowledge and skills that prepare them for diverse careers in government, non-profit organizations, education, and international business, or for graduate study.",
        "program website url": "https://www.csulb.edu/program/latin-america-studies-ba",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in Latin America Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Legal Studies Certificate program is an interdisciplinary program designed to give undergraduates a general understanding of the nature of law, legal processes, legal systems, and legal concepts. It provides students with a broad and critical understanding of the role of law in society and is especially useful for students considering law school or paralegal training. The Legal Studies Certificate provides a thorough grounding in legal concepts and processes for undergraduates from any major. It is not limited to Political Science majors, or even students in the College of Liberal Arts. The certificate is an excellent complement to majors in the humanities, social sciences, and business. It is especially useful for students considering law school or paralegal training. Students who complete the Legal Studies Certificate will enhance their critical thinking skills, hone their ability to analyze complex issues, and develop a comprehensive understanding of the role of law in society.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/political-science/legal-studies-certificate",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Legal Studies",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/political-science/legal-studies-certificate"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Liberal Studies is an interdisciplinary major especially designed to prepare students for teaching at the elementary school level. Completion of the Liberal Studies program will help students to:\n*   Develop a broad base of knowledge across multiple subject areas\n*   Synthesize knowledge, skills, and abilities in preparation for entry into a Multiple Subject Credential Program\n*   Identify subject matter that meets the Content Standards for California Public Schools, K-12\n*   Develop an understanding of current educational issues\n*   Demonstrate knowledge of subject matter to teach diverse learners",
        "program website url": "https://www.csulb.edu/college-of-education/liberal-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Liberal Studies",
        "Program Page url": "https://www.csulb.edu/college-of-education/liberal-studies"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Linguistics",
        "Program Page url": "https://www.umass.edu/humanities-arts/academics/bachelor-arts-linguistics"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Parks, Recreation and Leisure Studies prepares students for professional careers in the diverse fields of recreation, park and leisure services. The curriculum provides a common core of theoretical knowledge and practical skills focusing on the provision of services in parks, recreation, sport, tourism, and leisure related services. Graduates are prepared to work with diverse populations in a variety of settings including municipal and county parks and recreation departments, state and national park systems, non-profit organizations, military recreation, outdoor adventure programs, tourism and commercial recreation businesses, and youth and amateur sport organizations. Students completing the B.A. degree are able to meet the academic qualifications for professional certification through the National Recreation and Park Association (NRPA).",
        "program website url": "https://www.csulb.edu/college-health-and-human-services/kinesiology/undergraduate-programs/parks-recreation-and-leisure-studies-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Parks, Recreation and Leisure Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Philosophy is a rigorous and highly rewarding area of study. The discipline of philosophy is concerned with fundamental questions about knowledge, reality, reason, and value. As a student of philosophy, you will develop a deep understanding of the history of ideas, the nature of argumentation, and the principles of ethical reasoning. Our curriculum is designed to cultivate critical thinking, analytical skills, and clarity in written and oral communication, preparing you for a wide range of careers and further academic pursuits.",
        "program website url": "https://cla.csulb.edu/departments/philosophy/major/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Philosophy",
        "Program Page url": "https://cla.csulb.edu/departments/philosophy/major/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (BA) in Political Science provides students with a broad and comprehensive understanding of political systems, institutions, behavior, and ideas. The program offers several options (concentrations) that allow students to specialize in particular areas of interest within political science: General Political Science, Global Politics, Law, Politics, and Policy, and Public Policy and Administration.\nThe Political Science curriculum prepares students for a wide range of careers, including government, non-profit organizations, law, education, journalism, and business. It also provides a strong foundation for graduate studies in political science, public administration, law school, and other related fields. Students develop critical thinking, analytical, research, and communication skills essential for engaged citizenship and professional success.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Political Science",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Psychology is the scientific study of behavior and mental processes. The goal of the Psychology Department is to provide instruction in the basic theories and methods of psychology. The curriculum is designed to give students a scientific, empirical, and theoretical understanding of behavior and mental processes. Students will learn how to read, understand, and critique the current scientific literature in psychology, how to design and execute psychological studies, and how to analyze and interpret quantitative and qualitative data. Students will develop an understanding of major theoretical perspectives in psychology and learn to apply these theories to real-world problems. The coursework provides students with a strong foundation for various careers and for further graduate study in psychology or other fields.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/psychology",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Psychology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Recreation and Leisure Studies Program is dedicated to improving the quality of life for all people through the provision of recreation and leisure services. The Bachelor of Arts (B.A.) degree in Recreation and Leisure Studies offers students the opportunity to specialize in one of three options: Recreation Therapy, Sport Management, and Tourism Management. The program provides students with the academic foundation to pursue graduate studies and prepares them for professional careers in the broad field of recreation and leisure services.",
        "program website url": "https://www.csulb.edu/college-health-and-human-services/department-recreation-and-leisure-studies/ba-recreation-and-leisure-studies",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in Recreation",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Department of Religious Studies offers an academic, non-sectarian approach to the study of world religions. The program is committed to a critical and humanistic study of religion in its historical, social, and cultural contexts. The department's interdisciplinary program addresses the historical, textual, institutional, and cultural dimensions of religious experience. The Department prepares students for a variety of careers in fields such as social services, health care, education, government, and law. It also provides excellent preparation for graduate studies in religious studies and related disciplines. A BA degree provides a strong background in analytical and critical thinking, research, and communication skills.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/religious-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Religious Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Social Work (BASW) is an undergraduate professional degree accredited by the Council on Social Work Education (CSWE). The BASW program is designed to provide students with a generalist social work education in preparation for entry-level professional social work practice and/or graduate education. The program helps students develop the knowledge, values, and skills to provide social work services to individuals, families, groups, organizations, and communities. The curriculum focuses on culturally competent and ethical practice, social and economic justice, human rights, and critical thinking. The BASW Program utilizes an interdisciplinary approach, drawing from sociology, psychology, political science, economics, and other fields to provide a comprehensive understanding of human behavior and social systems. Students complete a supervised internship (field education) in a social service agency during their senior year, providing practical experience and opportunities to apply classroom learning.",
        "program website url": "https://www.csulb.edu/program/social-work-ba",
        "Accreditation status": "Accredited by the Council on Social Work Education (CSWE)",
        "Program name": "Bachelor of Arts in Social Work",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Students earning a Bachelor of Arts (BA) in Sociology gain analytical skills necessary to understand the forces shaping contemporary society. Graduates can pursue a wide array of rewarding careers in areas such as social justice, human resources, public service, urban planning, community organizing, journalism, and more. A Sociology BA is also a strong foundation for advanced degrees in sociology, law, social work, public administration, and education.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/department-sociology/ba-sociology",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Sociology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Speech-Language Pathology is the study of human communication and its disorders. These disorders may include problems with articulation, voice, fluency (stuttering), language, cognition, and swallowing across the lifespan. Speech-language pathologists provide assessment, diagnosis, and treatment for individuals with communication and swallowing problems in a variety of settings (e.g., schools, hospitals, rehabilitation centers, private practices). The undergraduate program at CSULB is a pre-professional program. Our goal is to prepare students to enter graduate programs in Speech-Language Pathology as graduate education is required for certification and licensure as a speech-language pathologist. CSULB is one of the few CSU campuses offering a BA degree in Speech-Language Pathology. The faculty are committed to providing rigorous academic preparation and clinical education. Our undergraduate students are active in the Speech-Language Pathology Association (SLPA) and participate in a number of department, campus, and community activities.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/speech-language-pathology",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Speech-Language Pathology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Women's, Gender, and Sexuality Studies is an interdisciplinary program that explores the social and cultural construction of gender, the history of feminist thought, and the politics of sexuality. Students learn to critically analyze social structures, power dynamics, and inequalities through a feminist and intersectional lens. The program prepares students for careers in social justice, advocacy, education, non-profit organizations, public policy, and further graduate study in a variety of fields.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/women-gender-and-sexuality-studies/ba-women-gender-and-sexuality-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Women's, Gender, and Sexuality Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "3D Media",
        "description": "The 3D Media program at CSULB offers a comprehensive and dynamic curriculum focused on the exploration of form, space, and material in contemporary art. Students engage in a diverse range of processes, from traditional sculpting techniques to cutting-edge digital fabrication and interactive installations. The program emphasizes critical thinking, conceptual development, and technical proficiency, preparing students to become innovative artists and creative professionals. With access to state-of-the-art facilities, including a fully equipped sculpture studio, woodshop, metal shop, rapid prototyping lab, and computer labs, students are encouraged to experiment across various media and develop a unique artistic voice. Faculty mentors guide students through rigorous studio courses, art history, and theory, fostering a deep understanding of historical and contemporary art practices within a supportive and interdisciplinary environment.",
        "program website url": "https://www.csulb.edu/school-of-art/bfa-3d-media",
        "Accreditation status": "Accredited by National Association of Schools of Art and Design (NASAD)",
        "Program name": "Bachelor of Fine Arts in 3D Media",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts (BFA) in Animation offers a comprehensive curriculum that covers all aspects of animation production, from traditional 2D animation to cutting-edge 3D computer graphics. Our program is designed to provide students with a strong foundation in artistic principles, storytelling, and technical skills necessary for a successful career in the animation industry.\nThrough hands-on projects, workshops, and critiques, students will develop their creative voice and technical proficiency in areas such as character design, visual development, storyboarding, layout, modeling, rigging, animation, lighting, and compositing. Our faculty, comprised of experienced professionals, guides students through a rigorous curriculum that emphasizes critical thinking, problem-solving, and collaboration.\nThe BFA in Animation program culminates in a senior film or portfolio, showcasing students' individual talents and preparing them for entry-level positions in animation studios, game companies, visual effects houses, and other related fields. With a focus on both artistic expression and industry relevance, our program prepares graduates to contribute meaningfully to the dynamic and evolving world of animation.",
        "program website url": "https://www.csulb.edu/college-the-arts/art-department/programs/bachelor-fine-arts-animation",
        "Accreditation status": null,
        "Level": "BFA",
        "Program name": "Bachelor of Fine Arts in Animation",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Art Education",
        "description": "The Art Education program provides students with the aesthetic, conceptual, and technical skills necessary for teaching in diverse educational settings. Students will explore contemporary issues in the field of art education, learning to critically analyze diverse perspectives and art practices while developing skills for implementing studio-based art curriculum that encourages creative thinking, critical inquiry, and cultural awareness. The program focuses on teaching and learning in the visual arts with K-12 students, as well as with learners in community, museum, and other non-school settings. Students in this program meet requirements for admission to the CSULB Single Subject Credential Program in Art.",
        "program website url": "https://www.csulb.edu/school-of-art/ba-art-option-art-education",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Art Education",
        "Program Page url": "https://www.csulb.edu/school-of-art/ba-art-option-art-education"
    },
    {
        "Concentration name": "Ceramic Arts",
        "description": "The Ceramic Arts program provides students with opportunities to explore and develop their unique artistic voices through diverse experiences in clay. We offer a comprehensive and rigorous curriculum that supports both technical skill development and conceptual investigation, while preparing students for professional careers in the arts and other fields. Our program promotes critical inquiry and intellectual risk-taking by encouraging students to challenge traditional notions of ceramics and embrace interdisciplinary approaches. We are committed to fostering a supportive and inclusive environment where students can thrive, exchange ideas, and push the boundaries of their creative practice. Through a combination of studio projects, critiques, lectures, and discussions, students develop a strong understanding of ceramic history, theory, and contemporary practices. We equip students with the skills and knowledge necessary to produce high-quality work, articulate their artistic intentions, and engage with the broader art world. Our graduates emerge as thoughtful, skilled, and adaptable artists, prepared to contribute to the ever-evolving landscape of contemporary art.",
        "program website url": "https://www.csulb.edu/school-of-art/bfa-art-option-ceramic-arts",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Ceramics",
        "Program Page url": "https://www.csulb.edu/school-of-art/bfa-art-option-ceramic-arts"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts (B.F.A.) in Drawing and Painting is a highly competitive and selective program committed to providing students with an extensive array of courses designed to facilitate growth toward creative and intellectual independence. The program offers a focused and rigorous course of study in studio art through the development of critical thinking and creative problem-solving skills, and through extensive practice in media, techniques and concepts. The curriculum provides students with a strong foundation in art history, theory, and professional practices in preparing students for careers in art and for advanced studies in graduate programs.",
        "program website url": "https://www.csulb.edu/academic-affairs/college-of-the-arts/school-of-art/drawing-painting-bfa",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Drawing & Painting",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts (BFA) in Fiber program at CSULB offers a comprehensive curriculum for students aspiring to become professional artists or designers. Our program explores a diverse range of traditional and contemporary fiber techniques, including weaving, surface design, dyeing, papermaking, and digital textile processes. Students are encouraged to develop a unique artistic voice through rigorous studio practice, critical inquiry, and material experimentation. The curriculum fosters strong foundational skills in design principles, creative problem-solving, and theoretical understanding within the context of contemporary art. Graduates are prepared for careers in exhibition, art production, textile design, education, and further graduate studies.",
        "program website url": "https://www.csulb.edu/school-of-art/fiber",
        "Accreditation status": "The California State University, Long Beach School of Art is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Program name": "Bachelor of Fine Arts in Fiber",
        "Program Page url": "https://www.csulb.edu/school-of-art/fiber"
    },
    {
        "Concentration name": "Graphic Design",
        "description": "The BFA in Art with an option in Graphic Design is a professionally oriented degree preparing students for careers in the rapidly expanding and evolving fields of visual communication and interaction design. The program provides the knowledge and skills necessary for students to develop their own unique creative voice, prepare them for entry-level positions in the design industry, and to pursue graduate studies in a related field. The curriculum focuses on developing design thinking, problem-solving skills, and a strong understanding of visual communication principles, including typography, imagery, and interactive media. Students gain practical experience through a combination of studio courses, theoretical studies, and opportunities for internships with leading design firms.",
        "program website url": "https://www.csulb.edu/school-of-art/bfa-art-option-graphic-design",
        "Accreditation status": null,
        "Program name": "Bachelor_of_Fine_Arts_in_Graphic_Design",
        "Program Page url": "https://www.csulb.edu/school-of-art/bfa-art-option-graphic-design"
    },
    {
        "Concentration name": "Illustration",
        "description": "The BFA in Illustration teaches students to create conceptual images through a broad range of media that communicate ideas, stories, and messages to a wide variety of audiences. The program emphasizes both personal vision and professional practices necessary to succeed in a demanding commercial environment. Students develop skills in storytelling, character design, visual development, and problem-solving while cultivating an individual illustrative voice. Through a combination of traditional and digital techniques, students learn to produce compelling imagery for diverse platforms, including editorial, advertising, publishing, entertainment, and product design. The curriculum focuses on developing a strong foundation in drawing, painting, and composition, alongside specialized courses in digital illustration, sequential art, and professional practices. Graduates are prepared for careers as freelance illustrators, concept artists, storyboard artists, editorial illustrators, children's book illustrators, and visual developers in various creative industries.",
        "program website url": "https://www.csulb.edu/school-of-art/bfa-art-option-illustration",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Illustration",
        "Program Page url": "https://www.csulb.edu/school-of-art/bfa-art-option-illustration"
    },
    {
        "Concentration name": "3D Media: Metal",
        "description": "The 3D Media: Metal concentration offers students opportunities to develop studio skills in areas of traditional and contemporary metal arts. Students are introduced to techniques and processes of forming, fabrication, casting, enameling, surface treatment, and mixed media in relation to jewelry, hollowware, and sculpture. Students learn safe studio practices and become proficient in the use of hand and power tools in a professionally equipped studio. Concepts relating to history, theory, and criticism of the medium are incorporated into the curriculum. A strong emphasis is placed on conceptual development and critical inquiry alongside technical proficiency and personal aesthetic growth. Students are encouraged to develop an independent and interdisciplinary approach to their work, which prepares them for graduate school or professional careers in the arts.",
        "program website url": "https://www.csulb.edu/school-of-art/bfa-art-option-3d-media-fiber-metal-or-wood",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Metals & Jewelry",
        "Program Page url": "https://www.csulb.edu/school-of-art/bfa-art-option-3d-media-fiber-metal-or-wood"
    },
    {
        "Concentration name": null,
        "description": "The BFA in Art with a concentration in Photography is designed for students who desire a comprehensive curriculum in photography, encompassing contemporary photographic practice and theory, art history, and a strong foundation in visual arts. The program emphasizes conceptual and technical skills, critical thinking, and professional practices within the field of photography. Students will explore diverse photographic mediums and approaches, including digital, analog, and alternative processes, preparing them for careers as artists, educators, and professionals in various photographic fields.",
        "program website url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs/bachelor-fine-arts-art-photography",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Photography",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Printmaking",
        "description": "Students in the BFA Art Option in Printmaking will acquire both traditional and contemporary technical and conceptual understanding of the art of printmaking. The program emphasizes a broad approach to printmaking as an art form and a relevant contemporary practice. Students will develop their ability to make informed creative decisions and think critically about their work, the medium, and its cultural context. This focus prepares students for a diverse range of careers in the visual arts field including exhibition, graduate school, and other professional applications.",
        "program website url": "https://www.csulb.edu/school-of-art/bfa-art-option-printmaking",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Printmaking",
        "Program Page url": "https://www.csulb.edu/school-of-art/bfa-art-option-printmaking"
    },
    {
        "Concentration name": "Sculpture",
        "description": "The Sculpture program provides students with the opportunity to develop skills in a wide range of sculptural materials and processes. Students are exposed to traditional and contemporary approaches, including carving, modeling, fabrication, casting, installation, and digital fabrication. The program emphasizes critical thinking and conceptual development, encouraging students to explore their personal vision and engage with contemporary issues through their artwork.",
        "program website url": "https://www.csulb.edu/academic-affairs/course-catalogs/bachelor-fine-arts-art",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Sculpture",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Music in Music Performance",
        "Program Page url": "https://www.reddit.com/r/MusicEd/comments/1f78csd/whats_the_difference_between_a_performance_major/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Aerospace Engineering program at California State University, Long Beach, is nationally recognized for its excellence in preparing students for successful careers in the dynamic aerospace industry. Our program provides a comprehensive education that blends theoretical knowledge with practical, hands-on experience, ensuring graduates are well-equipped to tackle real-world challenges. Students in the program develop a strong foundation in core engineering principles, including aerodynamics, propulsion, structures, flight mechanics, and control systems. The curriculum emphasizes critical thinking, problem-solving, and design skills through various projects and laboratory sessions. Our dedicated faculty members are experts in their fields, committed to providing a supportive and engaging learning environment. Graduates of the program are highly sought after by leading aerospace companies, government agencies, and research institutions for roles in design, analysis, testing, and manufacturing of aircraft and spacecraft.",
        "program website url": "https://www.csulb.edu/college-of-engineering/aerospace-engineering-bs",
        "Accreditation status": "Accredited by the Engineering Accreditation Commission of ABET, www.abet.org.",
        "Program name": "Bachelor of Science in Aerospace Engineering",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Applied Data Science is a highly interdisciplinary program that draws faculty from various departments and colleges across the university. The program is designed to provide students with a strong theoretical and practical foundation in the interdisciplinary field of data science. Students will gain the knowledge and skills necessary to collect, organize, analyze, interpret, and visualize data from various sources to extract valuable insights and make data-driven decisions. The curriculum emphasizes the application of data science principles and techniques to real-world problems in various domains. Graduates will be well-prepared for careers in data science, data analytics, business intelligence, machine learning, and related fields across various industries.",
        "program website url": "https://www.csulb.edu/academic-affairs/academic-programs/undergraduate-majors/applied-data-science",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Applied Data Science",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Biochemistry provides an intensive education in the core areas of chemistry and an emphasis in the biological aspects of chemistry. This major is certified by the American Chemical Society. The coursework and laboratory experiences prepare students for employment in a wide variety of biochemistry-related careers and for graduate study in biochemistry, chemistry or related fields. Graduates of the program are well-prepared for professional programs in medicine, dentistry, pharmacy, and veterinary medicine. Students interested in the biochemistry major should contact the Chemistry and Biochemistry Department office.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/chemistry-and-biochemistry/biochemistry-bs",
        "Accreditation status": "Certified by the American Chemical Society.",
        "Program name": "Bachelor of Science in Biochemistry",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Option in Biology Education",
        "description": null,
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/department-of-biological-sciences/bachelor-of-science-1",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology, Option in Biology Education",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "General Biology",
        "description": "The Bachelor of Science (B.S.) in Biological Sciences provides students with a broad and rigorous exposure to the biological sciences. The General Biology option is suitable for students planning careers in a variety of areas including professional careers (e.g., medicine, dentistry, pharmacy, physical therapy, etc.), biotechnology, or environmental biology. Students are prepared to pursue graduate studies in various fields of biology. The curriculum is designed to provide breadth of exposure to biological principles and depth of exposure in one or more areas of the biological sciences. The B.S. in Biological Sciences provides strong training in the physical sciences which serves as a foundation for rigorous training in biology.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/biological-sciences/bs-biological-sciences-general-biology-option",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology, Option in General Biology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Marine Biology",
        "description": "The Bachelor of Science in Biology, Option in Marine Biology, is designed for students interested in the study of marine organisms, ecosystems, and conservation. This option provides a strong foundation in biological principles while focusing on the unique aspects of marine environments, including oceanography, marine ecology, ichthyology, marine invertebrate zoology, and marine microbiology. Students gain practical experience through laboratory work, field trips to local marine habitats, and opportunities for research with faculty specializing in marine science. The curriculum prepares graduates for careers in marine research, environmental consulting, wildlife management, aquaculture, conservation, and for further graduate studies in marine biology or related fields.",
        "program website url": "https://www.csulb.edu/program/biology-bs-marine-biology-option",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology, Option in Marine Biology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Microbiology",
        "description": "The Microbiology option provides specialized coursework in the study of microorganisms, including bacteria, viruses, fungi, and protozoa. Students will gain knowledge and skills in microbial genetics, physiology, immunology, and pathogenesis.",
        "program website url": "https://www.csulb.edu/academics/colleges-departments/college-natural-sciences-and-mathematics/biological-sciences/degrees/bachelor-science-biology",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology, Option in Microbiology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Molecular Cell Biology and Physiology",
        "description": "The option in Cell and Molecular Biology and Physiology offers an interdisciplinary approach to the study of life at the cellular and molecular level. Students in this option examine the fundamental processes of living organisms, including genetics, metabolism, signal transduction, and physiological regulation. Through a combination of coursework, laboratory experiences, and research opportunities, students gain a deep understanding of how cells function, interact, and contribute to the overall physiology of an organism. This option prepares students for careers in biotechnology, biomedical research, pharmaceuticals, and health professions, as well as for graduate studies in cell biology, molecular biology, physiology, and related fields.",
        "program website url": "https://www.csulb.edu/college-natural-sciences-and-mathematics/department-biological-sciences/bs-biology-cell-molecular-biology-and",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology, Option in Molecular Cell Biology and Physiology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Option in Zoology, Botany, and Ecology",
        "description": "The Bachelor of Science (BS) degree in Biology offers three options for students interested in specializing in different aspects of the biological sciences. The Option in Zoology, Botany, and Ecology provides students with a broad education across organismal and ecological biology and prepares them for careers in research, conservation, education, and various biological industries, or for graduate studies.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-biology-option-zoology-botany-and-ecology-2025-2026",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology, Option in Zoology, Botany, and Ecology",
        "Program Page url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-biology-option-zoology-botany-and-ecology-2025-2026"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Biomedical Engineering program provides students with a strong foundation in engineering sciences and their application to the field of medicine and biology. Biomedical engineers apply traditional engineering methods and new methodologies to solve problems in biology and medicine to improve human health. Students in the program will learn to design, develop, and maintain medical equipment and systems; design and construct artificial organs, prostheses, and devices; and research new biological and physiological systems. Graduates are prepared for careers in medical device manufacturing, pharmaceuticals, biotechnology, and hospitals, or for graduate studies in biomedical engineering, medicine, and other health-related fields.",
        "program website url": "https://www.csulb.edu/college-of-engineering/biomedical-engineering-bs",
        "Accreditation status": "The Biomedical Engineering program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Biomedical Engineering",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Business Administration (BSBA) provides students with a broad and solid understanding of business practices. Students learn about the fundamental principles of business, develop a global perspective, and enhance their analytical and critical thinking skills. The program provides the knowledge and skills necessary for a successful career in a dynamic global business environment.",
        "program website url": "https://www.csulb.edu/college-of-business/bachelor-of-science-in-business-administration",
        "Accreditation status": "The College of Business at California State University, Long Beach is fully accredited by AACSB International – The Association to Advance Collegiate Schools of Business. AACSB is the premier accrediting agency for business schools worldwide. Less than five percent of the more than 16,000 schools of business worldwide have earned AACSB accreditation. AACSB-accredited schools have the highest quality faculty, relevant and challenging curriculum, and provide educational and career opportunities that are not found at other business schools. AACSB accreditation assures stakeholders that business schools will provide a high-quality education to future business leaders.",
        "Program name": "Bachelor of Science in Business Administration",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The undergraduate program in Chemical Engineering at CSULB provides students with a strong foundation in core chemical engineering principles, including thermodynamics, fluid mechanics, heat and mass transfer, reaction kinetics, and process control. The curriculum emphasizes both theoretical understanding and practical application, preparing graduates for a wide range of careers in industries such as chemical manufacturing, petroleum, pharmaceuticals, biotechnology, environmental engineering, and materials science. Students gain hands-on experience through laboratory work, design projects, and internships, fostering problem-solving skills and critical thinking.",
        "program website url": "https://www.csulb.edu/college-of-engineering/chemical-engineering/bs-chemical-engineering",
        "Accreditation status": "The Bachelor of Science in Chemical Engineering program is accredited by the Engineering Accreditation Commission of ABET, http://www.abet.org.",
        "Program name": "Bachelor of Science in Chemical Engineering",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Biochemistry, Chemical Physics, Forensic Chemistry",
        "description": "The Bachelor of Science in Chemistry provides students with a thorough background in all areas of chemistry and meets the professional standards for certification by the American Chemical Society. Students in the B.S. in Chemistry program are also well prepared for graduate work in chemistry or allied fields, and for careers as professional chemists.",
        "program website url": "https://www.csulb.edu/chemistry-biochemistry/undergraduate-degree-programs",
        "Accreditation status": "meets the professional standards for certification by the American Chemical Society",
        "Program name": "Bachelor of Science in Chemistry",
        "Program Page url": "https://www.csulb.edu/chemistry-biochemistry/undergraduate-degree-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Construction Management program at CSULB is designed to prepare students for professional careers in the construction industry. The program provides a comprehensive education in construction management principles, practices, and technologies. Students gain knowledge in areas such as project planning and control, cost estimating, scheduling, construction methods, safety, and legal aspects of construction. The curriculum emphasizes practical application through hands-on projects, case studies, and field experiences, ensuring graduates are well-equipped to manage complex construction projects effectively.",
        "program website url": "https://www.csulb.edu/college-of-engineering/bachelor-of-science-construction-management",
        "Accreditation status": null,
        "Program name": "Bachelor_of_Science_in_Civil_Engineering",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/bachelor-of-science-construction-management"
    },
    {
        "Concentration name": null,
        "description": "The Computer Engineering program is jointly administered by the Department of Electrical Engineering and the Department of Computer Engineering and Computer Science. It provides students with fundamental knowledge in both hardware and software aspects of computer systems. Graduates of the program are well prepared for a wide range of careers in designing, developing, and testing computer hardware, software, and embedded systems, or for graduate studies in computer engineering or related disciplines.",
        "program website url": "https://www.csulb.edu/college-of-engineering/computer-engineering-bs",
        "Accreditation status": "The Computer Engineering program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Computer Engineering",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Computer Engineering Technology (CET) at CSULB is a hands-on, practice-oriented program. It covers fundamental principles and applications of computer hardware, software, and networking. The program prepares students for careers that require the application of current and emerging computer technologies for the design, development, and implementation of computer systems. Graduates will have the ability to analyze, design, and implement computer systems involving the integration of hardware and software. They will also be able to apply current and emerging technologies to the solution of computer engineering problems, and be able to communicate effectively through written and oral presentations.",
        "program website url": "https://www.csulb.edu/international/future-students/bachelor-of-science-in-computer-engineering-technology",
        "Accreditation status": "The Bachelor of Science in Computer Engineering Technology program is accredited by the Engineering Technology Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Computer Engineering Technology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Computer Science (BSCS) program prepares students for careers in the rapidly growing and evolving fields of computer science and software engineering. The program provides a strong foundation in theoretical computer science, including algorithms, data structures, and discrete mathematics, as well as practical skills in programming languages, software development, and computer systems. Students gain hands-on experience through projects, labs, and internships, developing critical thinking, problem-solving, and teamwork skills essential for success in the industry. Graduates are well-prepared for diverse roles such as software engineers, data scientists, cybersecurity analysts, and system administrators, and for pursuing graduate studies in computer science or related disciplines.",
        "program website url": "https://www.csulb.edu/college-of-engineering/computer-science",
        "Accreditation status": "Accredited by ABET.",
        "Program name": "Bachelor of Science in Computer Science",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Construction Engineering Management (CEM) combines civil engineering topics with construction management principles, preparing graduates to manage and implement civil infrastructure projects, such as highways, bridges, dams, buildings, and other facilities. Our graduates are problem solvers that manage people, materials, equipment, and money to deliver civil engineering projects. The CEM program focuses on civil engineering design and construction engineering principles that differentiate it from construction management programs typically housed in colleges of business. Our program prepares students for careers as construction engineers and construction managers. The curriculum provides a strong foundation in mathematics, physics, and basic engineering sciences and covers areas such as structural analysis and design, geotechnical engineering, water resources engineering, highway design, construction methods, cost estimating, scheduling, construction law, and project management. The curriculum also includes a capstone design project that integrates knowledge and skills gained from previous courses to solve real-world construction engineering management problems.",
        "program website url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs/construction-engineering-management-bs",
        "Accreditation status": "The Bachelor of Science in Construction Engineering Management is accredited by the Engineering Accreditation Commission of ABET, http://www.abet.org.",
        "Program name": "Bachelor of Science in Construction Engineering Management",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Construction Engineering Management (BSCEM) program at CSU Long Beach prepares students for diverse careers in the construction industry. Our curriculum is designed to provide students with a strong foundation in engineering principles, business management, and construction methods. Graduates are equipped to manage complex construction projects, from initial planning and design to execution and completion. The program emphasizes problem-solving, critical thinking, and ethical decision-making, ensuring students are well-rounded professionals ready to tackle the challenges of modern construction. We integrate hands-on learning, field trips, and industry speaker events to enhance the educational experience and connect students with real-world practices.",
        "program website url": "https://www.csulb.edu/college-of-engineering/civil-engineering-construction-engineering-management",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Construction Management",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/civil-engineering-construction-engineering-management"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Criminology and Criminal Justice provides students with a comprehensive understanding of crime and justice. The major emphasizes critical thinking, analytical skills, and ethical considerations, preparing students for various careers in law enforcement, corrections, courts, and victim services, as well as for graduate studies. The curriculum explores the causes of crime, the operation of the criminal justice system, and the social and legal responses to crime. Through a combination of theoretical knowledge and practical application, students gain insights into the complexities of crime, justice, and social control.",
        "program website url": "https://www.csulb.edu/academic-affairs/catalog/college-health-and-human-services/criminology-and-criminal-justice/bachelor-science-criminology-and-criminal-justice",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Criminology and Criminal Justice",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/criminology-criminal-justice-and-emergency-management"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Earth Systems provides a comprehensive and interdisciplinary study of the Earth, including its physical, chemical, biological, and human processes. This program integrates aspects of geology, oceanography, meteorology, environmental science, and remote sensing to understand the complex interactions within Earth's systems. Students will develop a strong foundation in scientific principles, quantitative analysis, and field techniques, preparing them for careers in environmental consulting, natural resource management, research, and education, or for advanced studies in Earth and environmental sciences. The curriculum emphasizes hands-on learning, critical thinking, and problem-solving skills to address current and future environmental challenges.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-earth-systems-2024-2025-catalog",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Earth Systems",
        "Program Page url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-earth-systems-2024-2025-catalog"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Electrical Engineering curriculum prepares students for entry into the profession of electrical engineering and for further study at the graduate level. The curriculum provides a strong foundation in mathematics, physics, and general education, followed by a core of electrical engineering subjects, and a variety of elective courses in specialized areas of electrical engineering. The curriculum emphasizes hands-on experience through laboratory work and design projects throughout the program. The Electrical Engineering Program is accredited by the Engineering Accreditation Commission of ABET, http://www.abet.org.\n\nElectrical Engineering Program Educational Objectives (PEOs):\nThe Electrical Engineering Program will prepare graduates to attain the following objectives within a few years of graduation:\n1. Be employed in electrical engineering or related areas, and contribute to the economic development of the region, state, and nation.\n2. Engage in professional development, continuing education, and/or graduate studies.\n3. Conduct themselves as ethical and responsible professionals in local, national, and global communities.\n\nStudent Outcomes (SOs):\nAt the time of graduation, students in the Electrical Engineering program will be able to:\n1. an ability to identify, formulate, and solve complex engineering problems by applying principles of engineering, science, and mathematics\n2. an ability to apply engineering design to produce solutions that meet specified needs with consideration of public health, safety, and welfare, as well as global, cultural, social, environmental, and economic factors\n3. an ability to communicate effectively with a range of audiences\n4. an ability to recognize ethical and professional responsibilities in engineering situations and make informed judgments, which must consider the impact of engineering solutions in global, economic, environmental, and societal contexts\n5. an ability to function effectively on a team whose members together provide leadership, create a collaborative and inclusive environment, establish goals, plan tasks, and meet objectives\n6. an ability to develop and conduct appropriate experimentation, analyze and interpret data, and use engineering judgment to draw conclusions\n7. an ability to acquire and apply new knowledge as needed, using appropriate learning strategies.",
        "program website url": "https://www.csulb.edu/college-of-engineering/ee-undergraduate-programs",
        "Accreditation status": "The Electrical Engineering Program is accredited by the Engineering Accreditation Commission of ABET, http://www.abet.org.",
        "Program name": "Bachelor of Science in Electrical Engineering",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/ee-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Electronics Engineering Technology (BSEET) program at California State University, Long Beach (CSULB) prepares students for a wide range of technical and management careers in the electronics and high-tech industries. The curriculum focuses on the practical application of engineering principles, combining theoretical knowledge with hands-on experience in areas such as analog and digital electronics, microcontrollers, control systems, instrumentation, communication systems, and power electronics. Students develop skills in circuit design, testing, troubleshooting, and project management, making them highly sought after by employers. The program emphasizes problem-solving, critical thinking, and teamwork, ensuring graduates are well-equipped to adapt to evolving technological advancements and contribute effectively in a professional engineering environment.",
        "program website url": "https://www.csulb.edu/college-of-engineering/bachelors-science-electronics-engineering-technology",
        "Accreditation status": "The Bachelor of Science in Electronics Engineering Technology program is accredited by the Engineering Technology Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Electronics Engineering Technology",
        "Program Page url": "https://www.csulb.edu/college-of-engineering"
    },
    {
        "Concentration name": null,
        "description": "The B.S. in Engineering Technology (BSET) program emphasizes the application of scientific and engineering principles to the solution of practical problems. Engineering Technology students learn by doing. The curriculum is a blend of theory and application with a hands-on approach, utilizing state-of-the-art facilities in manufacturing, mechanical design, thermal-fluid systems, and automation. Graduates are prepared for a wide variety of careers in industry including product development, manufacturing, quality control, technical sales, and facilities management.",
        "program website url": "https://www.csulb.edu/college-of-engineering/department-of-mechanical-aerospace-engineering/bs-engineering-technology",
        "Accreditation status": "The Engineering Technology B.S. program is accredited by the Engineering Technology Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Engineering Technology",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Environmental engineers protect people and the planet from pollution, climate change, and other global problems. They solve complex environmental problems through scientific, technical, and management principles. They design and construct water and wastewater treatment plants, manage solid and hazardous waste, develop alternative energy, manage air pollution, investigate contaminated sites, and implement regulations. They also work in government, industry, and consulting firms on a variety of environmental issues. The mission of the Bachelor of Science in Environmental Engineering program at CSULB is to produce graduates who are technically competent and ethically responsible to address environmental problems related to water, wastewater, stormwater, air, land, and energy resources. The goals of the program are to provide students with strong fundamentals in mathematics, science, and engineering; to provide a comprehensive education in environmental engineering; and to develop skills for professional success.",
        "program website url": "https://www.csulb.edu/college-of-engineering/environmental-engineering-bs",
        "Accreditation status": "The Bachelor of Science in Environmental Engineering program is accredited by the Engineering Accreditation Commission of ABET, http://www.abet.org.",
        "Program name": "Bachelor of Science in Environmental Engineering",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Environmental Science and Public Policy",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-ESP%20BS%2023-24.pdf"
    },
    {
        "Concentration name": "Child Development and Family Studies",
        "description": "The Bachelor of Arts in Child Development and Family Studies (CDFS) focuses on the study of children and families in diverse contexts. The program provides students with a strong foundation in theories, research, and practices related to individual and family development across the lifespan. Students will examine various aspects of child and family well-being, including cognitive, social, emotional, and physical development, as well as family dynamics, parenting, and cultural influences. The program prepares students for careers in child and family services, education, advocacy, and research, or for advanced studies in related fields. The CDFS program emphasizes critical thinking, ethical considerations, and culturally responsive practices.",
        "program website url": "https://www.csulb.edu/academic-senate/bachelor-of-arts-child-development-and-family-studies-option-child-development-and",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Science in Family and Consumer Sciences, Option in Child Development and Family Studies",
        "Program Page url": "https://www.csulb.edu/academic-senate/bachelor-of-arts-child-development-and-family-studies-option-child-development-and"
    },
    {
        "Concentration name": "Consumer Affairs",
        "description": "The Option in Consumer Affairs is designed to prepare students for careers that help individuals and families improve the quality of their lives as consumers of goods and services. The curriculum provides students with a strong foundation in consumer theories, issues, and practices, emphasizing critical thinking, problem-solving, and ethical decision-making. Areas of study include consumer rights and responsibilities, consumer protection laws and regulations, personal finance, consumer advocacy, and market analysis.",
        "program website url": "http://catalog.csulb.edu/preview_program.php?catoid=7&poid=3321",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Family and Consumer Sciences, Option in Consumer Affairs",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/degrees-offered"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Family and Consumer Sciences, Option in Family Life Education",
        "Program Page url": "https://www.uwyo.edu/fcs/index.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Finance provides a comprehensive curriculum in the theory and practice of finance and financial management. Students learn to apply finance theory to real-world problems and develop analytical skills in areas such as investments, corporate finance, financial planning, and financial institutions. The curriculum covers a wide range of topics, including financial markets, valuation, risk management, capital budgeting, and portfolio management. Graduates are prepared for careers in various sectors of the financial industry, including banking, investment management, corporate finance, financial planning, and real estate. The program also provides a strong foundation for graduate studies in finance or related fields.",
        "program website url": "https://www.csulb.edu/college-of-business/finance-bs",
        "Accreditation status": "The College of Business, which houses the Finance program, is accredited by AACSB International, the premier accrediting agency for business schools worldwide.",
        "Program name": "Bachelor of Science in Finance",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Geography",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/Geog-Planner-BS-3-Step-Plan_Spring-2024.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Geology",
        "Program Page url": "https://catalog.ucsb.edu/departments/ERTSC/overview"
    },
    {
        "Concentration name": "Healthcare Data Analytics",
        "description": "The Bachelor of Science (BS) in Health Care Administration prepares students for administrative positions in the growing health care industry. The department offers several options for students to specialize in a particular area of interest. The curriculum is constantly being updated to reflect new developments and demands in the dynamic health care sector. The program focuses on providing students with the leadership and management skills required to address current and future challenges in the health care industry. A critical component of the curriculum is the internship experience, which provides students with practical exposure to the health care field under the guidance of experienced professionals.",
        "program website url": "https://www.csulb.edu/college-health-human-services/department-health-science/health-care-administration-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Health Care Administration, Option in Healthcare Data Analytics",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Risk Management and Safety",
        "description": "The option in Risk Management and Safety provides students with knowledge and skills for entry- and mid-level positions in safety and risk management in both the private and public health care sector. The option prepares students to analyze problems, identify solutions, and implement strategies for addressing safety issues and minimizing risk. The curriculum incorporates knowledge in business practices, risk assessment and control, laws and regulations, environmental health, and emergency preparedness applicable to various health care settings.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/health-care-administration/risk-management-safety-option",
        "Accreditation status": "Accredited by the Commission on Accreditation of Healthcare Management Education (CAHME).",
        "Program name": "Bachelor of Science in Health Care Administration, Option in Risk Management and Safety",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Community Health Education",
        "description": "Community Health Education (CHE) specialists are prepared to work in a variety of settings including governmental agencies, community-based organizations, hospitals, clinics, and private industry. CHE specialists develop, implement, and evaluate health education programs that promote, maintain, and improve individual and community health. They serve as a resource for current health information and programming in areas such as communicable and chronic diseases, maternal and child health, nutrition, physical activity, substance use, and mental health. The program prepares graduates for entry-level positions in a variety of health promotion settings and for graduate study in public health, health promotion, and other related fields. Our graduates are eligible to sit for the national Certified Health Education Specialist (CHES) examination. Learn more about the CHE option.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/health-science/undergraduate-programs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Health Science, Option in Community Health Education",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "School Health Education",
        "description": "This option prepares future educators to meet the needs of diverse student populations in the context of K-12 school health. The program provides the foundational knowledge, skills, and dispositions to promote the health of students, teachers, staff, and the wider school community. Students in the School Health Education Option learn to design, implement, and evaluate health education programs and services in school settings. The curriculum emphasizes critical thinking, cultural competency, and evidence-based practices relevant to contemporary school health challenges.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/health-science/undergraduate-program-options-courses",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Health Science, Option in School Health Education",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/health-science/undergraduate-program-options-courses"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (B.S.) in Hospitality Management prepares students for managerial careers in hospitality and tourism industries. The program also offers a Minor in Hospitality Management. This degree program prepares future hospitality industry leaders, with a strong focus on analytical skills, technology application, and global awareness.",
        "program website url": "https://www.csulb.edu/college-of-business/hospitality-management-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Hospitality and Tourism Management",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Hospitality Management provides students with the academic foundation and practical experience necessary to become successful hospitality leaders. The program emphasizes a global perspective and focuses on the development of critical thinking, problem-solving, and leadership skills essential for managing various aspects of the hospitality industry. Students gain a comprehensive understanding of hospitality operations, finance, marketing, human resources, and strategic management, preparing them for diverse career opportunities in hotels, restaurants, resorts, event management, and other related sectors. The curriculum integrates theoretical knowledge with hands-on experiences, including internships, to ensure graduates are well-equipped to meet the challenges and demands of the dynamic global hospitality landscape.",
        "program website url": "https://www.csulb.edu/college-of-business/hospitality-management-bs",
        "Accreditation status": "The College of Business, which offers the Bachelor of Science in Hospitality Management program, is accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Program name": "Bachelor of Science in Hospitality Management",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Human Resources Management undergraduate program is committed to preparing students for careers in the dynamic and challenging field of Human Resources. Human Resources provides an organization with a competitive advantage through its people. The HR professional contributes to this by developing strategies and managing functions related to staffing, training and development, compensation, performance management, health and safety, employee and labor relations, and organizational development and change. Our graduates are highly sought after by organizations across industries and sectors including business, non-profit, and government. Our faculty are experts in the field, passionate about teaching, and committed to providing students with an excellent learning experience. The curriculum is comprehensive and aligned with industry standards, and is designed to provide students with the knowledge, skills, and abilities needed for success as an HR professional.",
        "program website url": "https://www.csulb.edu/international/human-resource-management-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Human Resource Management",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Information Systems (BSIS) program is designed to provide students with the knowledge and skills necessary to design, develop, implement, and manage information systems within organizations. Information Systems professionals bridge the gap between business needs and technology solutions, playing a crucial role in modern enterprises. The curriculum covers a broad range of topics, including database management, systems analysis and design, programming, networking, cybersecurity, business intelligence, and project management. Students learn to apply theoretical concepts to real-world problems through hands-on projects, case studies, and internships. Graduates of the BSIS program are prepared for diverse career paths in areas such as systems analysis, IT consulting, data analysis, network administration, cybersecurity analysis, software development, and project management across various industries.",
        "program website url": "https://www.csulb.edu/college-of-business/information-systems-bs",
        "Accreditation status": "All programs in the College of Business are accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Program name": "Bachelor of Science in Information Systems",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in International Business",
        "Program Page url": "https://broad.msu.edu/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Kinesiology, Option in Exercise Science",
        "Program Page url": "https://www.taylor.edu/academics/programs/kinesiology"
    },
    {
        "Concentration name": "Fitness",
        "description": "The Fitness Option provides students with an understanding of physical activity, exercise, and health through the lifespan. Students completing this option are prepared to work with healthy individuals and clinical populations in a variety of settings. This option prepares students for positions in corporate, community, and clinical fitness settings. Some positions include: personal trainers, group exercise instructors, fitness managers, wellness coordinators, health educators, clinical exercise physiologists, and strength and conditioning coaches. It also prepares students for graduate school in clinical exercise physiology, public health, physical therapy, occupational therapy, and chiropractic school.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Kinesiology, Option in Fitness",
        "Program Page url": "https://www.csulb.edu/sites/default/files/document/faq_kinesiology_fitness_v3.pdf"
    },
    {
        "Concentration name": "Physical Education- Teacher Education",
        "description": "The Physical Education-Teacher Education Option (PE-T.E.) is designed for students who are interested in pursuing a career in teaching Physical Education in public and private schools (K-12). The program provides a pathway toward obtaining the California Single Subject Teaching Credential in Physical Education through its coursework and fieldwork experiences. The program includes subject matter preparation courses, professional education courses, fieldwork, and student teaching experiences necessary to develop expertise in teaching K-12 Physical Education. Upon successful completion of the PE-T.E. Option and passage of the CBEST and CSET examinations, students may apply to the credential program to receive their preliminary California Single Subject Teaching Credential in Physical Education. The PE-T.E. option is housed in the Department of Kinesiology, College of Health and Human Services.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/kinesiology/undergraduate-programs/bachelor-science-kinesiology-pe-teacher-education-option",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Kinesiology, Option in Physical Education- Teacher Education",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Sport Psychology and Leadership",
        "description": "The Sport Psychology and Leadership option is designed to prepare students for careers or graduate study in areas such as sport psychology, coaching, sport consulting, corporate wellness, health and fitness, personal training, and various leadership positions within sport organizations. Students gain knowledge in areas such as motor learning, performance enhancement, sport and exercise psychology, leadership, coaching, exercise physiology, biomechanics, and sport pedagogy. This option emphasizes the psychosocial and behavioral aspects of human movement across the lifespan, from diverse populations and settings.",
        "program website url": "https://www.csulb.edu/academic-affairs/college-of-health-and-human-services/kinesiology-bs-sport-psychology-and-leadership",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Kinesiology, Option in Sport Psychology and Leadership",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Managerial Economics",
        "Program Page url": "https://liberalarts.temple.edu/academics/departments-and-programs/economics/undergraduate"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Marketing program at CSULB is designed to provide students with a comprehensive understanding of marketing principles and practices. Students learn how to analyze markets, develop marketing strategies, manage brands, conduct market research, and utilize digital marketing tools. The program prepares students for a wide range of careers in marketing, including brand management, market research, advertising, public relations, digital marketing, and sales. Students can choose from three emphasis areas to specialize their studies: Digital Marketing, Professional Selling and Sales Management, and General Marketing. This flexibility allows students to tailor their education to their specific career interests and goals. The curriculum combines theoretical knowledge with practical applications, often involving real-world projects and case studies, to ensure graduates are well-prepared for the dynamic marketing industry.",
        "program website url": "https://www.csulb.edu/college-of-business/marketing",
        "Accreditation status": "AACSB Accredited (College of Business)",
        "Program name": "Bachelor of Science in Marketing",
        "Program Page url": "https://www.csulb.edu/college-of-business/marketing"
    },
    {
        "Concentration name": null,
        "description": "Materials science is a multidisciplinary field that combines chemistry, physics, and engineering to understand the fundamental properties, structure, and performance of materials. At CSULB, the Materials Science program offers a Bachelor of Science (BS) degree that prepares students for careers in industries such as aerospace, automotive, electronics, biomaterials, and energy. Our curriculum emphasizes hands-on learning, research opportunities, and collaborations with industry partners, providing students with practical skills and knowledge to address real-world challenges. Students in the Materials Science program will explore topics such as crystallography, thermodynamics, kinetics, mechanical properties, electrical properties, and optical properties of materials. They will learn to characterize, process, and design new materials with tailored properties for various applications. Our program also provides a strong foundation for graduate studies in materials science, engineering, or related fields.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/materials-science",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Materials Science",
        "Program Page url": "https://www.csulb.edu/physics-astronomy/undergraduate-programs"
    },
    {
        "Concentration name": "Option in Applied Mathematics",
        "description": "The Bachelor of Science in Mathematics provides students with a strong foundation in mathematics, including concepts and applications, problem-solving skills, and the ability to communicate mathematical ideas effectively. This program prepares students for a variety of careers in industry, government, and education, as well as for graduate studies in mathematics or related fields. The Applied Mathematics option focuses on mathematical modeling, numerical analysis, optimization, and statistical methods, preparing students to apply mathematical techniques to solve real-world problems in science, engineering, business, and other areas.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-mathematics-option-applied-mathematics-application-1",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Mathematics, Option in Applied Mathematics",
        "Program Page url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-mathematics-option-applied-mathematics-application-1"
    },
    {
        "Concentration name": "Applied Statistics",
        "description": "The B.S. in Mathematics with an Option in Applied Statistics provides students with a solid mathematical foundation and specialized training in statistical theory and methods. This program prepares students for careers in fields that require statistical analysis and data interpretation, such as actuarial science, biomedical research, data science, market research, and quality control. Students develop critical thinking skills, problem-solving abilities, and expertise in statistical software and methodologies, making them highly competitive in today's data-driven world. The curriculum includes courses in probability, mathematical statistics, regression analysis, experimental design, and statistical computing. Graduates are well-prepared for entry-level positions in industry, government, and non-profit organizations, or for further graduate studies in statistics or related quantitative fields.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/mathematics-and-statistics/bs-mathematics-applied-statistics-option",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Mathematics, Option in Applied Statistics",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Mathematics Education",
        "description": "The Bachelor of Science in Mathematics, Option in Mathematics Education is a comprehensive major that provides students with the mathematical depth and breadth necessary for a secondary mathematics teaching career. The program prepares students for the California Single Subject Credential in Mathematics and further graduate study in mathematics education. Students complete coursework in foundational mathematics, advanced mathematics topics, and mathematics education pedagogy. The curriculum emphasizes problem-solving, mathematical reasoning, and communication skills. The program also includes fieldwork experiences in secondary schools, allowing students to apply theoretical knowledge in practical settings. Graduates of the program are well-prepared to teach mathematics in middle schools and high schools, and to pursue leadership roles in mathematics education.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-mathematics-option-mathematics-education-2024-2025",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Mathematics, Option in Mathematics Education",
        "Program Page url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/bs-mathematics-option-mathematics-education-2024-2025"
    },
    {
        "Concentration name": null,
        "description": "Mechanical engineering is one of the broadest and oldest engineering disciplines. Mechanical engineers are involved in the design, analysis, and manufacturing of mechanical systems, often involving energy conversion and utilization. The Mechanical Engineering program at California State University, Long Beach is designed to provide students with a strong theoretical and practical background in these areas. The curriculum includes courses in mechanics, thermodynamics, fluid mechanics, heat transfer, materials science, manufacturing processes, and system design and control. Students gain hands-on experience through laboratory work and design projects, preparing them for a wide range of careers in industries such as aerospace, automotive, energy, robotics, and biomedical devices, or for further graduate studies.",
        "program website url": "https://www.csulb.edu/college-of-engineering/department-of-mechanical-and-aerospace-engineering/mechanical-engineering-bs",
        "Accreditation status": "Accredited by the Engineering Accreditation Commission of ABET, http://www.abet.org.",
        "Program name": "Bachelor of Science in Mechanical Engineering",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Nursing (BSN) program at California State University, Long Beach, prepares students for entry-level professional nursing practice. The curriculum integrates theoretical knowledge with clinical experience, emphasizing critical thinking, evidence-based practice, and cultural competence. Graduates are equipped to provide holistic care to diverse populations in various healthcare settings and are prepared for licensure as Registered Nurses (RNs). The School of Nursing offers two distinct pathways to obtain a BSN degree: a Pre-Licensure BSN track for students without a prior nursing license and an RN to BSN track for Associate Degree or Diploma prepared Registered Nurses. Each track is designed to meet the unique needs of its student population while upholding the highest standards of nursing education.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/school-of-nursing/bachelor-of-science-in-nursing-bsn",
        "Accreditation status": "The Bachelor of Science in Nursing (BSN) program at California State University, Long Beach, is accredited by the Commission on Collegiate Nursing Education (CCNE), 655 K Street NW, Suite 750, Washington, DC 20001, 202-887-6791. The program is also approved by the California Board of Registered Nursing (BRN).",
        "Program name": "Bachelor of Science in Nursing",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The undergraduate program in Nutrition and Dietetics provides comprehensive instruction in food, nutrition, and food service systems. It is approved by the Accreditation Council for Education in Nutrition and Dietetics (ACEND) of the Academy of Nutrition and Dietetics as a Didactic Program in Dietetics (DPD).",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/academic-programs/nutrition-dietetics-bs",
        "Accreditation status": "Approved by the Accreditation Council for Education in Nutrition and Dietetics (ACEND) of the Academy of Nutrition and Dietetics as a Didactic Program in Dietetics (DPD).",
        "Program name": "Bachelor of Science in Nutrition and Dietetics",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences"
    },
    {
        "Concentration name": "Operations and Supply Chain Management",
        "description": "The Bachelor of Science in Business Administration - Operations and Supply Chain Management (OSCM) prepares students to be effective and responsible professionals in a wide range of careers including supply chain management, logistics, quality management, project management, operations management, procurement, and consulting. The program emphasizes decision making, problem-solving, and continuous improvement through an innovative curriculum that integrates both theoretical knowledge and practical skills. Students develop strong analytical and quantitative skills using relevant software tools.",
        "program website url": "https://www.csulb.edu/college-of-business/information-systems-and-operations-management/bachelor-science-business",
        "Accreditation status": "Accredited by AACSB International (the premier global accrediting body for business schools).",
        "Program name": "Bachelor of Science in Operations and Supply Chain Management",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Option in Materials Science",
        "description": "Our Department of Physics and Astronomy offers a B.S. in Physics with an Option in Materials Science. The Materials Science option focuses on the structure, properties, processing, and performance of materials, preparing students for careers in materials-related industries or for graduate study in materials science and engineering. Students will develop a strong foundation in physics while also gaining specialized knowledge in the science of materials.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/department-of-physics-and-astronomy/bachelor-of-science-physics-option-materials-science",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Physics, Option in Materials Science",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Recreation Therapy (RT) is a systematic process that utilizes recreation and other activity-based interventions to address the assessed needs of individuals with illnesses and/or disabling conditions, as a means to psychological and physical health, recovery and well-being. The purpose of the Bachelor of Science (BS) in Recreation Therapy program at California State University, Long Beach (CSULB) is to prepare students with the foundational knowledge and practical skills necessary to provide recreation therapy services across the continuum of care. The program aims to prepare students to successfully pass the national certification exam to become a Certified Therapeutic Recreation Specialist (CTRS) upon completion of the program, including practicum and internship experiences.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Recreation Therapy",
        "Program Page url": "https://www.csulb.edu/sites/default/files/document/ps_22-09_-_bs_recreation_therapy_elevation.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Africana Studies",
        "Program Page url": "https://college.berklee.edu/minors/minor-in-africana-studies"
    },
    {
        "Concentration name": null,
        "description": "The minor in American Sign Language and Deaf Cultures provides students with an understanding of American Sign Language (ASL) linguistics and its cultural applications within the Deaf community. This minor provides an understanding of Deaf individuals and the impact of deafness from a historical and societal perspective. Through study, students will acquire proficiency in ASL and learn about Deaf Culture, Deaf history, and the politics of Deafness. Students will learn the social, educational, and political ramifications of being Deaf within a hearing society. This minor prepares students for careers working with Deaf individuals and the organizations that serve them. It also provides a strong foundation for students interested in pursuing graduate studies in Deaf education, interpreting, audiology, linguistics, or related fields.",
        "program website url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-ASL%20and%20Deaf%20Cultures%20UM%2023-24.pdf",
        "Accreditation status": null,
        "Program name": "Minor in American Sign Language Deaf Cultures",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-ASL%20and%20Deaf%20Cultures%20UM%2023-24.pdf"
    },
    {
        "Concentration name": null,
        "description": "The American Studies Minor is an interdisciplinary program designed to give students a broad knowledge of the social, political, cultural, and economic forces shaping the American experience. Students take courses offered by participating departments in American Studies which include Anthropology, Art History, Black Studies, Chicano and Latino Studies, English, History, Journalism and Mass Communication, Political Science, Religious Studies, and Women’s, Gender, and Sexuality Studies. The program provides students with a multidisciplinary perspective to analyze complex issues within American society. Courses for the American Studies minor satisfy General Education requirements. Some major restrictions may apply.",
        "program website url": "https://www.csulb.edu/academic-affairs/course-catalog/american-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in American Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "A minor in anthropology provides students with an integrated understanding of humanity that is grounded in the methods and theories of anthropology's four subfields. The minor allows students to pursue their interests in anthropology, supplementing their major with an anthropological perspective on the world. The minor requires a total of 18 units, consisting of 6 units of required coursework and 12 units of elective coursework.",
        "program website url": "https://cla.csulb.edu/departments/anthropology/undergraduate-programs/minor-in-anthropology/",
        "Accreditation status": null,
        "Program name": "Minor in Anthropology",
        "Program Page url": "https://cla.csulb.edu/departments/anthropology/contact-us/"
    },
    {
        "Concentration name": null,
        "description": "A minor in Asian American Studies is excellent for those who wish to develop skills and knowledge in an interdisciplinary field that helps them understand the historical and contemporary experiences of Asian Americans. This program supports your major by providing coursework that will challenge you to think critically about race, ethnicity, immigration, gender, class, and sexuality within both American and global contexts. You will also develop a deeper understanding of the diverse communities of Asian Americans, explore issues of social justice, and enhance your awareness of the unique challenges and contributions of Asian Americans. The minor will provide you with analytical and critical thinking skills that can be applied to a variety of careers and post-graduate studies.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/asian-and-asian-american-studies/minor-asian-american-studies",
        "Accreditation status": null,
        "Program name": "Minor in Asian & Asian American Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Business Administration provides students from outside the College of Business a basic understanding of business disciplines that will complement their major. Students will develop a foundational understanding of various business functions, including accounting, finance, marketing, management, and information systems. This minor will provide students with practical skills that can be applied in various professional settings, enhancing their career prospects. The Business Administration Minor requires 24 units.",
        "program website url": "https://www.csulb.edu/college-of-business/degree-programs/business-administration-minor",
        "Accreditation status": null,
        "Program name": "Minor in Business Administration",
        "Program Page url": "https://biz.colostate.edu/academics/undergraduate-programs/minors"
    },
    {
        "Concentration name": null,
        "description": "The minor in Cambodian (Khmer) is designed for students who are interested in Cambodian language, literature, and culture. The minor requires a minimum of 18 units of coursework, including 9 units of Cambodian language courses and 9 units of Cambodian culture courses. Students will have the opportunity to study a range of topics, including Cambodian history, politics, religion, arts, and society. The minor is interdisciplinary and draws on courses from various departments, including Asian and Asian American Studies, History, Political Science, Religious Studies, and Art. The minor is open to all students, regardless of their major, and can be completed in conjunction with any bachelor's degree program.",
        "program website url": "https://www.csulb.edu/academic-programs/asian-and-asian-american-studies/minor-cambodian-khmer",
        "Accreditation status": null,
        "Program name": "Minor in Cambodian (Khmer)",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The minor in Chicano and Latino Studies is an interdisciplinary program designed to give students a comprehensive knowledge of the Chicano and Latino experience, including the history, culture, politics, and social issues impacting these communities. The minor complements a wide variety of majors, providing students with critical perspectives and analytical skills relevant to an increasingly diverse society.",
        "program website url": "https://www.csulb.edu/academic-advising/chicano-latino-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in Chicano & Latino Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Chinese Language and Culture Minor aims to provide students with comprehensive knowledge of Chinese language, history, and culture. The minor requires a minimum of 18 units, of which 6 units are required courses and 12 units are elective courses. The program offers students an opportunity to develop an understanding of China's rich cultural heritage and its contemporary society. Students will develop proficiency in Chinese language and enhance their cross-cultural communication skills. This minor is an excellent complement to a variety of majors, including International Studies, Business Administration, Political Science, and History.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/asian-african-studies/programs/chinese-language-culture-minor",
        "Accreditation status": null,
        "Program name": "Minor in Chinese Language & Culture",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The minor in Classical Studies offers students the opportunity to learn about the ancient Mediterranean world through a study of its history, literature, philosophy, languages, and material culture. The minor offers students the opportunity to develop skills in critical thinking and analysis, research, and communication. It prepares students for a variety of careers in fields such as education, law, journalism, public service, and the arts, or for graduate work in ancient history, archaeology, classical languages and literature, and related fields. The minor combines courses from a variety of disciplines, including Art History, Comparative World Literature, Greek, History, Latin, and Philosophy. It is an excellent complement to majors in those disciplines, as well as to majors in English, Film and Electronic Arts, Journalism, Liberal Studies, Political Science, Religious Studies, and Women’s, Gender, and Sexuality Studies.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/comparative-world-literature-and-classics/classical-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in Classical Studies",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/atlas/major-checklists"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/communication-studies/minor-in-communication-studies",
        "Accreditation status": null,
        "Program name": "Minor in Communication Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Comparative World Literature is an interdisciplinary field involving the study of literature across national and linguistic boundaries. Students in the minor learn how to analyze the diverse aspects of world literatures, including the historical, political, social, and aesthetic characteristics of texts from various cultural contexts. This minor is for students who want to develop a broad knowledge of literature while also developing critical thinking and writing skills.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/comparative-world-literature-and-classics",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Comparative World Literature",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/comparative-world-literature-and-classics"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Criminal Justice is designed for students interested in a focused study of the criminal justice system and related topics. This minor complements a wide range of majors, providing students with a foundational understanding of various components such as law enforcement, courts, corrections, and theories of crime and deviance. It is ideal for students considering careers in law enforcement, legal fields, social work, public policy, or further graduate studies in criminology and criminal justice.\nStudents pursuing this minor will explore the complexities of criminal behavior, the societal responses to crime, and the ethical dilemmas inherent in the justice system. The curriculum emphasizes critical thinking, analytical skills, and an interdisciplinary approach to understanding crime and justice issues. Through core courses and electives, students will gain insights into the historical development, current practices, and future challenges of the criminal justice field.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/criminology-and-criminal-justice/undergraduate-programs/minor-criminal-justice",
        "Accreditation status": null,
        "Program name": "Minor in Criminal Justice",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in Economics",
        "Program Page url": "https://www.ul.ie/media/25933/download?inline"
    },
    {
        "Concentration name": null,
        "description": "A Minor in Creative Writing consists of 24 units in English. This minor supports the development of students' writing abilities in fiction, poetry, and/or creative nonfiction. Students will also gain a deeper understanding of literary forms and strategies as a writer and reader. Students apply to the minor only after completing the 6 units of lower division coursework and ENGL 302: Introduction to Creative Writing. Successful applicants will submit a writing sample demonstrating strong potential in their area of emphasis.",
        "program website url": "https://www.csulb.edu/program/creative-writing-minor",
        "Accreditation status": null,
        "Program name": "Minor in English Creative Writing",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The English Minor is a program of 18 units of English courses beyond the General Education requirements. The Minor is intended for students in other majors who wish to develop their skills in literary analysis, critical writing, and creative expression. The Minor in English is highly flexible, allowing students to choose six courses from the full range of English offerings. Students can satisfy personal interests while developing knowledge and skills in literary studies, rhetoric and composition, creative writing, or TESOL. A total of nine upper-division units is required.",
        "program website url": "https://www.csulb.edu/program/english-minor",
        "Accreditation status": null,
        "Program name": "Minor in English Literature",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Rhetoric and Composition minor provides students with the opportunity to take advanced coursework in rhetoric, composition, and writing instruction. Students learn to analyze texts and arguments; identify rhetorical strategies; and write effectively in a variety of rhetorical situations and genres. In addition, students interested in careers in writing and publishing, or in becoming high school English teachers, have an opportunity to gain experience in teaching writing, tutoring, and/or working in a university writing center. The minor complements a wide variety of majors.",
        "program website url": "https://www.csulb.edu/program/english-rhetoric-and-composition-minor",
        "Accreditation status": null,
        "Program name": "Minor in English Rhetoric & Composition",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in English Special Emphasis",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/atlas/minor-checklists"
    },
    {
        "Concentration name": null,
        "description": "Environmental Science and Policy (ESP) is an interdisciplinary field that addresses the complex interactions between human societies and the natural environment. The ESP minor will prepare students to understand the scientific basis of environmental problems, as well as the social, economic, and political aspects of environmental issues and policy solutions. The minor provides students with a foundational understanding of environmental science, environmental policy, and research methods in ESP. Students will gain critical thinking skills, problem-solving abilities, and an appreciation for diverse perspectives on environmental issues. This minor complements a wide range of majors, providing valuable knowledge and skills for careers in environmental consulting, natural resource management, policy analysis, advocacy, and education.",
        "program website url": "https://cla.csulb.edu/programs/es-p/minor-in-esp/",
        "Accreditation status": null,
        "Program name": "Minor in Environmental Science & Policy",
        "Program Page url": "https://cla.csulb.edu/programs/es-p/minor-in-esp/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in European Studies offers an interdisciplinary approach to the study of Europe. By emphasizing the study of European languages, literatures, cultures, history, politics, economics, and geography, the Minor provides students with a broad exposure to European civilization and its global impact. It offers a variety of courses and topics that reflect the broad interests and expertise of CSULB faculty. Students will acquire valuable analytical and research skills and develop an in-depth understanding of Europe.",
        "program website url": "https://www.csulb.edu/program/european-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in European Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Event Planning and Management will provide students with the interdisciplinary knowledge and skills needed to design, plan, implement, and evaluate events in a range of industries. The minor is offered to provide an academic credential in event planning and management that will enhance the marketability of graduates, and provide continuing education to individuals currently working in the field of event planning and management. Students will learn the various aspects of the planning and implementation process of different events, including but not limited to, sports, recreation, tourism, entertainment, and social. Students will gain knowledge in event leadership, marketing, sponsorship, risk management, financial practices, and customer service. Additionally, students will engage in an experiential learning opportunity in event planning, implementation, and evaluation.",
        "program website url": "https://www.csulb.edu/program/event-planning-and-management-minor",
        "Accreditation status": null,
        "Program name": "Minor in Event Planning and Management",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.csulb.edu/academic-affairs/course-catalog/family-consumer-sciences-minors#minor-in-fashion-design",
        "Accreditation status": null,
        "Program name": "Minor in Family and Consumer Sciences, Fashion Design",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Fashion Merchandising Minor provides students with an understanding of the product development, production, distribution, and marketing of fashion goods. The minor provides students with professional skills and knowledge required for positions in the fashion industry and prepares them for graduate studies.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/family-consumer-sciences/programs/fashion-merchandising-minor-course-requirements-0",
        "Accreditation status": null,
        "Program name": "Minor in Family and Consumer Sciences, Fashion Merchandising",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": "Textiles",
        "description": "The Textiles Minor offers an interdisciplinary approach to the study of textile materials and their application to apparel, home furnishings, and related industries. The curriculum provides students with a strong foundation in textile science, including fiber properties, yarn and fabric construction, textile finishes, and coloration. Students also gain an understanding of textile economics, sustainability, and global sourcing. The minor prepares students for careers in textile product development, quality control, merchandising, and entrepreneurship.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/minors/minor-family-and-consumer-sciences-textiles",
        "Accreditation status": null,
        "Program name": "Minor in Family and Consumer Sciences, Textiles",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/degrees-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Food Science is a multidisciplinary program designed to enhance the knowledge and skills of students who are interested in the application of science and engineering principles to the study of food. It covers a broad range of topics including food chemistry, microbiology, processing, safety, and nutrition. This minor is suitable for students in various majors such as Biology, Chemistry, Engineering, Health Science, and other related fields who wish to gain expertise in the food industry. Graduates with a Minor in Food Science will be well-prepared for entry-level positions in food research and development, quality assurance, regulatory affairs, and food production, or for further graduate studies in food science or related areas.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/food-science",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Food Science",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/food-science"
    },
    {
        "Concentration name": null,
        "description": "The undergraduate Minor in Forensic Studies is housed in the College of Liberal Arts and administered through the Department of Criminal Justice. The minor is designed to provide students with an interdisciplinary understanding of forensic evidence in a variety of contexts, including criminal investigations, medical-legal contexts, and civil disputes. The minor allows students to apply forensic knowledge to a wide range of academic fields, including the natural sciences, social sciences, and humanities. The minor is an ideal complement to a variety of majors, including criminal justice, psychology, biology, chemistry, anthropology, and sociology. The minor requires 18 units of coursework, including 6 units of core courses and 12 units of electives. Students must complete a minimum of 9 units in residence at CSULB. All courses counting toward the minor must be completed with a grade of \"C\" or better.",
        "program website url": "https://www.csulb.edu/program-academic-plan/forensic-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in Forensic Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The French & Francophone Studies program offers both a B.A. and a Minor in French & Francophone Studies. Our curriculum is designed to provide students with a solid foundation in French language proficiency and a comprehensive understanding of French and Francophone cultures, literatures, and societies. Through a diverse range of courses, students develop critical thinking skills, cultural competence, and effective communication abilities. Our program emphasizes interdisciplinary approaches, encouraging students to explore the intersections of language, history, politics, and the arts. Additionally, we offer opportunities for study abroad, internships, and engagement with the vibrant French-speaking communities both locally and internationally.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/romance-german-russian-languages-and-literatures/french-and-francophone",
        "Accreditation status": null,
        "Program name": "Minor in French & Francophone Studies",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/romance-german-russian-languages-and-literatures/french-and-francophone"
    },
    {
        "Concentration name": null,
        "description": "The Geographic Information Science (GIScience) Minor provides students with knowledge and skills in geospatial technologies. These technologies are used to collect, manage, analyze, and visualize data that is referenced to locations on Earth's surface. GIScience is highly interdisciplinary and provides skills that are applicable to a wide range of academic disciplines and career fields including anthropology, biology, criminal justice, environmental science, geology, health sciences, public administration, and urban studies. The minor also prepares students for the GIS Professional (GISP) certification. Students will be able to apply spatial reasoning and use GIS software for data acquisition, management, analysis, and visualization of spatial data.",
        "program website url": "https://www.csulb.edu/academic-catalog/2023-2024/minors/geographic-information-science",
        "Accreditation status": null,
        "Program name": "Minor in Geographic Information Science",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "A Minor in Geography will complement many majors including those in the natural sciences, social sciences, and humanities, as well as business and engineering. The Minor in Geography will allow you to learn more about geographic concepts, data collection and analysis, and interpretation of geographic information, as well as gaining skills relevant to careers in many fields.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/geography/minors",
        "Accreditation status": null,
        "Program name": "Minor in Geography",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/geography/minors"
    },
    {
        "Concentration name": null,
        "description": "A minor in German provides students with a foundational understanding of the German language and culture. Through a combination of language courses, literature, and cultural studies, students will develop proficiency in German communication skills while gaining insights into the diverse cultures of German-speaking countries. This minor complements various majors, offering valuable cross-cultural perspectives and enhancing career opportunities in fields such as international relations, business, education, and the arts. Students pursuing a minor in German will acquire: Proficiency in German language skills (reading, writing, listening, speaking). Knowledge of German literature, history, and cultural traditions. Intercultural competence and critical thinking skills. An appreciation for the diversity of German-speaking cultures.",
        "program website url": "https://www.csulb.edu/major-program/german-minor",
        "Accreditation status": null,
        "Program name": "Minor in German",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Gerontology Minor offers an interdisciplinary approach to the study of aging. The program is designed to provide students with a broad understanding of the social, psychological, and biological aspects of aging, as well as the societal implications of an aging population. Students will gain knowledge and skills relevant to working with older adults in various capacities, including healthcare, social services, policy, and research. The minor is suitable for students from a wide range of majors who are interested in enhancing their understanding of aging and preparing for careers that involve older adult populations. Our curriculum emphasizes critical thinking, ethical considerations, and culturally sensitive practices in gerontology.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/social-work/gerontology-minor",
        "Accreditation status": null,
        "Program name": "Minor in Gerontology",
        "Program Page url": "https://www.hhs.k-state.edu/human-sciences/academics/minors/gerontology/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Global Migration Studies provides students with an interdisciplinary understanding of the causes, dynamics, and consequences of human migration in an increasingly globalized world. Through an interdisciplinary curriculum drawing on the social sciences and humanities, students will develop critical thinking skills and a nuanced perspective on migration issues, preparing them for careers in fields such as social justice, human rights, policy analysis, and international development.",
        "program website url": "https://www.csulb.edu/international/program/global-migration-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in Global Migration Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Global Middle Eastern Studies (GMES) Minor is an interdisciplinary program designed to give students a multi-faceted understanding of the Middle East and its relationship to global issues and processes. Our goal is to provide students with the necessary knowledge and analytical tools to understand the complexity and diversity of the region and its people. This minor provides a foundational understanding of the history, politics, cultures, and languages of the Middle East from an interdisciplinary perspective. This minor is open to all majors and will be especially useful for students interested in careers in international relations, journalism, diplomacy, and the non-profit sector. It will also prepare students for graduate work in Middle Eastern Studies and related fields. The minor combines coursework in Middle Eastern Languages (Arabic and/or Persian), History, Political Science, Religious Studies, Geography, and International Studies.",
        "program website url": "https://www.csulb.edu/program/global-middle-eastern-studies-minor",
        "Accreditation status": "Western Association of Schools and Colleges (WASC) Senior College and University Commission (WSCUC)",
        "Program name": "Minor in Global Middle Eastern Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Ancient Greek is a classical language that is part of the Indo-European family. Knowledge of Ancient Greek is vital for understanding the origins and meanings of many English words as well as the history of Western philosophy, literature, and culture. The Greek minor at CSULB introduces students to the Greek language and texts and provides the skills for further study of Ancient Greece. The program consists of three levels of Ancient Greek language courses (GREE 101, 102, and 201), two courses in Greek literature in translation (CLSC 315 and 316), and one elective course chosen from Greek-related courses in Classics or other departments. Students who complete the minor will gain proficiency in reading Ancient Greek and an appreciation for the enduring legacy of Ancient Greek civilization.",
        "program website url": "https://www.csulb.edu/international/program/greek-minor",
        "Accreditation status": null,
        "Program name": "Minor in Greek",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Health Humanities Minor provides students with the critical skills needed to understand the complexity of health, illness, healthcare, and medicine by drawing on resources from the humanities (including philosophy, ethics, literature, history, religious studies, and art history) and the arts (visual arts, performance arts, and creative writing). The minor will prepare students for a range of health-related careers and fields, including medical school, nursing, pharmacy, public health, social work, and many other allied health professions. It will also prepare students for graduate work in the health humanities, medical ethics, public health, and related fields. In addition, it provides a strong foundation for a variety of other careers, including law, education, business, journalism, government, and policy.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/health-humanities-minor",
        "Accreditation status": null,
        "Program name": "Minor in Health Humanities",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The minor in Health Science provides students with the opportunity to gain expertise in the field of Health Science and complements a variety of majors. Students completing the minor will learn about population health, health disparities, health promotion, disease prevention, and public health policies and issues.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/health-science/minor-in-health-science",
        "Accreditation status": null,
        "Program name": "Minor in Health Science",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-HIST%20UM%2024-25.pdf",
        "Accreditation status": null,
        "Program name": "Minor in History",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-HIST%20UM%2024-25.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Human Development minor is a multidisciplinary program that allows students to study the physical, social, emotional, and cognitive development of individuals from conception through old age within diverse contexts. It is ideal for students who wish to augment their major with knowledge of individual and family development. The minor provides a strong foundation for a variety of careers in fields such as social work, education, counseling, health care, and other human services. Students interested in the minor should consult with a Human Development advisor.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/department-of-human-development/human-development-minor",
        "Accreditation status": null,
        "Program name": "Minor in Human Development",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The International Economics Minor is designed to give students a systematic exposure to the subject area of international economics. The minor consists of 21 units (7 courses) and covers areas such as international trade, international finance, economic development, and international economic policy issues. The minor requires a minimum of 9 units of upper division economics courses.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/economics/international-economics-minor",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in International Economics",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/atlas/minor-checklists"
    },
    {
        "Concentration name": null,
        "description": "The International Studies Minor is an interdisciplinary program designed to give students a deeper understanding of issues that transcend national boundaries, such as economics, politics, environment, and culture. The minor examines global interdependence and processes of change, focusing on the historical and contemporary relationships between developed and developing countries. Through an interdisciplinary approach, students will gain a critical perspective on the forces shaping the global community.",
        "program website url": "https://www.csulb.edu/academic-affairs/international-studies/international-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in International Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Italian is an 18-unit program that provides students with the linguistic and cultural skills necessary to be successful in an increasingly global world. Students will engage with historical, literary, and contemporary texts, honing their analytical, written, and oral communication skills in Italian. Students will learn about Italian culture and society in a global context through a variety of course offerings covering literature, cinema, and cultural production. This minor can be paired with any major and is valuable for students interested in a wide range of careers.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/european-studies/italian",
        "Accreditation status": null,
        "Program name": "Minor in Italian",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/atlas"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Japanese Language and Culture offers students an exciting opportunity to complement their major studies with a focused introduction to the Japanese language and its rich culture. The program is designed to provide students with foundational proficiency in the Japanese language, enabling them to communicate effectively in various everyday contexts. Beyond language acquisition, the minor delves into the diverse aspects of Japanese culture, including its history, literature, arts, and societal structures, fostering a comprehensive understanding of Japan's unique heritage. Through a blend of language courses and cultural studies, students will develop critical thinking skills and cross-cultural competencies essential for engaging with a globalized world. Whether students are interested in international business, education, tourism, or simply wish to broaden their cultural horizons, the Minor in Japanese Language and Culture equips them with valuable insights and practical skills to navigate and appreciate Japanese society and its global impact.",
        "program website url": "https://cla.csulb.edu/departments/aaas/certificate-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Japanese Language and Culture",
        "Program Page url": "https://cla.csulb.edu/departments/aaas/certificate-minor/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS_JST-UM_25-26.pdf",
        "Accreditation status": null,
        "Program name": "Minor in Jewish Studies",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS_JST-UM_25-26.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Journalism",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS_JOUR-UM_25-26.pdf"
    },
    {
        "Concentration name": null,
        "description": "The minor in Korean Language and Culture provides students with a solid foundation in the Korean language and culture. Through a combination of rigorous language training and in-depth cultural studies, students develop proficiency in all aspects of the Korean language (listening, speaking, reading, and writing), as well as a comprehensive understanding of Korean society, history, literature, and contemporary culture. The program aims to foster intercultural competence and prepare students for various career paths that require expertise in Korean language and culture, such as international relations, business, education, and translation.",
        "program website url": "https://www.csulb.edu/international/future-students/minor-korean-language-and-culture",
        "Accreditation status": null,
        "Program name": "Minor in Korean Language and Culture",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Latin American Studies (LAS) program at California State University, Long Beach offers an interdisciplinary Minor for undergraduate students across the university. The program introduces students to the culture, history, and political economy of Latin America and the Caribbean from a variety of disciplinary perspectives. As an interdisciplinary program, LAS offers a wide range of courses and topics, including Latin American film, indigenous cultures, gender, immigration, human rights, environmental issues, history of conquest and resistance, US-Latin American relations, and contemporary politics. Students in the program develop a global understanding of social justice, cultural diversity, and human interactions by exploring the region through a variety of disciplinary lenses, including Anthropology, Art History, Chicano & Latino Studies, Communication Studies, Comparative World Literature, Economics, Geography, History, Journalism, Political Science, Portuguese, Religious Studies, and Spanish.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/latin-american-studies/about-latin-american-studies",
        "Accreditation status": null,
        "Program name": "Minor in Latin American Studies",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/latin-american-studies/about-latin-american-studies"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Latin",
        "Program Page url": "https://classics.dartmouth.edu/undergraduate/majors-and-minors"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/linguistics/minor-linguistics",
        "Accreditation status": null,
        "Program name": "Minor in Linguistics",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Linguistics TESOL (Teaching English to Speakers of Other Languages) provides students with knowledge and skills for teaching English as a second or foreign language. The program gives students a solid foundation in descriptive linguistics (phonetics, phonology, morphology, syntax, and semantics) and sociolinguistics. The program also provides knowledge and practical training in ESL methodologies, curriculum development, and language assessment. The minor is a practical program for students considering teaching English abroad or pursuing graduate studies in TESOL. Students interested in the minor should consult an advisor in the Department of Linguistics to discuss courses and career options. A cumulative GPA of 2.0 is required in all courses applicable to the minor.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/linguistics-department/minors",
        "Accreditation status": null,
        "Program name": "Minor in Linguistics TESOL",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/linguistics-department/minors"
    },
    {
        "Concentration name": null,
        "description": "The Center for Medieval and Renaissance Studies (CMARS) offers an interdisciplinary minor in Medieval and Renaissance Studies. This minor allows students to explore the history, literatures, arts, religions, and cultures of Europe and the Mediterranean from the late Roman Empire (ca. 300 CE) to the mid-seventeenth century. It offers an opportunity for students in a wide variety of majors, including Art, Comparative World Literature, English, History, Philosophy, and Religious Studies, to study the premodern past in depth. The interdisciplinary nature of the minor also enables students to investigate the historical, literary, and cultural developments of the premodern world from multiple perspectives. Students who complete the minor will have an excellent foundation for graduate study in any of the participating disciplines. The Minor requires completion of 18 units of coursework drawn from an approved list of courses in the Departments of Art, Comparative World Literature, English, History, Philosophy, and Religious Studies. To see the specific requirements for the Minor in Medieval and Renaissance Studies, please see the Academic Catalog.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/center-for-medieval-and-renaissance-studies",
        "Accreditation status": null,
        "Program name": "Minor in Medieval & Renaissance Studies",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/center-for-medieval-and-renaissance-studies"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Native American Cultures focuses on the study of Native American experiences, histories, cultures, and contemporary issues. It is an interdisciplinary minor designed for students interested in a broad understanding of the Indigenous peoples of the Americas. Students will explore diverse perspectives, critical methodologies, and the impact of colonialism, sovereignty, and self-determination movements. The curriculum emphasizes the rich cultural heritage, resilience, and ongoing contributions of Native American communities. Through a combination of coursework from various departments, students will develop a nuanced understanding of Native American cultures and their significance in global contexts, preparing them for careers in education, public service, non-profit organizations, and further academic study.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/department-of-american-indian-studies/minor-native-american-cultures",
        "Accreditation status": null,
        "Program name": "Minor in Native American Cultures",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-Native%20American%20Cultures%20UM%2024-25.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Philosophy Department offers a Minor in Philosophy. The minor offers students in other majors the opportunity to explore the philosophical foundations of their own major and to acquire competence in philosophical analysis, critical thinking, ethical reasoning, and historical, social, and political thought. The minor also helps students prepare for graduate or professional studies in fields such as law, government, journalism, business, education, and public policy. The minor is flexible, allowing students to tailor it to suit their own interests. It also has specific requirements to assure that students acquire a good foundation in Philosophy, including a course in Logic, and at least two courses at the 300- or 400-level. For more details on the Minor in Philosophy, please see the University Catalog.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/philosophy/minor-philosophy",
        "Accreditation status": null,
        "Program name": "Minor in Philosophy",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Political Science",
        "Program Page url": "https://cla.csulb.edu/departments/polisci/wp-content/uploads/2020/07/POSC-Minor-requirements-worksheet-2019.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Psychology minor is designed for students who want to augment their major with knowledge about human behavior. The minor will allow students to apply psychological principles to their major field of study, and to provide skills in critical thinking, research, and communication.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/department-of-psychology/psychology-minor",
        "Accreditation status": null,
        "Program name": "Minor in Psychology",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Public Administration is designed to give students in other majors an opportunity to acquire a basic understanding of public sector organizations and their management, to prepare them for entry level positions in government and non-profit organizations, or to enhance their career prospects if they choose to pursue a graduate degree in public administration. The minor offers students an introduction to the theoretical and practical dimensions of public administration through required coursework, and allows them to gain additional understanding of the field through a variety of elective choices.",
        "program website url": "https://www.csulb.edu/international/minor-in-public-administration",
        "Accreditation status": null,
        "Program name": "Minor in Public Administration",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The minor in Public Policy Interdisciplinary focuses on policy analysis and the political processes and institutions that shape public policy. Students will learn how public policy is made, the factors that shape policy decisions, and how to analyze the consequences of policy choices. The minor will help prepare students for careers in government, non-profit organizations, and private sector roles involving policy analysis, advocacy, and public affairs. It will also provide a strong foundation for graduate studies in public policy, public administration, law, or related fields.",
        "program website url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-POSC%20INTERDISC%20PUB%20POLICY%20UM%2024-25.pdf",
        "Accreditation status": null,
        "Program name": "Minor in Public Policy Interdisciplinary",
        "Program Page url": "https://www.csulb.edu/sites/default/files/2025/documents/ATLAS-POSC%20INTERDISC%20PUB%20POLICY%20UM%2024-25.pdf"
    },
    {
        "Concentration name": null,
        "description": "A minor in Public Relations provides students with an understanding of the theory and principles of public relations, along with training in strategic communication, writing, and message development, research and evaluation, and crisis communication. The Public Relations minor can be a useful complement to a variety of majors including Business, Journalism, Psychology, Communication Studies, Political Science, and others.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/journalism-public-relations/public-relations-minor",
        "Accreditation status": null,
        "Program name": "Minor in Public Relations",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Queer Studies Minor is an interdisciplinary program designed to introduce students to the field of Queer Studies, including LGBTQ history, activism, politics, and culture. Courses in the minor focus on understanding the social construction of sexuality, gender, race, class, and nation; the dynamics of power and privilege; the history of social movements; cultural representation; and the history and current status of LGBTQ individuals, communities, and activism in a global context. The minor provides students with critical thinking, research, and communication skills applicable to a wide range of professions in fields such as social work, public health, law, teaching, counseling, journalism, and public policy, as well as to graduate study in the humanities and social sciences.",
        "program website url": "https://cla.csulb.edu/departments/ws/undergraduate-program/queerstudies/",
        "Accreditation status": null,
        "Program name": "Minor in Queer Studies",
        "Program Page url": "https://www.glendale.edu/students/student-services/multicultural-community-engagement-center-mcec/pride-center/choosing-an-lgbtq-friendly-campus/queer-studies"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.csulb.edu/academic-program/recreation-minor",
        "Accreditation status": null,
        "Program name": "Minor in Recreation",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "A Minor in Religious Studies allows students from any major to supplement their education with the study of the history, beliefs, and practices of world religions. The minor consists of 18 units of coursework chosen in consultation with a Religious Studies advisor.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/religious-studies",
        "Accreditation status": null,
        "Program name": "Minor in Religious Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Department of Romance, German, Russian Languages and Literatures offers a minor in Russian. Students who minor in Russian find that their knowledge of the language and culture helps them advance professionally in fields such as international business, law, journalism, and government service. The Russian minor gives students the opportunity to learn one of the world's most significant languages and to understand the unique culture of Russia and Eurasia through their literature, culture, and history. Upon completion of the Minor in Russian, students will be able to: Demonstrate communicative proficiency in Russian at the advanced-mid level according to the ACTFL Guidelines; Demonstrate understanding of the literatures and cultures of the Russian-speaking world and develop an awareness of their diversity; Analyze and interpret original works from diverse literary and cultural traditions of the Russian-speaking world using critical concepts and methods appropriate to the discipline.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/romance-german-russian-languages-and-literatures/russian-and-eurasian",
        "Accreditation status": null,
        "Program name": "Minor in Russian",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/romance-german-russian-languages-and-literatures/russian-and-eurasian"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in Sociology",
        "Program Page url": "https://openstax.org/books/introduction-sociology-3e/pages/1-1-what-is-sociology"
    },
    {
        "Concentration name": null,
        "description": "The South Asian Studies minor at CSULB offers students an interdisciplinary program of study in the cultures, histories, languages, politics, and social dynamics of the South Asian region. Students take courses in a variety of departments, including Asian American Studies, Comparative World Literature, English, History, Religious Studies, and Women's, Gender, and Sexuality Studies. Students may also study South Asian languages through independent study and study abroad opportunities. The minor is flexible, allowing students to tailor the program to their specific interests.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/south-asian-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in South Asian Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Teaching English to Speakers of Other Languages (TESOL) is designed to provide undergraduate students with a strong theoretical and practical foundation in the field of TESOL. This minor prepares students to teach English in various international and domestic settings, including private language schools, community programs, and overseas institutions. Students will gain expertise in language acquisition theories, pedagogical methods, curriculum development, assessment techniques, and cultural understanding pertinent to teaching English as a second or foreign language. The program emphasizes hands-on experience through practicum opportunities, allowing students to apply their knowledge in real-world teaching environments. Graduates will be equipped with the skills and knowledge necessary to effectively support English language learners of diverse backgrounds and proficiency levels.",
        "program website url": "https://www.csulb.edu/international/program/teaching-english-speakers-other-languages-tesol-minor",
        "Accreditation status": null,
        "Program name": "Minor in Teaching English to Speakers of Other Languages (TESOL)",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "Translation Studies is a growing interdisciplinary field that investigates the theoretical and practical aspects of translation and interpreting. The Minor in Translation Studies at CSULB offers students an introduction to the principles, methods, and technologies of translation. Students will develop skills in translating between English and a language of choice, and acquire knowledge of the cultural, social, and ethical dimensions of translation. The minor is designed to complement any major, providing a valuable skill set for diverse career paths in a globalized world. It also serves as a strong foundation for graduate studies in translation or related fields.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/translation-studies",
        "Accreditation status": null,
        "Program name": "Minor in Translation Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Women's, Gender, & Sexuality Studies (WGSS) offers students from various majors across the campus the opportunity to gain a critical understanding of the social and cultural construction of gender and sexuality. The WGSS Minor provides students with valuable tools to understand inequalities across different contexts, including race, class, gender, sexuality, nationality, and ability. Our students develop intersectional and transnational perspectives on diverse social issues. These skills are highly valued in a broad range of careers in both the public and private sectors, including law, journalism, public policy, education, health, and social work. Additionally, the WGSS Minor prepares students for graduate study in Gender Studies and related fields.",
        "program website url": "https://www.csulb.edu/college-liberal-arts/womens-gender-sexuality-studies/minor-womens-gender-sexuality-studies",
        "Accreditation status": null,
        "Program name": "Minor in Women's, Gender, & Sexuality Studies",
        "Program Page url": "https://www.csulb.edu/international/future-students/explore-undergraduate-programs"
    }
]