[
    {
        "Concentration name": null,
        "description": "The Associate of Arts in interdisciplinary studies is designed for students who desire a two-year degree in liberal arts and sciences. The degree focuses on development of critical thinking, problem-solving, communication, and technological competencies. It is an ideal starting point for students who wish to pursue a bachelor’s degree but are undecided about a specific major. The AA in interdisciplinary studies also serves the needs of students who seek to complete a short-term degree for personal and professional enhancement. The AA in interdisciplinary studies is not designed for transfer into a specific NKU bachelor’s degree program that requires a specialized associate’s degree for transfer purposes.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Interdisciplinary Studies, A.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The 3D Digital Design and Visual Effects program offers a Bachelor of Arts degree for students interested in working in fields such as character design, environment modeling, motion graphics, video game design, film and video production, advertising, simulation, and forensic science. The program offers training in the latest digital tools used in a wide variety of industries that create visual effects, animation, and interactive media. Students gain knowledge in areas such as 3D modeling, texturing, rigging, animation, lighting, rendering, game design, and motion graphics. The curriculum focuses on developing the student's creative and technical abilities to succeed in a diverse and rapidly changing industry.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "3D Digital Design and Visual Effects, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Accounting is the process of identifying, measuring, and communicating economic information to permit informed judgments and decisions by users of the information. Accountants provide financial data and analyses for management decisions, prepare federal, state, and local tax returns, perform audits of financial records, and design and maintain financial information systems. Accountants are concerned with past, present, and future events and their impact on organizations. The accounting curriculum is designed to prepare students for successful careers in all areas of accounting, including public, private, governmental, and not-for-profit organizations. Students gain knowledge in various areas of accounting, including financial, managerial, taxation, auditing, and accounting information systems. Throughout the curriculum, students develop critical thinking, communication, and technical skills necessary for the accounting profession. Opportunities for accounting graduates continue to be excellent, with strong demand in all employment sectors. All graduates are eligible to sit for the CPA exam, the CMA exam, and other professional examinations.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "B.S.B.A.",
        "Program name": "Accounting, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Anthropology is a comparative and holistic discipline that explores the human condition across time and space. Through its four subfields, sociocultural anthropology, archaeology, biological anthropology, and linguistic anthropology, the discipline asks fundamental questions about what it means to be human in all of our diversity and complexity. Students majoring in anthropology at NKU acquire practical skills in research, critical thinking, analysis, and cross-cultural communication in the service of justice, equality, and mutual understanding. These skills are highly valued by employers in business, education, government, and non-profit sectors. Many of our majors go on to graduate school and professional careers in a wide variety of fields.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Anthropology, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in applied software engineering program prepares students for positions as software developers, software engineers, and software architects. This degree provides students with a solid foundation in the principles, practices, and technologies of software engineering. Graduates are prepared for careers in a broad range of industries including healthcare, finance, manufacturing, and entertainment. Students will gain experience with modern software development techniques, including agile methods, object-oriented design, web application development, mobile application development, and cloud computing. The program emphasizes hands-on experience through project-based learning and internships. The curriculum includes a strong emphasis on problem-solving, critical thinking, and communication skills, which are essential for success in the software engineering field.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Applied Software Engineering, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts degree with a major in Art and Design is a liberal arts program designed to introduce students to a broad range of knowledge, skills, and approaches in the visual arts. The program encourages students to investigate various media, techniques, and critical theories and apply them to their own creative work. Students have the opportunity to specialize in Graphic Design, Photography, or Studio Art. The B.A. program allows for flexibility to pursue a minor or a second major. Many students take advantage of this flexibility by choosing a minor or second major in disciplines such as marketing, journalism, psychology, computer science, or education. Art and Design B.A. graduates are prepared for a variety of careers in the creative industries or for further study in graduate school.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Art and Design, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Art and Design program is a comprehensive educational experience that prepares students for careers in the visual arts and design fields. The program emphasizes critical thinking, problem-solving, and creative expression through a wide range of courses in studio art, art history, and graphic design. Students gain hands-on experience in various mediums and techniques, develop a strong portfolio, and cultivate a deep understanding of art and design principles. Graduates are equipped with the skills and knowledge necessary to pursue successful careers as artists, designers, educators, or to continue their education at the graduate level.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Art and Design, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": "General Biology Track",
        "description": "The Biological Sciences program provides students with a broad and solid foundation in the concepts of biology as well as training in the use of contemporary methods, analyses, and communication skills. It offers students the opportunity to prepare for a range of professional careers, including entry-level laboratory or field positions, high school teaching, or for further graduate or professional training.\n\nProgram Objectives:\nUpon completion of the BA in Biological Sciences, students will be able to:\n1. Describe fundamental concepts in biology.\n2. Formulate testable hypotheses and design experiments.\n3. Apply quantitative reasoning and computational tools to analyze biological data.\n4. Access and evaluate scientific literature.\n5. Communicate scientific information effectively.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Biological Sciences, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": "Standard Option, Pre-Veterinary Option, Pre-Medical Sciences Option, Pre-Dentistry Option, Pre-Optometry Option, Pre-Physical Therapy Option, Pre-Physician Assistant Option, Forensic Science Option, Biotechnology Option, Environmental Science Option",
        "description": "The biological sciences curriculum at Northern Kentucky University is designed to provide students with a broad background in biological concepts while providing flexibility to customize their educational experience. Opportunities include undergraduate research, internships, field experiences, and study abroad. Biology provides an excellent foundation for a variety of careers including health care, environmental biology, biotechnology, forensic science, and graduate school. The B.S. in biological sciences also provides an excellent foundation for professional schools (medicine, dentistry, optometry, physical therapy, physician assistant, veterinary, etc.). Students can choose from a variety of options within the degree (listed below) to help guide their course selection for specific career paths. The Forensic Science and Biotechnology options are structured slightly differently and have additional specific requirements. Students should consult with an advisor to determine which option is best suited for their academic and career goals. The Department of Biological Sciences is housed in the state-of-the-art Health Innovation Center. Our classrooms and laboratories feature modern instrumentation, technology, and animal/plant collections. Faculty are active researchers who provide students with numerous opportunities for participation in meaningful research.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Biological Sciences, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Business Information Systems (BIS) program provides students with the business and technical skills needed to successfully manage and apply information technology to solve business problems and create new business opportunities. BIS graduates work as business analysts, data analysts, database administrators, cybersecurity analysts, network administrators, IT project managers, and systems analysts in a variety of industries. Demand for BIS graduates continues to be strong and growing. A career in BIS combines a solid foundation in business, analytics, and computing along with problem-solving and communication skills to serve the information technology needs of businesses and other organizations. The BIS program is offered through the Department of Business Informatics. The Department of Business Informatics is one of seven academic departments in the Haile College of Business.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The Haile College of Business is accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Program name": "Business Information Systems, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in chemistry is an excellent choice for students interested in a career in a chemistry-related field but who also desire a broad liberal arts education that prepares them for a variety of careers. The B.A. degree also prepares students for further study in professional programs such as medical, dental, pharmacy, veterinary and law schools. Students earning a B.A. in chemistry will develop problem-solving skills, critical thinking skills, and will learn to communicate scientific information verbally and in writing. Students will complete foundational courses in chemistry, biology, math, and physics. The B.A. degree provides students with maximum flexibility to explore other fields through a required minor or second major or by pursuing an interdisciplinary focus. The curriculum for the B.A. in chemistry is certified by the American Chemical Society, which allows graduates to be employed in a variety of scientific fields after graduation.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The curriculum for the B.A. in chemistry is certified by the American Chemical Society.",
        "Program name": "Chemistry, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science degree in chemistry is designed to provide comprehensive training in the major areas of chemistry, including analytical, inorganic, organic, and physical chemistry, along with biochemistry. This curriculum is structured to prepare students for a variety of career paths including graduate study in chemistry or related fields, industrial employment, or professional schools. Graduates of this program will have a strong foundation in chemical principles, laboratory techniques, and problem-solving skills, enabling them to contribute to scientific advancements and address real-world challenges. The program aims to develop critical thinking, analytical reasoning, and effective communication skills essential for success in scientific and technical professions.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Chemistry, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Communication Studies major prepares students to be successful communicators, critical thinkers, and ethical leaders in a diverse and complex world. Graduates will develop skills in written, oral, and mediated communication, critical analysis, ethical decision-making, and teamwork. The program offers opportunities for students to apply their learning in various contexts, including internships, research projects, and community engagement. With a focus on both theoretical foundations and practical applications, the Communication Studies major provides a versatile education that can lead to careers in a wide range of fields, such as public relations, marketing, human resources, journalism, education, law, and non-profit management. Additionally, the program provides excellent preparation for graduate studies in communication or related disciplines.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Communication Studies, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Computer Science (CS) bachelor of science program prepares students for positions as computer professionals in industry, business, and government, and for graduate study in computer science. The curriculum emphasizes principles and theory, software design and development, computer organization and architecture, and problem solving. Students are exposed to a variety of programming languages, operating systems, and computing environments. Graduates are qualified for positions such as software engineers, software developers, systems analysts, database administrators, web developers, network administrators, and cybersecurity professionals. Typical industries include software development, financial services, healthcare, manufacturing, defense, and consulting. NKU Computer Science students regularly earn competitive internships and full-time positions with regional and national companies like Cincinnati Children’s Hospital, Fidelity Investments, GE Aviation, Great American Insurance, Huntington Bank, JPMorgan Chase, LexisNexis, L3Harris Technologies, Medpace, Micron Technology, Northern Kentucky University, Procter & Gamble, Schneider Electric, US Bank, Wayfair, and Western & Southern Financial Group.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Computer Science, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The B.S. in Construction Management prepares students for managerial roles in the construction industry. The curriculum focuses on both the technical and managerial aspects of construction with a strong emphasis on management principles. Graduates of the program are well-prepared for entry-level managerial positions as project engineers, project managers, project superintendents, estimators, cost engineers, schedulers, and field engineers. The program is specifically designed to provide students with a broad and comprehensive background in construction, business management, and general education. Students gain the practical and theoretical skills needed to succeed in a demanding, technologically advanced, and ever-changing industry. The curriculum combines business acumen with hands-on, construction-specific skills. Required coursework includes construction methods and materials, construction drawings, estimating, scheduling, project management, contracts, safety, and business principles.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "B.S.",
        "Program name": "Construction Management, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Criminal Justice is a liberal arts-based degree program that prepares students for employment in a variety of criminal justice occupations. Students receive a broad-based education covering subjects such as the nature and causes of crime, criminal law and procedure, policing, corrections, juvenile justice, victimology, and homeland security. The program is designed to develop students’ critical thinking, analytical, and communication skills while also fostering an appreciation for diversity and social justice. Graduates are prepared for careers at the local, state, and federal levels, as well as for graduate study in criminal justice, law, public administration, and related fields.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Criminal Justice, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Cybersecurity, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Data analytics and statistics is the science of turning raw data into insight and knowledge. The Data Analytics & Statistics, B.S. prepares students to apply cutting-edge methods for analyzing complex data and communicating results to stakeholders. Students are trained in statistical modeling, machine learning, data visualization, and the fundamental computational methods needed to manage and analyze data. The program provides a balance of theoretical and applied approaches, ensuring students have both the foundational understanding and practical skills to succeed in diverse data-driven fields. Our graduates are equipped for careers in data science, business intelligence, data engineering, and related areas across various industries.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Data Analytics & Statistics, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Data Science B.S. program is an interdisciplinary program designed to meet the growing need for a new type of professional who can apply statistical thinking, computational modeling, data management skills, and scientific methods to extract knowledge and insights from large complex data sets. The demand for graduates with these skills is growing in nearly all sectors of the economy, including industries ranging from manufacturing to business, finance, and health care. With a Bachelor of Science degree in Data Science, graduates will have the necessary skillset to analyze complex data sets, interpret results, and communicate findings to a variety of audiences. The degree provides students with a foundational understanding of mathematics, statistics, and computer science and prepares them for further graduate study in Data Science or related fields or for employment as a data scientist, business intelligence analyst, quantitative analyst, or data analyst.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Data Science, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Early Childhood Education (Birth-Kindergarten) Program leads to a Bachelor of Arts degree and Kentucky teacher certification for teaching children from birth through kindergarten. This program is for students who want to develop the knowledge, skills, and dispositions to work with young children, birth through kindergarten, in a variety of settings, and who want to teach in public or private schools. Students in this program will learn how to: create responsive learning environments, implement developmentally appropriate curriculum, develop effective teaching strategies for diverse learners, observe and assess children’s learning, work collaboratively with families and professionals, and use current research to inform their teaching practices.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Early Childhood Education (Birth-Kindergarten), B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (B.S.) in economics prepares students to critically analyze economic behavior and issues. The economics curriculum provides students with a strong foundation in economic theory, quantitative methods, and analytical skills. Students learn to apply economic principles to real-world problems, evaluate policy decisions, and understand market dynamics. The program emphasizes critical thinking, problem-solving, and effective communication, preparing graduates for a variety of careers in business, finance, government, and non-profit organizations, as well as for further graduate study in economics, business, law, and public policy. Students also develop a sophisticated understanding of how economic systems function, both domestically and internationally, fostering a global perspective.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Economics, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "This major encourages students to analyze the history, philosophy, sociology, and politics of education both in the U.S. and internationally. It is designed to expose students to various educational theories and policies and to help them understand the role of education in shaping individuals and societies. The program prepares students for a range of careers in educational research, policy analysis, advocacy, and non-profit organizations focused on educational issues. It also serves as excellent preparation for graduate studies in education, law, public policy, and related fields. In addition, the major fulfills the requirements for admission to NKU’s Master of Arts in Teaching (MAT) program or other alternative certification programs for students interested in teaching in Kentucky.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Education, Culture and Society, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Electrical and Electronic Engineering Technology (BS EEET) program will provide students with the knowledge and skills necessary to pursue careers in areas such as control systems, industrial automation, robotics, communication systems, power electronics, and embedded systems. The EEET curriculum combines the theory of electrical and electronic circuits with hands-on application and experience in the laboratory. The program focuses on the application of electrical engineering principles to solve technical problems, as well as the design, implementation, and improvement of electrical and electronic systems.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The Electrical and Electronic Engineering Technology, B.S. program is accredited by the Engineering Technology Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Electrical and Electronic Engineering Technology, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Electronic Media & Broadcasting, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Elementary Education (P-5) program leads to an initial teaching certificate for grades P-5 in Kentucky. The program provides candidates with a thorough understanding of child development and learning, curriculum design, assessment, and effective instructional strategies. Candidates will gain practical experience through field experiences and student teaching in diverse elementary school settings, preparing them to create engaging and supportive learning environments for young children.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The teacher education programs at Northern Kentucky University are accredited by the Council for the Accreditation of Educator Preparation (CAEP) and approved by the Kentucky Education Professional Standards Board (EPSB).",
        "Program name": "Elementary Education (P-5), B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Engineering Physics is an interdisciplinary major designed to provide students with a strong foundation in both physics and engineering principles. The program aims to prepare graduates for a wide range of careers in industry, government, and research, as well as for further study in graduate programs in engineering or physics. Students will develop problem-solving skills, critical thinking, and a deep understanding of scientific principles and their applications to real-world problems. The curriculum emphasizes hands-on experience through laboratory work and design projects, fostering an innovative and practical approach to learning.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Engineering Physics, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": "Creative Writing",
        "description": "The English major is designed to promote students' critical reading and analytical writing abilities and to cultivate an appreciation for the historical and cultural contexts in which literature and other texts are produced, distributed, and received. Students apply critical theories to their study of literature and language, and they engage with the work of literary critics. They learn about literary genres, rhetorical approaches to reading and writing, and the conventions of literary study. The English major helps students develop skills of critical thinking, close reading, and effective writing that are valuable in a wide range of professions as well as in further academic study. Students choose among four options within the English major: Creative Writing, English, English Teaching, and Literary and Cultural Studies.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "English, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Environmental Science program provides an interdisciplinary education to prepare students for careers or graduate study in environmental science. The B.A. program is for students who want a broad background in environmental science that includes the social sciences and humanities. This program leads to careers in environmental planning, policy, law, communication, and education. It can also be excellent preparation for law school or graduate studies in environmental policy, law, or related areas. This program requires 30 credit hours in environmental science courses and an additional 30-31 credit hours in chemistry, biology, geology, physics, and mathematics. Students are also encouraged to participate in internships. An internship is required for students who do not plan to complete a minor or another major.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Environmental Science, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Environmental Science major is an interdisciplinary program designed to give students a broad scientific background with a focus on understanding environmental issues. Students complete coursework in biology, chemistry, geology, and physics, as well as mathematics and statistics. The major provides the scientific background for students interested in a variety of environmental careers or for students who plan to pursue graduate studies in environmental science.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Environmental Science, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Exercise Science prepares students for careers in clinical, commercial, community, and corporate health and fitness settings, and for graduate study in exercise science, physical therapy, occupational therapy, physician assistant, medicine, chiropractic, and other allied health professions. Through a blend of foundational science courses and advanced exercise science courses, students will develop competencies in anatomy, physiology, biomechanics, exercise physiology, nutrition, motor control, behavior change, exercise programming, health assessment, and research. This degree offers a strong scientific base in human health and performance. The Bachelor of Science in Exercise Science has extensive opportunities for hands-on experience through laboratory work, internships, and research projects. In addition, students have the opportunity to earn national certifications through the American College of Sports Medicine (ACSM), the National Strength and Conditioning Association (NSCA), or other professional organizations. The Bachelor of Science in Exercise Science is ideal for students who want to improve the health and well-being of others and want to contribute to the growing demand for healthcare professionals.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "B.S.",
        "Program name": "Exercise Science, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The B.S.B.A. in finance prepares students for a wide range of career opportunities in corporate finance, financial institutions (commercial banking, investment banking, and insurance), and investments (investment analysis and portfolio management). The finance major is designed to provide students with a strong theoretical and practical background in all areas of finance. Students are exposed to both the theory and application of financial decision-making with a focus on problem-solving, analytical skills, and communication. The faculty are committed to providing a high-quality learning experience using current real-world applications and relevant research in finance. Students have opportunities to participate in professional organizations and internships.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "B.S.B.A.",
        "Program name": "Finance, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The French major at NKU offers students the opportunity to learn the language and cultures of the Francophone world. Students are prepared to become global citizens and to enter a variety of professions at home or abroad including international business, government service, translation, communication, foreign language teaching, and graduate study. French majors will achieve proficiency in the four language skills (reading, writing, listening, speaking), develop a strong understanding of literary and cultural movements of the French-speaking world, develop an awareness of linguistic diversity within the French-speaking world, and demonstrate an understanding of French language structure at an advanced level. A minor in French is also available.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "B.A.",
        "Program name": "French, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Business Administration in General Business prepares students for careers in organizations ranging from entrepreneurial ventures to major corporations. The General Business program provides students with broad exposure to business disciplines, including accounting, economics, finance, management and marketing, while allowing students to choose a minor from anywhere on campus. This allows students to acquire a broad foundation of business knowledge while developing specific interests in their chosen minor. In addition, students will learn to apply quantitative and qualitative skills to make sound business decisions, communicate effectively orally and in writing, identify and analyze ethical issues in business, and understand and appreciate the global context of business.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "General Business, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Geology B.A. program provides an overview of the earth sciences that includes a background in basic concepts of geology. Graduates are prepared for careers that require general knowledge of the natural sciences. Example careers include science writing, environmental law, natural resource management, and science education. The B.A. also provides an excellent background for graduate studies in environmental science, oceanography, or other fields related to the earth sciences. In addition, the B.A. curriculum meets the Kentucky State Science Certification requirements for secondary education teachers.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Geology, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Geology is the scientific study of the Earth, its materials, and the processes that affect them. Geologists investigate a wide range of topics, including earthquakes, volcanoes, floods, landslides, climate change, groundwater, mineral and energy resources, and Earth's history. Geology is an inherently interdisciplinary field that relies on principles from physics, chemistry, biology, mathematics, and computer science.\n\nThe Bachelor of Science degree in geology is a rigorous program that provides students with a strong foundation in geological principles and processes, as well as the quantitative and analytical skills necessary for a successful career in the geosciences or for graduate studies. The curriculum includes coursework in physical geology, historical geology, mineralogy, petrology, structural geology, sedimentology and stratigraphy, hydrogeology, geomorphology, and environmental geology. Students also gain hands-on experience through laboratory work, field trips, and opportunities for undergraduate research.\n\nGeologists apply their knowledge to address critical societal challenges, such as locating and managing natural resources, assessing and mitigating geological hazards, and understanding and responding to environmental change. A bachelor's degree in geology serves as a gateway to diverse career paths in environmental consulting, energy exploration, geotechnical engineering, government agencies (e.g., U.S. Geological Survey, state geological surveys), and academia.\n\nGraduates of the geology B.S. program are well-prepared for entry-level positions in the geosciences or for advanced study in master's or Ph.D. programs. The program emphasizes critical thinking, problem-solving, and communication skills, which are essential for success in any scientific field.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Geology, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The German Program emphasizes an intensive and interdisciplinary approach to the study of German language, literature, and culture. The program provides the linguistic proficiency and cultural literacy required to engage critically with the societies of the German-speaking world. The B.A. in German can lead to a career in diverse fields, including foreign service, international business, journalism, teaching, publishing, and translation, among others. Students will also be well-prepared to pursue graduate study in German or a related field. Students completing a B.A. in German often combine it with a major or minor in another field.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "German, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The B.S.B.A. in Global Supply Chain Management program prepares students for professional careers in operations and supply chain management. Graduates are prepared to work with global suppliers, manufacturers, service providers, distributors, retailers, and customers. Students learn how to analyze, design, and manage supply chain processes and systems to efficiently and effectively deliver products and services to customers. The curriculum focuses on business analytics, purchasing and sourcing, logistics and transportation, inventory management, production planning, supply chain technologies, and quality management. Students are also exposed to various lean and six sigma methodologies. This degree provides students with the academic foundation to pursue professional certifications such as the APICS Certified in Production and Inventory Management (CPIM) and Certified Supply Chain Professional (CSCP). Graduates of the program are employed in a wide range of industries including manufacturing, service, healthcare, and retail.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Global Supply Chain Management, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in health communication offers students the opportunity to combine their interests in communication and health. Through an interdisciplinary curriculum grounded in communication, health, and social science, students learn about communication practices that promote health and wellness at the individual, organizational, and societal levels. The program also prepares students for graduate study in communication, public health, and other health-related fields.\n\nHealth Communication Mission\nThe mission of the Health Communication program is to prepare students to create, analyze, and disseminate health messages for diverse audiences; to critically evaluate health information; to facilitate effective communication between patients and providers; to advocate for health equity; and to engage in ethical health communication practices.\n\nLearning Outcomes\nUpon completion of the Health Communication program, students will be able to:\n1. Apply communication theories and principles to health contexts.\n2. Analyze the role of communication in health promotion and disease prevention.\n3. Critically evaluate health information and messages.\n4. Develop effective health communication strategies for diverse audiences.\n5. Demonstrate ethical communication practices in health contexts.\n6. Engage in interprofessional collaboration to address health challenges.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Health Communication, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science degree in Health Informatics prepares students for entry-level professional positions in health information technology and health information management. This degree incorporates curriculum that meets the Commission on Accreditation for Health Informatics and Information Management Education (CAHIIM) accreditation requirements, and upon successful completion, students are eligible to sit for the Registered Health Information Administrator (RHIA) examination. The curriculum provides students with a strong foundation in a healthcare clinical experience/internship, medical terminology, coding and reimbursement methodologies, health care data management, data analysis, strategic management, legal and ethical issues, and research methods. The curriculum includes the option for a Health Informatics certificate that students can earn as part of their degree. Students completing the Health Informatics, B.S. degree will be prepared for a career in health data analytics, data governance, project management, information technology, information systems, privacy and security, and mobile health in a wide variety of healthcare settings.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "This degree incorporates curriculum that meets the Commission on Accreditation for Health Informatics and Information Management Education (CAHIIM) accreditation requirements.",
        "Program name": "Health Informatics, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Health Science degree prepares students for advanced study in a variety of health professions including occupational therapy, physical therapy, physician assistant, chiropractic, optometry, and dentistry. In addition to preparing students for graduate study, the Health Science curriculum includes courses in human anatomy and physiology, chemistry, physics, and medical terminology. Students gain exposure to health-related career opportunities, develop skills in health education, and participate in experiential learning. The Health Science program curriculum provides flexibility through elective options allowing students to individualize their program of study by selecting courses that meet their interests and professional goals. This program also serves as an excellent foundation for individuals interested in careers related to research and development in the health-related industries.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Health Science, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The B.A. in History enables students to understand the nature of the human past, appreciate the forces that have shaped the contemporary world, and develop analytical and communication skills applicable to a wide variety of careers. History majors acquire a broad knowledge of world history while also developing specialized knowledge in particular fields and historical methodologies. Students gain critical thinking, research, and communication skills valuable in the workplace and in graduate and professional schools. With this degree, students are prepared to enter professions in education, law, journalism, government, foreign service, public history, archives, libraries, museums, business, and non-profit organizations, among others. The B.A. in History also provides excellent preparation for further study in graduate school.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "History, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Human Resource Management program provides students with the fundamental knowledge and skills needed to enter a career in human resources. The program exposes students to the functional areas of human resources and explores the important strategic role human resources plays in modern organizations. Students completing the degree will be prepared for a variety of entry-level human resource positions, including human resource generalist, recruiter, benefits specialist, compensation analyst, and training specialist. Additionally, the program offers students preparation for the Society for Human Resource Management (SHRM) Certified Professional (SHRM-CP) exam.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The College of Business is accredited by AACSB International.",
        "Program name": "Human Resource Management, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Human Services and Addictions program prepares students for positions in the rapidly expanding fields of human services and addictions. The program includes the option of two tracks: the Addictions track and the Human Services track. These tracks provide the education and field experiences needed to prepare for a variety of human services positions in settings such as mental health centers, substance use disorder treatment agencies, correctional facilities, residential facilities, and community-based social service agencies. Students graduating from this program will be eligible for various state certifications and licensure within Kentucky and other states. Students can also elect to double major in Human Services and Addictions and a related field, such as social work, psychology, or criminal justice, to expand their career options. Most Human Services and Addictions courses are offered online in a 7-week format, providing flexibility and convenience for students.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Human Services and Addictions, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Information Technology program (IT) is designed for students who want to apply the concepts and techniques of information technology to support people, organizations, and systems. IT graduates are skilled in the selection, application, integration, and administration of computing technologies. The IT program places significant emphasis on preparing students to solve business problems and apply computing technologies in real-world contexts. Students gain knowledge in various areas of IT including programming, networking, operating systems, databases, web development, information security, data management and analytics. Through hands-on experience and project-based learning, students develop the skills necessary to design, implement, and manage secure and scalable IT solutions. Graduates are prepared for careers such as network administrators, system administrators, database administrators, web developers, cybersecurity analysts, data analysts, software developers, and IT consultants.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Information Technology, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Business Administration with a major in Innovation and Entrepreneurship provides students with an understanding of innovation and entrepreneurial processes that lead to new ventures in startups, small businesses, corporate environments, and social impact organizations. The program focuses on developing entrepreneurial competencies and mindsets related to identifying opportunities, marshaling resources, and creating value. Students will learn the process of new venture creation, including identifying and evaluating opportunities, developing business plans, marketing new products and services, and managing finances. The program also covers the topics of creativity, design thinking, innovation management, and social entrepreneurship. Graduates will be prepared for a variety of roles in startup companies, small and medium-sized enterprises, larger corporations, and non-profit organizations where an entrepreneurial mindset is valued.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Innovation and Entrepreneurship, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Interdisciplinary Studies is designed for students whose educational and career objectives cannot be adequately met by a single disciplinary major. Students design a major that is individually tailored to their specific interests and professional aspirations. The Interdisciplinary Studies curriculum allows students to integrate courses from different disciplines into a cohesive program of study. The curriculum requires a minimum of 30 hours of coursework drawn from two or more academic disciplines. The program may also include internship and independent study experiences. Students work with a faculty advisor to develop a program of study, which must be approved by the program director. Graduates of the program are well prepared for careers in business, government, social services, and education, as well as for further graduate study.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Interdisciplinary Studies, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The International Business major provides students with the business knowledge and skills necessary for successful participation in the global economy. This includes coursework in global economics, international finance, international marketing, international business operations, and international management, as well as foreign language and culture. Graduates are prepared for a variety of entry-level management positions in global firms, governmental agencies, and non-profit organizations or for continued study in graduate school.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "International Business, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": "Diplomacy and International Affairs Track, Global Economics and Development Track, Global Culture and Society Track, Regional Studies Track",
        "description": "The International Studies major is an interdisciplinary program designed to provide students with the knowledge and skills necessary to understand and engage with global issues. Students develop a broad understanding of the historical, political, economic, social, and cultural forces that shape the contemporary world. The curriculum emphasizes critical thinking, research, and communication skills, preparing students for a variety of careers in international affairs, government, non-profit organizations, and business, or for further graduate study. The program offers opportunities for study abroad and internships to enhance global competencies.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "International Studies, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Japanese provides students with advanced proficiency in the Japanese language, a thorough understanding of Japanese culture and society, and the ability to think critically about intercultural communication. Students are prepared to use their Japanese language and cultural skills in a variety of settings from government and business to education and non-profit organizations. Students develop sophisticated intercultural communication skills through the study of the language and culture of Japan, which prepares them to function effectively in a globalized world.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Japanese, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Journalism, B.A. program at Northern Kentucky University offers students the opportunity to develop essential skills for a dynamic career in journalism and related fields. The curriculum emphasizes critical thinking, ethical decision-making, clear communication, and multimedia storytelling. Students learn to research, report, write, edit, and produce content for various platforms, including print, broadcast, and digital media. Through hands-on experiences, internships, and engagement with professional journalists, students gain practical knowledge and build a strong portfolio. The program prepares graduates for roles such as reporters, editors, broadcast journalists, digital content creators, public relations specialists, and communication professionals in a rapidly evolving media landscape.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Journalism, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Northern Kentucky University's Law B.A. is an innovative major designed for students considering careers in law or law-related fields and for those interested in developing their understanding of law and its role in society. The curriculum introduces students to a variety of areas of law, including private law, public law, and international law. Students learn about the fundamental principles underlying legal systems and develop critical thinking, analytical, and communication skills essential for success in law school and a wide range of professions. The Law B.A. major provides a robust foundation for pursuing a Juris Doctor (J.D.) degree and prepares students for careers in fields such as government, public policy, advocacy, compliance, human resources, and business. The program also supports the university's mission to be a student-ready, region-ready institution, by ensuring that Law B.A. students are well-prepared for successful careers and to meet the needs of the Northern Kentucky and Greater Cincinnati regions.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Law, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Management is a challenging and rewarding field that encompasses a broad range of career opportunities. Graduates often find careers in manufacturing, service, healthcare, and nonprofit organizations. The Management program at NKU is designed to prepare students for successful careers as managers in both domestic and international settings. Management professionals plan, organize, lead, and control the operations of an organization in order to achieve the organization's goals. The Management program is designed to provide students with the business and technical skills necessary to meet the demanding and diverse requirements of this challenging profession. The program is flexible, allowing students to tailor their courses to fit their individual interests and career goals through a selection of approved electives. For those interested in additional specializations, the Department of Management offers an Entrepreneurship, B.S.B.A., Human Resource Management, B.S.B.A., and Operations and Supply Chain Management, B.S.B.A. programs.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "Accredited by AACSB International since 1995.",
        "Program name": "Management, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Students pursuing the marketing major will gain knowledge and skills in marketing strategy, consumer behavior, market research, sales, advertising, promotion, and digital marketing. Marketing majors are prepared for careers in marketing management, advertising, sales management, retailing, product management, marketing research, and professional selling.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Marketing, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science degree in mathematics provides students with a strong background in mathematics and prepares them for a variety of careers or for graduate study. This program focuses on theoretical mathematics and offers great flexibility for students to tailor their programs to meet their individual interests and career goals. Each student must complete a capstone experience. Students are encouraged to consult with the department chair or their advisor for specifics.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Mathematics, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Mechanical and manufacturing engineering technology professionals use a broad range of engineering and manufacturing sciences and mathematics combined with practical, hands-on application to solve technical problems in industry. Mechanical and manufacturing engineering technology is a practice-oriented engineering discipline built upon a background of mathematics, physics, and chemistry. Students learn and apply core principles related to mechanical design, fluid power, dynamics, manufacturing processes, quality, measurement systems, automation, and computer-aided applications. The program applies fundamental scientific and engineering principles to the design, manufacturing, testing, and evaluation of components, products, and systems with an emphasis on product design, cost reduction, quality improvement, and overall systems productivity. The curriculum includes problem-solving and critical-thinking skills along with hands-on learning through capstone design projects, laboratories, and internships. Graduates work in a variety of industries including aerospace, automotive, energy, medical, manufacturing, and consumer product design. Career opportunities include project engineer, quality engineer, manufacturing engineer, design engineer, process engineer, and applications engineer.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The Bachelor of Science in Mechanical and Manufacturing Engineering Technology program is accredited by the Engineering Technology Accreditation Commission of ABET, https://www.abet.org.",
        "Level": "B.S.",
        "Program name": "Mechanical and Manufacturing Engineering Technology, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Mechatronics engineering technology is an interdisciplinary field that combines mechanical engineering, electrical engineering, computer science, and control engineering. This program provides students with the knowledge and skills necessary to design, develop, implement, and maintain mechatronics systems found in modern manufacturing and automation industries. The curriculum focuses on hands-on experience and practical applications, preparing graduates for a wide range of careers in various sectors, including robotics, automotive, aerospace, and advanced manufacturing. Students will gain proficiency in areas such as industrial automation, robotics, programmable logic controllers (PLCs), sensor and actuator systems, control systems, and computer-aided design/manufacturing (CAD/CAM). The program emphasizes problem-solving, critical thinking, and teamwork, ensuring graduates are well-equipped to meet the evolving demands of the mechatronics industry.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Mechatronics Engineering Technology, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Middle Grades Education (5-9) program prepares teacher candidates to seek initial certification to teach grades 5-9 in two content areas. Students must choose two teaching fields from language arts, mathematics, science, social studies, and agricultural education. The program provides teacher candidates with a broad understanding of children, effective pedagogical skills, and content knowledge in two teaching fields necessary for middle grades education. This program requires demonstration of content knowledge in two teaching fields, a methods course in each teaching field, professional education coursework, and a clinical experience culminating in student teaching. The Kentucky Education Professional Standards Board determines certification requirements. Kentucky certification requires passage of the PRAXIS II content exams and the Principles of Learning and Teaching (PLT) 5-9 exam. Students should be aware of admission requirements to Teacher Education, requirements for continuation and retention in Teacher Education, and specific program completion requirements.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Middle Grades Education (5-9), B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Music degree is designed for students who desire a broad liberal arts education with an emphasis on music. This program combines academic study in music history, theory, and performance with a wide range of general education courses, providing a versatile foundation for various career paths or further graduate study. Students develop critical thinking, creative expression, and analytical skills through rigorous coursework and practical experience. This degree offers flexibility for students interested in combining music with other disciplines or pursuing careers in fields such as arts administration, music therapy (with further study), or music journalism. It also serves as excellent preparation for graduate studies in musicology, ethnomusicology, music theory, or related fields.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Music, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Neuroscience is the study of the nervous system, which governs behavior, emotion, sensation, movement, and cognition. Neuroscience is a highly interdisciplinary field involving research that ranges from the molecular to the cellular, systems, and behavioral levels. The Neuroscience B.S. program will train students in the core principles of neuroscience and provide a comprehensive understanding of how the nervous system works at these different levels. Our graduates will acquire a strong foundation in biological, chemical, and physical sciences, as well as mathematics. They will develop critical thinking, communication, and quantitative skills, and gain extensive experience with scientific methods, experimental design, data analysis, and interpretation, preparing them for graduate studies, professional schools, or careers in academia, industry, or healthcare.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Neuroscience, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "This degree program is designed for students who desire a bachelor's degree that can be customized to their interests and career goals. Students completing this degree will develop knowledge and skills in organizational theory, leadership, project management, ethics, problem-solving, and communication. This program is available entirely online or in a hybrid format.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Organizational Leadership, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Philosophy helps you develop your ability to think critically, analyze arguments, articulate your thoughts clearly, and evaluate complex issues. The undergraduate curriculum develops students’ analytical abilities while introducing them to the history of philosophy and providing them with an understanding of many of the central problems of philosophy. Courses are offered in logic, ethics, ancient, modern, and contemporary philosophy, social and political philosophy, aesthetics, and the philosophy of law and science. This training is useful for a wide range of careers and for further study in law, business, education, medicine, the ministry, or other graduate programs.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Philosophy, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Physical Education and Health P-12 program focuses on developing the knowledge, skills, and dispositions necessary to be an effective physical education and health teacher in grades P-12. The program includes general education courses, professional education courses, and major field courses. The program is committed to developing teachers who can teach effectively and enthusiastically in diverse school settings.\n\nStudents who complete this program will be eligible for P-12 Physical Education and Health teaching certification in Kentucky.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "B.A.",
        "Program name": "Physical Education and Health (Leading to P-12 Teaching Certification), B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": "Non-Certification Track",
        "description": "The Physical Education and Health (Non-Certification Track), B.A., prepares students to work in a variety of non-school settings. The program will enable graduates to pursue careers in fitness, health and wellness, recreation, sports performance and nutrition. Potential employment opportunities include corporate wellness programs, fitness facilities, non-profit organizations, and community recreation centers. Graduates also have the option to pursue graduate degrees in related fields.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Physical Education and Health (Non-Certification Track), B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Physics Program provides students with a strong background in physics while allowing considerable flexibility to pursue interests in other areas of science, mathematics, computer science or pre-professional programs. The program is specifically designed to accommodate double majors or those interested in teaching physics at the high school level. The B.A. program requires 30 semester credit hours in physics courses. Students will take core courses in mechanics, electromagnetism, modern physics, and quantum mechanics, as well as a senior research capstone course. Additional course work in physics is selected from a list of electives chosen in consultation with an advisor.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Physics, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Physics is the study of matter and energy and their interactions, covering the full range of natural phenomena from subatomic particles to the entire cosmos. A bachelor of science in physics provides a broad education with training in critical thinking, problem-solving, and experimental methods. In addition to a strong foundation in core physics, the curriculum offers flexibility to pursue individual interests. Graduates with a degree in physics are well prepared for employment in a wide variety of science- and engineering-related fields, graduate study in physics or other fields such as engineering, medical physics, or computer science, or professional programs such as medicine, law, or business.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Physics, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Political Science is the study of how power is gained, exercised and constrained. It involves the systematic analysis of political thought, political behavior, and political institutions, both within and across countries. Political science is an excellent liberal arts major that provides students with a broad and deep understanding of the world, develops critical thinking, research, and communication skills, and prepares students for a wide variety of career options. Through their courses, students gain insight into American politics, comparative politics, international relations, and political theory. Students learn how governments, businesses, and non-governmental organizations operate, and how individuals and groups influence politics. Graduates with a B.A. in Political Science are well prepared for careers in federal, state, and local governments, international organizations, law, journalism, teaching, public service, business, and political campaign management. It offers excellent preparation for civic engagement, careers in a wide range of fields (including government, law, business, and journalism), and is excellent preparation for continued study in graduate or law school.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Political Science, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Psychological Science is a general degree in psychology designed to provide students with a broad understanding of the scientific study of mind and behavior. The curriculum exposes students to a wide range of content areas in psychology, including cognitive, developmental, social, abnormal, and biological psychology, as well as research methods and statistics. The program emphasizes critical thinking, scientific literacy, and effective communication skills, preparing students for a variety of career paths or further graduate study in psychology or related fields. Graduates will be equipped to apply psychological principles to real-world problems and to contribute to a deeper understanding of human behavior.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Psychological Science, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Psychological Science provides students with a strong scientific foundation for understanding behavior and mental processes. Students learn to apply the scientific method to psychological phenomena, critically evaluate information, and communicate findings effectively. The program emphasizes empirical research skills, quantitative literacy, and ethical considerations in psychological science. This degree prepares students for graduate study in psychology or related fields, as well as for careers in diverse areas requiring strong analytical, research, and communication skills. Students pursuing the B.S. in Psychological Science must complete requirements for the major, the general education requirements (or a block transfer of approved general education courses), and sufficient electives to meet the university minimum of 120 credit hours. Students are encouraged to consult with their academic advisor to ensure proper course sequencing and timely degree completion.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Psychological Science, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Public relations is an exciting field involving strategic communication between an organization and its publics. Public relations professionals work with internal and external publics through a wide variety of tools and strategies to cultivate positive relationships, build understanding, manage reputation, and protect against crises. Public relations majors prepare for careers by learning to apply cutting-edge communication theory and research methods to real-world communication challenges. Through hands-on experiences, students learn to design and implement effective public relations campaigns, master communication technologies, and produce professional communication materials. Public relations students also learn about crisis communication, fundraising, media relations, social media, and internal communication, as well as the ethical and legal issues in public relations practice. Students are encouraged to complete at least one internship during their program.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Public Relations, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Radiation Therapy program, leading to a Bachelor of Science degree, is designed to prepare students for a career in radiation therapy. Radiation therapists are highly skilled health care professionals who work in hospitals and cancer centers to deliver radiation treatments to patients. These treatments are prescribed by a radiation oncologist as part of a patient's overall cancer treatment plan. Radiation therapists have the responsibility of maintaining accurate treatment records, performing quality assurance procedures on the treatment machines, and providing patient care and patient education related to their treatment. Critical thinking and problem-solving skills are essential in this profession.\nThe Radiation Therapy program at NKU is an intensive 2+2 program; meaning, students complete two years of general education and pre-requisite courses, followed by two years in the professional radiation therapy curriculum. The professional radiation therapy curriculum includes didactic coursework, lab experience, and clinical education at area hospitals and cancer centers.\nThe program is a limited enrollment program. Students must apply for admission to the professional curriculum. Students are admitted to the professional curriculum in the fall semester of their junior year.\nUpon completion of the program, graduates are eligible to take the American Registry of Radiologic Technologists (ARRT) certification examination in Radiation Therapy.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The Radiation Therapy program is accredited by the Joint Review Committee on Education in Radiologic Technology (JRCERT), 20 N. Wacker Drive, Suite 2850, Chicago, IL 60606-3182, (312) 704-5300, mail@jrcert.org, www.jrcert.org.",
        "Program name": "Radiation Therapy, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Radiologic Science program is a full-time, limited enrollment program. The program is structured as a 2+2 program, meaning students will complete the first two years of general education and prerequisite coursework prior to applying to the professional portion of the program. Upon acceptance to the professional portion of the program, students will complete four consecutive semesters (fall, spring, summer, fall) of professional coursework including didactic and clinical education at affiliated clinical sites. The Radiologic Science program is a highly selective program and has specific admission requirements that must be met prior to submitting an application. Graduates are eligible to take the American Registry of Radiologic Technologists (ARRT) national certification examination in radiography. A felony conviction or misdemeanor involving moral turpitude may affect a graduate's ability to take the ARRT certification examination and obtain state licensure. The program provides the education and clinical experience required for entry-level positions in radiography and prepares graduates for continuing education at the graduate level.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The Radiologic Science program is accredited by the Joint Review Committee on Education in Radiologic Technology (JRCERT), 20 N. Wacker Drive, Suite 2850, Chicago, IL 60606-3182, 312-704-5300, mail@jrcert.org, www.jrcert.org.",
        "Level": "B.S.",
        "Program name": "Radiologic Science, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The baccalaureate degree completion program in Respiratory Care at Northern Kentucky University is designed to promote career mobility for practicing respiratory therapists. The online curriculum focuses on advanced knowledge and skills necessary to function in various roles including leadership, management, education, research, and advanced clinical practice. This program is designed for registered respiratory therapists who have completed the credentialing examination for Registered Respiratory Therapist (RRT) offered by the National Board for Respiratory Care (NBRC).",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The baccalaureate degree completion program in Respiratory Care at Northern Kentucky University is accredited by the Commission on Accreditation for Respiratory Care (CoARC), www.coarc.com.",
        "Program name": "Respiratory Care, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Respiratory Care Completion Program is an online program designed to advance the education and professional opportunities for individuals who are currently practicing as a Registered Respiratory Therapist (RRT) and are credentialed by the National Board for Respiratory Care (NBRC). The program provides students with knowledge and skills to enhance the delivery of respiratory care services, assume leadership roles, and engage in advanced practice to improve respiratory health outcomes. Students will develop skills in critical thinking, leadership, education, research, and evidence-based practice applicable to a variety of healthcare settings.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": "The Respiratory Care Program is accredited by the Commission on Accreditation for Respiratory Care (CoARC) 2640 Timbers Drive, Irving, TX 75061, (817) 283-2835. CoARC accreditation ID #200406. For more information regarding CoARC, visit their website at www.coarc.com.",
        "Level": "B.S.",
        "Program name": "Respiratory Care Completion Program, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": "Sales",
        "description": "The Sales program offers students comprehensive knowledge of the sales process. Students develop skills in personal selling, sales management, and sales analytics. This program prepares students for a variety of entry-level sales positions across industries, as well as for further career advancement to sales management and leadership roles.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Sales, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Secondary Education major provides coursework and clinical experiences leading to initial certification for teaching grades 8-12 or P-12 in a selected academic content area. In addition to completing the secondary education major and the general education requirements, candidates for teacher certification must complete a teaching field for grades 8-12 or P-12 that is approved by the Kentucky Education Professional Standards Board (EPSB) and Northern Kentucky University. Students must maintain a minimum 2.75 GPA in all professional education courses, all teaching field courses, and overall.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Secondary Education (8-12/P-12), B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Sociology is the scientific study of human social behavior and social groups. The Bachelor of Science (B.S.) in sociology is a broad-based liberal arts program emphasizing the systematic study of human society, culture, social interaction, and social institutions. Sociology majors learn to analyze the social forces that shape our lives and social worlds. The program provides students with knowledge and skills for understanding human behavior and social organization. It teaches students to think critically about complex social issues and challenges. The B.S. program provides students with analytical and research skills that are highly valued by employers and graduate programs. It prepares graduates for a broad range of careers in social services, community development, government, research, education, non-profit organizations, and business.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Sociology, B.S.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Department of World Languages and Cultures offers a program leading to the Bachelor of Arts degree with a major in Spanish. The program is designed to develop the linguistic proficiency and cultural knowledge of students interested in the many career paths open to those with significant expertise in Spanish. Students interested in a teaching career must be admitted to the Teacher Education Program. Consult the Teacher Education Program section of this catalog regarding admission requirements and course descriptions. Upon completion of the Spanish B.A. program, students will be able to: Use Spanish to communicate effectively in a variety of contexts. Analyze and interpret Spanish and Spanish American literary and cultural texts. Demonstrate an understanding of the historical, political, social, and cultural contexts of Spanish-speaking communities. Formulate and support arguments in Spanish through written and oral presentations. Engage critically and ethically with diverse perspectives within Spanish-speaking cultures.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Spanish, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Northern Kentucky University's Bachelor of Arts in Special Education program prepares students to become highly effective teachers of students with disabilities in kindergarten through 12th grade. Our program is designed to provide comprehensive training in evidence-based practices, instructional strategies, and assessment techniques tailored to meet the diverse needs of students with mild-to-moderate disabilities. Students will gain a deep understanding of special education law, individualized education programs (IEPs), and collaborative teamwork to create inclusive and supportive learning environments. Upon completion of the program, graduates will be eligible for initial teacher certification in Kentucky in Special Education (P-12).",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Special Education (P-12) B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "The Sports Business and Event Management (SBEM) program prepares students for careers in the growing sports, recreation, and event industries. The program builds on a solid business foundation from the Haile College of Business and provides specific training in areas such as sports marketing, sports law, facility and event management, and sports finance. Graduates of the program will be prepared to work for professional and amateur sports organizations, recreation departments, colleges and universities, and event management firms. The program aims to prepare students with knowledge, skills, and values required for managerial positions in the sports and event industries. The learning process emphasizes critical thinking, problem-solving, and communication skills through the use of case studies, experiential learning, and projects. The program provides multiple opportunities for students to engage in internships, which are an integral part of the curriculum.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Sports Business and Event Management, B.S.B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": "Performance Track, Technical/Design Track, Integrated Track",
        "description": "Theatre at Northern Kentucky University is a comprehensive conservatory-style training program where students learn, grow, and train to be professionals in the art and business of theatre. With a focus on hands-on experience, students hone their skills in a variety of performance, design and technical areas working side-by-side with professional faculty, guest artists and industry leaders from across the region and beyond. Graduates are prepared for careers in the theatre industry or for advanced studies in graduate school. NKU is an institutional member of the National Association of Schools of Theatre.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "Theatre, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": "Visual Communication Design is a dynamic and essential part of every aspect of our lives – from the physical spaces we inhabit, to the information we consume, to the interfaces we interact with. The Visual Communication Design program prepares students to enter this growing profession as creative problem-solvers, effective communicators, and thoughtful practitioners. It offers students opportunities to develop expertise in a variety of design disciplines, including: branding and identity design, editorial design, exhibition and environmental design, information design, interaction design, motion design, packaging design, publication design, typography, and web design. The curriculum emphasizes the processes and principles of design, and the historical, theoretical, and critical discourse of the field. The program is committed to a socially-engaged and equity-centered approach to design education. Students are encouraged to develop their own voice and vision, and to pursue projects that address social, cultural, and environmental issues. The program prepares students for careers in design studios, advertising agencies, publishing houses, non-profit organizations, corporations, and government agencies, as well as for graduate study in design and related fields.",
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Level": "B.A.",
        "Program name": "Visual Communication Design, B.A.",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058",
        "Accreditation status": null,
        "Program name": "(The list of minors was not available in the provided search results and therefore is not included in this output.)*",
        "Program Page url": "https://onlinecatalog.nku.edu/content.php?catoid=27&navoid=4058"
    }
]