[
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Aeronautics (BSA) program is designed for students seeking careers in the aviation and aerospace industries. This program provides a broad understanding of aviation, including its technical, operational, and business aspects. Students will gain knowledge in areas such as aviation safety, air traffic control, aviation management, airport operations, and aircraft systems. The curriculum is tailored to develop critical thinking, problem-solving, and leadership skills essential for success in various aviation professions. Graduates will be prepared for roles in airlines, corporate aviation, government agencies, and other aviation-related organizations.",
        "program website url": "https://erci.edu.sg/programmes/bachelors-degree-programmes/erau-bachelor-of-science-in-aeronautics/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Aeronautics",
        "Program Page url": "https://erci.edu.sg/programmes/bachelors-degree-programmes/erau-bachelor-of-science-in-aeronautics/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Aeronautical Science degree program at Embry-Riddle prepares students for a variety of careers in aviation, including positions as professional pilots, dispatchers, air traffic controllers, and airport managers. Students gain the critical skills and knowledge necessary to succeed in these roles through a comprehensive curriculum that combines academic coursework with hands-on flight training. As an Aeronautical Science student, you will learn the principles of aerodynamics, aviation meteorology, air traffic control, and aviation safety. You will also develop strong leadership, communication, and decision-making skills, which are essential for success in the aviation industry. With access to state-of-the-art flight simulators and a fleet of over 90 aircraft, you will have ample opportunities to gain practical experience and hone your flying skills. The Aeronautical Science degree program at Embry-Riddle is accredited by the Aviation Accreditation Board International (AABI), ensuring that you receive a high-quality education that meets the rigorous standards of the aviation industry.",
        "program website url": "https://erau.edu/degrees/aeronautical-science-bs/",
        "Accreditation status": "Accredited by the Aviation Accreditation Board International (AABI)",
        "Program name": "Bachelor of Science in Aeronautical Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Aeronautics, Astronautics",
        "description": "For over 60 years, Embry-Riddle has been at the forefront of aerospace education, and our Bachelor of Science in Aerospace Engineering (AE) program is the largest in the U.S. As an AE student at Embry-Riddle, you will gain a deep understanding of the concepts behind and operation of aircraft, spacecraft, and propulsion systems. Our curriculum covers a broad range of topics including aerodynamics, propulsion, flight mechanics, structural analysis, and stability and control. The program offers a choice of two concentrations: Aeronautics and Astronautics. Students can choose to pursue a concurrent M.S. in Mechanical Engineering with an Aerospace Concentration or in Aerospace Engineering.",
        "program website url": "https://erau.edu/degrees/aerospace-engineering-bs/",
        "Accreditation status": "The Bachelor of Science in Aerospace Engineering program at the Prescott and Daytona Beach campuses is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Aerospace Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Aerospace Physiology degree at Embry-Riddle's Daytona Beach Campus provides students with the unique opportunity to learn about the effects of the aerospace environment on the human body, and how to counter those effects. This is the only undergraduate program of its kind in the nation. This unique curriculum combines elements of life sciences, applied physiology, exercise science, and human factors. Aerospace Physiology students are prepared to work in a variety of settings where human performance in extreme environments is critical, including aviation, spaceflight, and military operations. Students will gain an understanding of physiological systems, environmental stressors, and human performance in aerospace contexts. The program emphasizes hands-on experience and research opportunities to prepare students for careers in aerospace medicine, human factors, research, and related fields.",
        "program website url": "https://erau.edu/degrees/aerospace-physiology-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Aerospace Physiology",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Air Traffic Control Specialization",
        "description": "The Bachelor of Science in Air Traffic Management program at Embry-Riddle prepares graduates for careers in air traffic control and various aviation management roles. Students will learn the essentials of air traffic control through simulations and real-world scenarios while also studying management principles applicable to the aviation industry.\n\nThrough an extensive curriculum that combines general education, aviation-specific courses, and business fundamentals, students develop a comprehensive understanding of the complex air traffic system. They gain valuable skills in communication, decision-making, and problem-solving, all critical for success in this demanding field.",
        "program website url": "https://erau.edu/degrees/bachelor/air-traffic-management",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Air Traffic Management",
        "Program Page url": "https://erau.edu/degrees/bachelor/air-traffic-management"
    },
    {
        "Concentration name": null,
        "description": "Learn to manage business operations in the aviation industry with a Bachelor of Science in Aviation Business Administration from Embry-Riddle Aeronautical University, offered at St. Petersburg College. This program teaches you to combine your passion for aviation with the business skills needed to manage finances, human resources, marketing, and operations in the aviation world. The Bachelor of Science in Aviation Business Administration program is for students who want to become proficient in aviation-related operations. Students learn to plan, organize, and control the functions of an aviation business. This program includes a blend of aviation and business courses to provide a broad knowledge of the complex challenges within the aviation industry, in addition to developing an understanding of business theories and practices. It provides the skills needed to manage, supervise, and lead in a variety of aviation careers.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Aviation Business Administration",
        "Program Page url": "https://www.spcollege.edu/friends-partners/community-resources/university-partnership-center/aviation-business-administration"
    },
    {
        "Concentration name": "Professional Concentration",
        "description": "The Bachelor of Science in Aviation Maintenance Science degree at Embry-Riddle is ideal for students who wish to combine hands-on aircraft maintenance skills with extensive business, communication, and management coursework. Graduates of this program gain an FAA Airframe & Powerplant (A&P) Certificate, the gold standard in the aviation maintenance industry. They are prepared to enter a rapidly expanding global job market in positions such as airline maintenance manager, flight maintenance operations supervisor, maintenance and repair technician, technical support specialist, and field service engineer, among others.",
        "program website url": "https://erau.edu/degrees/aviation-maintenance-science-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Aviation Maintenance Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Business Administration degree program prepares students with the fundamental business and management skills required to be a leader in a wide variety of industries, including aviation, aerospace, and beyond. This program is offered at our Daytona Beach, Prescott, and Worldwide Campuses. Graduates of the Business Administration program will be qualified to pursue careers in aviation, aerospace, and any other industry that requires business expertise. Students will develop problem-solving, analytical, and critical thinking skills and gain a comprehensive understanding of business management principles. The B.S. in Business Administration curriculum provides a broad base of management fundamentals in areas like accounting, finance, marketing, and operations. Students learn to conduct business research, interpret data, and develop solutions to contemporary business problems. With the business world constantly evolving, students learn to adapt to new and emerging issues through hands-on projects, case studies, and real-world simulations. They also develop leadership, communication, and interpersonal skills essential for success.",
        "program website url": "https://erau.edu/degrees/business-administration-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Business Administration",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Embry-Riddle Bachelor of Science in Business Analytics prepares you for a career in business analytics by providing you with a strong foundation in data analysis techniques, business principles, and critical thinking skills. This program is designed to develop your ability to transform complex data into actionable insights, enabling you to make informed business decisions. Through a blend of theoretical knowledge and practical application, you will learn to harness the power of data to solve real-world business challenges. The curriculum covers areas such as statistical analysis, data mining, predictive modeling, business intelligence, and data visualization. You will gain proficiency in industry-standard tools and software, preparing you for immediate impact in diverse business environments. Graduates of the Bachelor of Science in Business Analytics program will be equipped with the skills to identify trends, create forecasts, optimize operations, and drive strategic initiatives. Whether you aspire to work in finance, marketing, logistics, or any other data-driven industry, this program provides a comprehensive education to excel in the rapidly evolving field of business analytics.",
        "program website url": "https://erci.edu.sg/programmes/bachelors-degree-programmes/erau-bachelor-of-science-in-business-analytics/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Business Analytics",
        "Program Page url": "https://erci.edu.sg/programmes/bachelors-degree-programmes/erau-bachelor-of-science-in-business-analytics/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Computer Engineering degree at Embry-Riddle Aeronautical University provides students with a fundamental understanding of both hardware and software, and how they interact to form complex computer systems. Computer engineers are involved in the design and development of computer hardware and software components, as well as the integration of these components into larger systems. This program emphasizes areas such as digital system design, computer architecture, embedded systems, network design, and the software that drives these systems. Graduates are prepared for careers in industries ranging from aerospace and defense to telecommunications and consumer electronics, with the skills to design, develop, test, and deploy cutting-edge computer-based solutions.",
        "program website url": "https://erau.edu/degrees/computer-engineering-bs",
        "Accreditation status": "Accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Computer Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Cybersecurity, Data Science, Game Development, Software Engineering, Computational Science",
        "description": "A Bachelor of Science in Computer Science from Embry-Riddle Aeronautical University prepares graduates for a wide range of computer-related occupations in nearly every industry. Students learn to design and develop software, computer systems, and computational solutions, while also gaining experience with problem-solving, analytical thinking, and effective communication skills.\n\nThe Computer Science bachelor's degree at Embry-Riddle is designed for students who want to develop strong analytical and problem-solving skills to meet the computing needs of various organizations. The curriculum focuses on the theory and application of computing principles, enabling graduates to adapt to new technologies and challenges throughout their careers.\n\nThis program offers exposure to:\n*   Object-oriented programming\n*   Data structures\n*   Algorithms\n*   Software engineering\n*   Operating systems\n*   Computer architecture\n*   Database systems\n*   Computer networks\n*   Cybersecurity\n*   Artificial intelligence\n\nThe Computer Science program has five specializations that allow students to focus on an area of interest: Cybersecurity, Data Science, Game Development, Software Engineering, and Computational Science. Graduates of the program are equipped for careers in software development, cybersecurity, data analysis, game development, and other high-demand technology fields.\n\nEmbry-Riddle Computer Science graduates are prepared to enter graduate programs in computer science or related fields, or join the workforce with a strong foundation in computing.",
        "program website url": "https://erau.edu/degrees/bachelor/computer-science",
        "Accreditation status": "Accredited by the Computing Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Computer Science",
        "Program Page url": "https://erau.edu/degrees/bachelor/computer-science"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Cyber Intelligence and Security",
        "Program Page url": "https://che.sc.gov/sites/che/files/Documents/Meetings/2024/ACAP/March%2028/4.G.CCU%20New%20Program%20BA%20Cyber%20TI_ACAP.pdf"
    },
    {
        "Concentration name": null,
        "description": "Data science is a multidisciplinary field that combines statistical analysis, computer science, and domain expertise to extract insights and knowledge from data. Data science is rapidly transforming industries, businesses, and research, driving innovation and decision-making in a data-driven world. The Bachelor of Science in Data Science degree at Embry-Riddle provides students with the fundamental knowledge and skills needed to succeed in this exciting field. This program offers a comprehensive curriculum focusing on data analysis, machine learning, statistical modeling, data visualization, and big data technologies. With an emphasis on practical applications and real-world projects, students gain hands-on experience using industry-standard tools and techniques. The Data Science program at Embry-Riddle Aeronautical University is uniquely positioned to address the needs of data science professionals in industries such as aviation, aerospace, security, healthcare, and transportation. Graduates will be prepared to tackle complex data challenges, identify trends, make data-driven predictions, and communicate findings effectively. Whether you aspire to be a data scientist, machine learning engineer, data analyst, or business intelligence specialist, our program provides a solid foundation for a successful career in data science.",
        "program website url": "https://erau.edu/degrees/data-science-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Data Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Engineering (B.S.E.) degree at Embry-Riddle Aeronautical University is a multidisciplinary program designed to equip graduates with a broad understanding of engineering principles applicable across various fields. Students enrolled in the B.S.E. program gain a solid foundation in mathematics, physics, and core engineering sciences, fostering problem-solving skills and critical thinking essential for innovation and design. The curriculum emphasizes a hands-on approach, integrating laboratory work and project-based learning to apply theoretical knowledge to real-world challenges. Through a unique blend of general engineering education and the opportunity to specialize in one of eight distinct areas — Aerospace, Civil, Computer, Electrical, Mechanical, Robotics, Software, or Space Engineering — students develop both a comprehensive engineering perspective and specialized expertise. This program prepares graduates for diverse career paths in industry, government, and research, or for advanced studies in engineering and related fields, enabling them to contribute effectively to the rapidly evolving technological landscape.",
        "program website url": "https://erau.edu/degrees/bachelor-of-science-in-engineering",
        "Accreditation status": "Accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "A Bachelor of Science in Safety Management degree from Embry-Riddle provides students with the foundational knowledge and skills required to become successful safety professionals, leaders, and managers in a variety of industries. This degree program prepares graduates to manage safety organizations and programs, conduct risk assessments, develop safety strategies, and implement safety policies and procedures effectively. Students learn to promote safety culture and compliance, contributing to a safe and healthy work environment. The curriculum covers a wide range of safety disciplines, including occupational safety, aviation safety, human factors, system safety, safety management systems (SMS), and environmental health and safety (EHS). Graduates are well-prepared for roles as safety managers, safety analysts, risk managers, and safety consultants in sectors such as aviation, aerospace, manufacturing, construction, transportation, and government.",
        "program website url": "https://erau.edu/degrees/safety-management-bs",
        "Accreditation status": "Embry-Riddle Aeronautical University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate, baccalaureate, master's, and doctoral degrees.",
        "Program name": "Bachelor of Science in Safety Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Simulation Science, Games and Animation (SSGA) degree prepares students to be leaders in the modeling and simulation, computer gaming and interactive entertainment industries. The degree focuses on the development of computer simulation systems, serious games, and interactive animations using technologies such as virtual reality (VR), augmented reality (AR), and artificial intelligence (AI). Graduates are proficient in state-of-the-art modeling and simulation, software engineering, and project management to analyze, design, and develop complex simulation systems in support of industrial and governmental applications.",
        "program website url": "https://erau.edu/degrees/bachelor/simulation-science-games-and-animation",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Simulation Science, Games, and Animation",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "A Bachelor of Science in Software Engineering degree from Embry-Riddle Aeronautical University provides students with a fundamental understanding of how to design, develop, test, and maintain complex software systems. Students learn to apply engineering principles to the entire software development life cycle, working with real-world applications in aerospace, aviation, and other high-tech industries. The program focuses on practical, hands-on experience, preparing graduates for successful careers as software engineers, developers, and architects. Software engineering students will learn to design, develop, test, deploy, and maintain robust software systems. Coursework focuses on the entire software development lifecycle, including: Developing scalable and secure software applications; Applying object-oriented design and programming principles; Working with various programming languages, tools, and platforms; Understanding database design and management; Implementing agile methodologies and best practices; Ensuring software quality through testing and verification; Collaborating in team-based project environments.",
        "program website url": "https://erau.edu/degrees/software-engineering-bs",
        "Accreditation status": "The Bachelor of Science in Software Engineering program at Embry-Riddle Aeronautical University's Prescott Campus is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Software Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Associate in Science (AS) in Aeronautics is a 60-credit-hour program offered through the College of Aeronautics that prepares graduates for a variety of aviation careers. The program offers students the opportunity to learn fundamental aviation concepts, air traffic control, aviation safety, flight operations, and the overall management of an aviation enterprise. Students can expect to gain a broad understanding of the aviation industry, its regulations, and operations, making them well-suited for entry-level positions or for continuing their education in a bachelor’s degree program.",
        "program website url": "https://erau.edu/degrees/aeronautics-as",
        "Accreditation status": null,
        "Program name": "Associate in Science in Aeronautics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle Aeronautical University's Associate of Science in Air Traffic Management degree combines knowledge of air traffic control, air traffic management, airport operations, aviation weather, and more into a robust program that prepares graduates to enter the high-demand field of air traffic control. The curriculum meets the requirements for the FAA Air Traffic Collegiate Training Initiative (AT-CTI) program.\n\nThe Air Traffic Management (ATM) program at Embry-Riddle, offered at the Daytona Beach Campus and through Embry-Riddle Worldwide & Online, is an Associate of Science (A.S.) degree designed to provide students with the foundational skills and knowledge for a career in air traffic control. Students enrolled in the ATM program on the Daytona Beach Campus are required to participate in the FAA Air Traffic Collegiate Training Initiative (AT-CTI) program and pass the Air Traffic Skills Assessment (ATSA) exam to qualify for the program. This program is offered to U.S. citizens only. Students will acquire the skills necessary to pursue a career in air traffic control through hands-on simulations, a focus on current policies and practices, and an understanding of regulations that apply to the field. Upon graduation, students will receive an AT-CTI certificate allowing them to bypass the initial FAA Air Traffic Controller (ATC) Academy training phase and apply directly for ATC positions, given they meet all other FAA hiring criteria.\n\nWith an A.S. in Air Traffic Management from Embry-Riddle, graduates are prepared to enter a rapidly expanding field, one that offers exciting opportunities. Air traffic controllers are responsible for ensuring the safe and efficient movement of aircraft within controlled airspace. This includes issuing clearances, providing traffic advisories, and coordinating with other air traffic control facilities. The Air Traffic Management program at Embry-Riddle prepares students to meet the demand in this field by providing skills and knowledge in areas such as:\n* Air Traffic Control Procedures\n* Air Traffic Management Operations\n* Airport Operations\n* Aviation Weather\n* Aviation Safety",
        "program website url": "https://erau.edu/degrees/associate/air-traffic-management",
        "Accreditation status": null,
        "Program name": "Associate of Science in Air Traffic Management",
        "Program Page url": "https://erau.edu/degrees/associate/air-traffic-management"
    },
    {
        "Concentration name": null,
        "description": "An Associate of Science in Aviation Business Administration provides students with a general business background specifically tailored to the aviation and aerospace industries. Students will learn the essentials of management, business law, marketing, and finance within the context of the aviation industry. The A.S. in Aviation Business Administration degree program is ideal for students who wish to immediately pursue careers in aviation business and for those who wish to continue their education in a bachelor’s degree program such as the Bachelor of Science in Aviation Business Administration. Graduates of this program are prepared for a variety of entry-level positions in the aviation industry, including airline operations, airport management, fixed-base operations (FBO) management, aviation sales, and customer service. They will also gain the foundational knowledge to pursue further education in aviation business or related fields.",
        "program website url": "https://erau.edu/degrees/associate/aviation-business-administration",
        "Accreditation status": null,
        "Program name": "Associate in Science in Aviation Business Administration",
        "Program Page url": "https://erau.edu/degrees/associate/aviation-business-administration"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Associate in Science in Aviation Maintenance Science degree program is a 60-credit-hour program designed to prepare graduates for various entry-level positions within the aviation maintenance field. Students will acquire foundational knowledge and hands-on skills required to maintain and repair aircraft. The curriculum integrates general education courses with specialized aviation maintenance training, ensuring graduates are well-rounded and technically proficient. Graduates will be prepared to take the Federal Aviation Administration (FAA) Airframe and Powerplant (A&P) certification exams, which are essential for many aviation maintenance careers. The program covers a broad range of topics, including aircraft systems, aviation regulations, avionics, propulsion systems, and maintenance procedures. Emphasis is placed on safety, quality, and compliance with industry standards, equipping students with the competencies needed for success in a dynamic and technologically advanced industry.",
        "program website url": "https://erau.edu/daytona-beach/degrees/aviation-maintenance-science-as",
        "Accreditation status": "Embry-Riddle Aeronautical University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate, baccalaureate, master’s, and doctoral degrees.",
        "Program name": "Associate in Science in Aviation Maintenance Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle Worldwide’s Aeronautical Studies Minor offers you the opportunity to learn more about the exciting fields of aviation and aeronautics. This minor is open to students pursuing any degree program. The curriculum is designed for you to gain a foundational knowledge of aviation topics such as meteorology, air traffic control, aviation safety, and more. This minor prepares students for various roles in the aviation industry, including airline operations, airport management, aviation safety analysis, and more.",
        "program website url": "https://worldwide.erau.edu/degrees/minor-aeronautical-studies",
        "Accreditation status": null,
        "Program name": "Minor in Aeronautical Studies",
        "Program Page url": "https://worldwide.erau.edu/colleges/arts-sciences/pathways"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Aeronautics provides an overview of the aeronautical industry and prepares students for entry-level positions or further education in aeronautical fields. The curriculum for the Minor in Aeronautics provides an opportunity to develop knowledge, skills, and understanding of topics related to the aeronautical industry that complement an existing undergraduate major. This minor provides an opportunity to combine your degree with a foundational understanding of aeronautics. Students may enhance their career opportunities in aviation, aerospace, and many other fields.",
        "program website url": "https://erau.edu/degrees/minor/aeronautics-db",
        "Accreditation status": null,
        "Program name": "Minor in Aeronautics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Aerospace Engineering Minor is available for any student on the Daytona Beach and Prescott campuses who wishes to expand their knowledge of the aerospace field but is not enrolled in the Bachelor of Science in Aerospace Engineering. As one of the most comprehensive aerospace universities in the world, Embry-Riddle provides the courses necessary to gain a solid foundation in the field. Students will acquire a fundamental understanding of topics such as flight mechanics, propulsion, aircraft structures, and aerodynamics.\n\nStudents pursuing this minor will benefit from the same high-quality education and faculty as those in the undergraduate program, exposing them to the rigorous curriculum that has produced countless successful aerospace engineers.",
        "program website url": "https://erau.edu/degrees/minor-aerospace-engineering",
        "Accreditation status": null,
        "Program name": "Minor in Aerospace Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Aerospace Life Sciences Minor program covers topics related to human performance in various extreme environments, including space. This minor is intended to prepare students to pursue careers in the emerging aerospace life sciences industry. Students will gain knowledge of human anatomy and physiology, the physiological and psychological stressors of flight and space, and current developments in aerospace life sciences that impact aerospace human factors and space exploration.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minor-aerospace-life-sciences",
        "Accreditation status": null,
        "Program name": "Minor in Aerospace Life Sciences",
        "Program Page url": "https://daytonabeach.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Air Cargo Management minor at Embry-Riddle offers students a multidisciplinary study of the air cargo industry. Students will gain a deep understanding of air cargo operations, management, logistics, security, regulations, and relevant business practices. This minor is designed for students seeking to enhance their knowledge and skills in the rapidly growing global air cargo sector, preparing them for careers in air cargo management, logistics, supply chain management, and related fields within the aviation industry. Through a combination of coursework and practical applications, students will explore the complexities of air cargo transportation, including freight forwarding, warehousing, customs procedures, and the use of technology to optimize supply chain efficiency.",
        "program website url": "https://erau.edu/degrees/air-cargo-management-minor",
        "Accreditation status": null,
        "Program name": "Minor in Air Cargo Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Airline Operations minor is open to all students and will provide you with a fundamental understanding of the airline industry. This minor is designed for individuals interested in careers in airline operations, airline management, or related fields in the aviation industry. Through the minor, students gain valuable knowledge and skills that are essential for success in this dynamic industry. From airline business models and regulatory frameworks to operational procedures and challenges, you'll explore various aspects of airline operations. Whether you're pursuing a degree in aeronautical science, business, or another discipline, the Airline Operations minor will complement your major and equip you with specialized knowledge. The minor offers a solid foundation for careers in airline management, flight operations, ground operations, dispatch, and other related roles. It also provides a pathway for further studies in aviation management or related graduate programs.",
        "program website url": "https://erau.edu/degrees/airline-operations-minor",
        "Accreditation status": null,
        "Program name": "Minor in Airline Operations",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Airport Baggage Handling Systems Implementation minor focuses on developing the professional skills necessary to analyze the requirements of airport baggage handling systems, develop specifications for new or modified systems, oversee implementation, and manage system operations. The courses in this minor address a wide range of topics, including fundamentals of airport operations, systems engineering principles, project management, and airport facilities management, with a specific focus on baggage handling systems. This minor is suitable for students in aviation, engineering, business, and other related fields who are interested in careers involving airport operations, logistics, or systems management.",
        "program website url": "https://worldwide.erau.edu/degrees-programs/airport-baggage-handling-systems-implementation-minor",
        "Accreditation status": null,
        "Program name": "Minor in Airport Baggage Handling Systems Implementation",
        "Program Page url": "https://worldwide.erau.edu/colleges/arts-sciences/department-mathematics-science-technology"
    },
    {
        "Concentration name": null,
        "description": "As the global economy strengthens and demand for air travel continues to grow, airports and airlines face a shortage of well-trained professionals in aviation management. To help prepare students for these exciting opportunities, Embry-Riddle Aeronautical University (ERAU) in partnership with ERC Institute (ERCI) offers the Bachelor of Science in Aviation Business Administration, which addresses critical demands for a specialized aviation workforce. The Bachelor of Science in Aviation Business Administration provides students with a solid business foundation and specialized knowledge in aviation business. The curriculum is delivered by ERAU-approved faculty, preparing students with essential skills for an entry-level management position in the global aviation industry. The curriculum focuses on general education courses, a common body of business core courses, and aviation business courses. Students will gain critical business, finance, management, and leadership knowledge to succeed in the aviation industry. In addition, the course focuses on current aviation business issues, including human resources management, marketing, airport operations, and aviation law, policies, and regulations. Students who graduate with a Bachelor of Science in Aviation Business Administration will be able to: Apply appropriate business theories and concepts to solve problems in the aviation business environment; Evaluate the various functions of management within the aviation industry; Appraise the regulatory environment in the aviation industry; Utilise effective communication in the aviation business environment; Evaluate the importance of effective leadership, critical thinking, and teamwork in the aviation industry.",
        "program website url": "https://erci.edu.sg/programmes/bachelors-degree-programmes/erau-bachelor-of-science-in-aviation-business-administration/",
        "Accreditation status": "Embry-Riddle Aeronautical University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate, baccalaureate, master's, and doctoral degrees.",
        "Program name": "Minor in Airport Management",
        "Program Page url": "https://erci.edu.sg/programmes/bachelors-degree-programmes/erau-bachelor-of-science-in-aviation-business-administration/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Air Traffic Control",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Air Transportation",
        "Program Page url": "https://www.reddit.com/r/AirForce/comments/15gttmz/what_did_you_do_with_your_degree/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Alternative Energy",
        "Program Page url": "https://campus.kennesaw.edu/colleges-departments/spceet/degrees-programs/minors/renewable-energy/index.php"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Applied Data Science",
        "Program Page url": "https://www.youtube.com/@embry-riddle_worldwide_coas"
    },
    {
        "Concentration name": null,
        "description": "Mathematics is the language of science and engineering. While most degree programs require students to take some form of calculus and differential equations, students who wish to go beyond these foundational courses can obtain the Minor in Applied Mathematics. The minor consists of 15-16 credit hours of coursework chosen from topics such as complex variables, partial differential equations, applied statistics, numerical analysis, vector analysis, and advanced linear algebra. The minor is offered on the Daytona Beach Campus.",
        "program website url": "https://erau.edu/degrees/applied-mathematics-minor",
        "Accreditation status": null,
        "Program name": "Minor in Applied Mathematics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Add a strong foundation in meteorology to your primary degree program with an Applied Meteorology minor at Embry-Riddle. Designed for students majoring in aviation, engineering, or related fields, this program will help broaden your career opportunities with a strong understanding of weather and atmospheric phenomena. Students pursuing an Applied Meteorology minor will take an intensive 15 credit-hour course of study, focusing on aviation meteorology, atmospheric observations and instrumentation, forecasting, tropical meteorology, and climate. Courses focus on the physics behind weather systems and the practical application of meteorological knowledge. You’ll learn how to interpret weather data, analyze atmospheric conditions, and understand the impact of weather on various industries, particularly aviation. This knowledge will provide valuable insights for those interested in careers involving weather-sensitive operations, such as piloting, air traffic control, emergency management, or environmental science.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minor-applied-meteorology",
        "Accreditation status": null,
        "Program name": "Minor in Applied Meteorology",
        "Program Page url": "https://daytonabeach.erau.edu/college-aviation/applied-aviation-sciences"
    },
    {
        "Concentration name": null,
        "description": "For students interested in the Arabic language, Middle Eastern culture, history, and politics, the Arabic and Middle Eastern Studies Minor offers an enriching addition to any degree program. Embry-Riddle offers students the opportunity to learn modern standard Arabic and immerse themselves in the rich culture and history of the Middle East. Through coursework, students gain a deeper understanding of the world, developing a global perspective that is critical in today's interconnected society. The minor consists of 15 credit hours of Arabic language, culture, and history courses.",
        "program website url": "https://erau.edu/degrees/arabic-and-middle-eastern-studies-minor/daytona-beach",
        "Accreditation status": null,
        "Program name": "Minor in Arabic and Middle Eastern Studies",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Department of Humanities & Communication offers a Minor in Artificial Intelligence, Ethics & Creativity that is designed to help students engage with the complex ethical, social, and creative dimensions of artificial intelligence. This minor is especially suited for students in STEM fields, providing a critical perspective on the human element in the development and deployment of AI. Students will explore topics such as AI ethics, human-computer interaction, critical thinking, and the role of creativity in an AI-driven world. The minor encourages an interdisciplinary approach, drawing from philosophy, communication, literature, and the arts to foster a holistic understanding of AI's societal impact. It aims to prepare students for a future where the ability to navigate ethical dilemmas and leverage human creativity will be paramount.",
        "program website url": "https://worldwide.erau.edu/colleges/arts-sciences/department-humanities-communication",
        "Accreditation status": null,
        "Program name": "Minor in Artificial Intelligence, Ethics and Creativity",
        "Program Page url": "https://worldwide.erau.edu/colleges/arts-sciences/department-humanities-communication"
    },
    {
        "Concentration name": null,
        "description": "The Astronautics Minor is designed to enhance knowledge of space systems for students who are not pursuing a degree in a space-related field. It provides students with a fundamental understanding of astronautical engineering, including orbital mechanics, spacecraft design and propulsion, and space environments. Students completing the minor will gain a basic understanding of space systems and their operations. The minor is suitable for students from a variety of engineering and scientific disciplines who wish to broaden their horizons to include space.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minor-astronautics",
        "Accreditation status": null,
        "Program name": "Minor in Astronautics",
        "Program Page url": "https://daytonabeach.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Astronomy and Astrophysics minor is available at the Daytona Beach, Florida, campus only. This minor is intended to provide students with a foundational knowledge of the solar system, stars, galaxies, and the universe. The coursework will provide students with an understanding of astronomical observations and analysis, astronomical instrumentation, stellar and galactic evolution, and cosmology. Students minoring in Astronomy and Astrophysics will participate in an Astronomy Lab where they will use observatory-class telescopes, analyze astrophysical data, and apply their knowledge of physics and mathematics to conduct research. The minor is appropriate for students seeking careers in aerospace, space science, and related industries.",
        "program website url": "https://erau.edu/degrees/astronomy-astrophysics-minor",
        "Accreditation status": null,
        "Program name": "Minor in Astronomy and Astrophysics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Daytona Beach Campus students interested in careers in aviation law, aviation insurance, or other aviation-related fields will gain a strong foundation through the Minor in Aviation Law. This minor is ideal for students who want to develop a deeper understanding of the legal and regulatory framework governing aviation. It provides an excellent pathway for those contemplating a Juris Doctor (JD) degree or those seeking to enhance their professional profile in aviation.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minor-in-aviation-law",
        "Accreditation status": null,
        "Program name": "Minor in Aviation Law",
        "Program Page url": "https://daytonabeach.erau.edu/college-aviation/aeronautical-science"
    },
    {
        "Concentration name": null,
        "description": "The Aviation Maintenance Operations minor allows students to apply the foundational skills learned in an Aviation Maintenance Operations Associate’s degree toward a Bachelor of Science degree. Students gain insight into aviation maintenance management, regulatory compliance, aircraft maintenance programs, quality systems, safety management systems, human factors, and sustainable practices in aviation maintenance. Upon completion, students will have the knowledge and skills required to pursue careers in aviation maintenance management, maintenance control, quality assurance, safety management, and regulatory compliance. The program is available to students attending the Daytona Beach, Prescott, and Worldwide Campuses.",
        "program website url": "https://erau.edu/degrees/minors",
        "Accreditation status": null,
        "Program name": "Minor in Aviation Maintenance Operations",
        "Program Page url": "https://erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Aviation Maintenance Science minor focuses on the technical aspects of aircraft maintenance and provides students with the foundational knowledge and skills required for the Federal Aviation Administration (FAA) Airframe and Powerplant certification. This minor is designed for students seeking to broaden their aviation expertise beyond flight operations or aerospace engineering, offering a pathway into the critical field of aviation maintenance. Students in this program will gain hands-on experience and theoretical knowledge in aircraft systems, maintenance practices, regulatory compliance, and safety procedures, preparing them for diverse roles within the aviation industry.",
        "program website url": "https://erau.edu/degrees/aviation-maintenance-science-minor-db",
        "Accreditation status": null,
        "Program name": "Minor in Aviation Maintenance Science Airframe",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Powerplant",
        "description": "The Aviation Maintenance Science minor is designed for students seeking to obtain both the Airframe and Powerplant (A&P) Certificate, the same credential earned by professional aviation mechanics. The coursework meets the FAA requirements for testing toward the A&P certificate. This minor helps prepare students for successful careers in a competitive industry where demand for aviation maintenance professionals continues to grow.",
        "program website url": "https://erau.edu/degrees/minor-aviation-maintenance-science",
        "Accreditation status": "Approved by the Federal Aviation Administration (FAA) under Title 14 CFR Part 147 as Aviation Maintenance Technician Schools.",
        "Program name": "Minor in Aviation Maintenance Science Powerplant",
        "Program Page url": "https://talk.collegeconfidential.com/t/value-of-an-faa-powerplant-certification-as-an-aero-engineer/2003578"
    },
    {
        "Concentration name": null,
        "description": "This minor allows students to apply the principles of management to the aviation and aerospace industries. Students will develop foundational knowledge in key areas of aviation business including airport and airline operations, aviation law, and aviation safety. This minor helps prepare students for managerial roles within the aviation and aerospace industry. Students from any major who want to gain a basic understanding of business applications in aviation will benefit from this minor.",
        "program website url": "https://erau.edu/degrees/aviation-management-minor",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Aviation Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Enhance your understanding of aviation safety principles and practices with the Aviation Safety Minor at Embry-Riddle. Designed for students across various disciplines, this minor provides a foundational knowledge of safety management systems, human factors, accident investigation, and risk management within the aviation industry. Graduates will be equipped to identify potential hazards, analyze safety data, and implement preventative measures, preparing them for roles where safety is paramount. The Embry-Riddle Aviation Safety minor provides an overview of accident investigation techniques, safety legislation, and the impact of human factors on aviation safety. You will develop critical thinking skills essential for navigating complex safety challenges and contributing to a culture of continuous improvement within the aviation industry.",
        "program website url": "https://erau.edu/degrees/aviation-safety-minor",
        "Accreditation status": null,
        "Program name": "Minor in Aviation Safety",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Aviation, Technology and Society minor examines the complex interactions among technology, humans, and the social structures created by and for the aviation and aerospace industries. This minor is open to all students at Embry-Riddle Aeronautical University. By taking five courses from an interdisciplinary list, students will be able to apply this knowledge in various fields ranging from aviation and aeronautics, human factors, and other STEM fields.",
        "program website url": "https://catalog.erau.edu/worldwide/arts-sciences/humanities-communication/aviation-technology-society-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Aviation, Technology and Society",
        "Program Page url": "https://worldwide.erau.edu/colleges/arts-sciences/department-humanities-communication"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in Avionics Line Maintenance",
        "Program Page url": "https://daytonabeach.erau.edu/college-aviation/aviation-maintenance-science"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Biomedical Engineering",
        "Program Page url": "https://admission.ucla.edu/apply/minors"
    },
    {
        "Concentration name": null,
        "description": "The Biomedical Sciences minor provides students with a foundational understanding of the biomedical sciences, with particular emphasis on human biology, physiology, and pathology. This minor prepares students to analyze human health, disease, and the development of potential therapeutics through coursework in the biological, chemical, and physical sciences.\n\nStudents who pursue the Biomedical Sciences minor will be able to:\n\nExplain cellular and molecular processes important for human health and disease.\nIdentify key physiological systems and their relevance to human health.\nDescribe the basics of epidemiology and disease diagnosis and treatment.\nCommunicate scientific findings to both scientific and general audiences.\nWork in teams to conduct scientific research.\nThe minor is an excellent option for students pursuing careers in healthcare, research, or further graduate studies in biomedical fields, including medicine, dentistry, and pharmacy. It complements a variety of majors by enhancing students' scientific foundation and analytical skills.",
        "program website url": "https://erau.edu/daytona-beach/degrees/biomedical-sciences-minor",
        "Accreditation status": null,
        "Program name": "Minor in Biomedical Sciences",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The minor in Business Administration is designed for students seeking to complement their primary course of study with a strong foundational knowledge of business principles. Students will be provided with an understanding of key functional areas of business, including accounting, finance, management, and marketing. This minor will help students develop skills essential for business decision-making and problem-solving, enhancing their marketability across various industries. Graduates with a minor in Business Administration will be well-prepared to contribute to the strategic and operational success of any organization, making them valuable assets in a competitive global economy.",
        "program website url": "https://erau.edu/degrees/business-administration-minor",
        "Accreditation status": null,
        "Program name": "Minor in Business Administration",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle Aeronautical University’s Chemistry minor allows students to build on existing knowledge of chemistry and develop new skills and expertise with particular applications in aerospace. Students gain an understanding of principles such as organic and inorganic chemistry, analytical chemistry and physical chemistry. The minor consists of 15 credits, providing a solid foundation in the concepts and principles of the science.",
        "program website url": "https://erau.edu/degrees/chemistry-minor",
        "Accreditation status": null,
        "Program name": "Minor in Chemistry",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Chinese Studies minor at Embry-Riddle provides students with a foundational knowledge of the Chinese language and an understanding of Chinese culture and society. Students will develop essential communicative skills in Modern Standard Mandarin, gain an appreciation for Chinese cultural traditions and values, and explore the historical and contemporary challenges facing China. The Chinese Studies minor is designed for students who want to enhance their global competence and career opportunities in fields such as international business, diplomacy, national security, aviation, and engineering, which often involve collaboration with Chinese counterparts.",
        "program website url": "https://prescott.erau.edu/degrees/chinese-studies-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Chinese Studies",
        "Program Page url": "https://prescott.erau.edu/college-business-security-intelligence/foreign-languages"
    },
    {
        "Concentration name": null,
        "description": "The Communication minor provides an opportunity for students to acquire communication skills in fields such as writing, public speaking, rhetoric, professional writing, and visual communication. The minor supports students in any major in becoming more effective communicators.",
        "program website url": "https://worldwide.erau.edu/colleges/arts-sciences/department-humanities-communication",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Communication",
        "Program Page url": "https://worldwide.erau.edu/colleges/arts-sciences/department-humanities-communication"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Communication and Broadcast Media",
        "Program Page url": "https://www.westmont.edu/office-registrar/academic-policies-and-procedures/majors-and-minors"
    },
    {
        "Concentration name": null,
        "description": "Computational mathematics is the use of mathematics and computer science to solve real-world problems. The Computational Mathematics Minor at Embry-Riddle provides students with a strong foundation in applying computation to model, analyze, and solve problems in diverse fields such as engineering, physics, and computer science. Students in the program develop skills in numerical analysis, algorithm development, and data analysis, preparing them for careers in research, industry, and academia. This minor complements a wide array of majors, enhancing career prospects in fields requiring advanced analytical and computational skills.",
        "program website url": "https://erau.edu/degrees/computational-mathematics-minor",
        "Accreditation status": null,
        "Program name": "Minor in Computational Mathematics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in Computer Aided Design/Computer Aided Manufacturing",
        "Program Page url": "https://advising.utah.edu/majors/quick-look/index.php"
    },
    {
        "Concentration name": null,
        "description": "A Computer Science Minor will give you an in-depth understanding of computation, algorithms, data structures, and computer programming. Students will apply computational thinking to solve complex problems across disciplines and develop foundational computer programming skills applicable to various career paths. Students who pursue the Computer Science Minor will also gain knowledge in: Designing, implementing, and evaluating computing-based solutions to meet a given set of computing requirements in the context of the program’s discipline. Applying computer science theory and software development fundamentals to produce computing-based solutions. Understanding and adhering to ethical responsibilities and professional practices of the computing profession. Functioning effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline. Communicating effectively regarding computing-based solutions, and design concepts appropriate to the program’s discipline. Analyzing a complex computing problem and to apply principles of computing and other relevant disciplines to identify solutions.",
        "program website url": "https://erau.edu/degrees/computer-science-minor-db",
        "Accreditation status": null,
        "Program name": "Minor in Computer Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "This minor introduces students to the challenges of cyber security in modern systems. Students will learn the principles, issues, and techniques required to secure information systems and networks. This minor covers a broad range of security topics including network security, application security, operating system security, cryptography, and legal/ethical issues in computer security. The Computer Security Minor is housed in the Department of Cyber Intelligence and Security in the College of Security and Intelligence.",
        "program website url": "https://prescott.erau.edu/degrees/minors/computer-security",
        "Accreditation status": null,
        "Program name": "Minor in Computer Security",
        "Program Page url": "https://prescott.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Crisis, Risk, and Resilience Communication minor provides students with the theoretical and practical skills necessary to communicate effectively in situations involving crisis and risk, as well as to build resilience within organizations and communities. Students will explore a wide range of topics, including crisis management, risk assessment, strategic communication, public relations, and social media in crisis. They will also learn how to develop communication strategies that promote organizational resilience, maintain public trust, and mitigate potential damage during times of uncertainty. Students will examine real-world case studies and engage in hands-on exercises to develop their critical thinking and problem-solving skills. They will be prepared to contribute to effective communication practices across various industries and sectors.",
        "program website url": "https://erau.edu/degrees/minor/crisis-risk-resilience-communication",
        "Accreditation status": null,
        "Program name": "Minor in Crisis, Risk, and Resilience Communication",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Embry-Riddle Minor in Cyber Intelligence and Security prepares students with a background in key cybersecurity and intelligence concepts and the practical skills to investigate cyber events and analyze cyber data. Designed to complement a wide range of degrees, this minor builds on the knowledge gained through prior coursework, provides students with an in-depth understanding of threat intelligence, information protection, incident response, vulnerability analysis, and digital forensics topics, and fosters the skills needed to solve complex problems in cyber intelligence and security.",
        "program website url": "https://erau.edu/degrees/cyber-intelligence-and-security-minor",
        "Accreditation status": null,
        "Program name": "Minor in Cyber Intelligence and Security",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Cybersecurity Application and Management minor focuses on the application and management of cybersecurity operations for business and government organizations. Topics include cybersecurity principles, management, and technical aspects such as networking and operating systems security. Students will gain the knowledge and skills necessary to protect organizational assets from cyber threats and ensure compliance with relevant regulations.",
        "program website url": "https://erau.edu/degrees/minor/cybersecurity-application-management",
        "Accreditation status": null,
        "Program name": "Minor in Cybersecurity Application and Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Cybersecurity is the practice of protecting systems, networks, and programs from digital attacks. These cyberattacks are usually aimed at accessing, changing, or destroying sensitive information; extorting money from users; or interrupting normal business processes. A Cybersecurity Engineering Minor at Embry-Riddle Aeronautical University provides students with a fundamental understanding of cybersecurity principles, the development of secure software, and the design of secure systems. Students will gain knowledge in the key areas of cybersecurity, including secure programming, secure computer systems, ethical hacking, and digital forensics. This minor will provide students with the ability to identify security vulnerabilities, analyze risks, and implement effective security controls to protect digital assets. The skills gained from this minor can be applied in various industries, including aviation, aerospace, defense, and beyond, preparing students for careers in cybersecurity.",
        "program website url": "https://erau.edu/degrees/minor/cybersecurity-engineering",
        "Accreditation status": null,
        "Program name": "Minor in Cybersecurity Engineering",
        "Program Page url": "https://erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "This interdisciplinary minor provides students with the foundational knowledge and skills in data science. Data science is a discipline that integrates methods from mathematics, statistics, and computer science to extract knowledge and insights from data in various forms and apply that knowledge in a variety of application domains. Students will learn the basic concepts of statistical inference, machine learning, and programming for data science. They will also gain experience with data manipulation, visualization, and modeling techniques.",
        "program website url": "https://erau.edu/degrees",
        "Accreditation status": null,
        "Program name": "Minor in Data Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "This minor provides students with a foundational understanding of defense studies, preparing them for careers in government, intelligence, defense industries, or further academic pursuits. Students will explore various aspects of national security, military strategy, international relations, and defense policy. The curriculum engages with historical contexts, current geopolitical challenges, and emerging threats, fostering a comprehensive understanding of the complex defense landscape.",
        "program website url": "https://prescott.erau.edu/degrees/minors",
        "Accreditation status": null,
        "Program name": "Minor in Defense Studies",
        "Program Page url": "https://prescott.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Diplomatic and Military History at Embry-Riddle Aeronautical University is designed to expose students to the historical development of international relations, military conflict, and diplomacy. Students will gain a deep understanding of historical events, their causes, consequences, and the evolution of diplomatic and military strategies. The minor complements various majors by providing a crucial historical context for careers in international affairs, national security, intelligence, and defense industries. Through this minor, students will develop critical thinking, analytical, and research skills applicable to a wide range of professional fields.",
        "program website url": "https://erau.edu/degrees/diplomatic-and-military-history-minor",
        "Accreditation status": null,
        "Program name": "Minor in Diplomatic and Military History",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "An Embry-Riddle Aeronautical University Minor in Economics is the study of how people allocate scarce resources for production, distribution, and consumption, both individually and collectively. With the study of economics, you will gain a better understanding of how the world works, which will allow you to make better decisions in your personal and professional life. This minor, offered through the Department of Global Security and Intelligence Studies, is intended for Embry-Riddle students seeking to gain a deeper understanding of economic concepts. A minor in economics will complement almost any major and can provide valuable preparation for careers in business, management, finance, data analytics, and government or for further study in law, business, or economics at the graduate level.",
        "program website url": "https://erau.edu/degrees/minor/economics",
        "Accreditation status": null,
        "Program name": "Minor in Economics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://daytonabeach.erau.edu/degrees/minors",
        "Accreditation status": null,
        "Program name": "Minor in Electrical and Computer Engineering",
        "Program Page url": "https://daytonabeach.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Electrical Engineering minor is intended for students who wish to supplement their major field of study with a concentration of Electrical Engineering courses. To be granted the Electrical Engineering minor, students must satisfy the requirements listed in the Minor in Electrical Engineering section of the catalog, including a minimum of 15 credit hours of approved coursework. At least nine of the 15 credit hours must be taken at Embry-Riddle. A minimum cumulative GPA of 2.0 in the courses used for the minor is required. A maximum of six credit hours taken to satisfy requirements for the minor can also satisfy requirements in the student's major and/or other minor(s). A maximum of three credits of undergraduate research (EE 499) may be applied toward the minor. The specific requirements for the Minor in Electrical Engineering are outlined in the catalog. Upon completion of the Electrical Engineering minor, students will be able to: Apply fundamental concepts of electrical engineering to solve problems related to circuits, electronics, and digital systems. Utilize appropriate tools and techniques for the analysis, design, and simulation of electrical engineering components and systems. Communicate effectively about technical topics in electrical engineering.",
        "program website url": "https://erau.edu/degrees/minor/electrical-engineering",
        "Accreditation status": null,
        "Program name": "Minor in Electrical Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Emergency Management minor provides students with the foundational knowledge and critical skills necessary to manage and mitigate disasters and emergencies effectively. Students explore principles of preparedness, response, recovery, and risk assessment, preparing them for roles in various governmental, non-profit, and private organizations involved in emergency management and homeland security. The program covers topics such as disaster planning, crisis communication, and interagency coordination, emphasizing a holistic approach to safeguarding communities and critical infrastructure against a wide range of threats.",
        "program website url": "https://daytonabeach.erau.edu/college-arts-sciences/security-studies",
        "Accreditation status": null,
        "Program name": "Minor in Emergency Management",
        "Program Page url": "https://daytonabeach.erau.edu/college-arts-sciences/security-studies"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://prescott.erau.edu/degrees/minors/emergency-planning-management",
        "Accreditation status": null,
        "Program name": "Minor in Emergency Planning and Management",
        "Program Page url": "https://prescott.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Emergency Services",
        "Program Page url": "https://erau.edu/degrees/bachelor/homeland-security"
    },
    {
        "Concentration name": null,
        "description": "The Engineering Science Minor is for students pursuing a non-engineering degree who want to broaden their knowledge in the engineering field or prepare for graduate studies in an engineering discipline. Students will gain a fundamental understanding of engineering principles, allowing them to apply problem-solving skills to real-world challenges. This minor is offered at the Daytona Beach and Prescott Campuses.",
        "program website url": "https://erau.edu/degrees/engineering-science-minor",
        "Accreditation status": null,
        "Program name": "Minor in Engineering Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Engineering Sciences",
        "Program Page url": "https://www.scribd.com/document/911096319/B-S-in-Aeronautics-ERAU-Curriculum-Plan"
    },
    {
        "Concentration name": null,
        "description": "The Entrepreneurship minor provides students with the business skills to start a new company or develop an entrepreneurial mind to innovate and create new businesses within an established organization. Through the minor, students learn how to develop a business plan, conduct market research, find funding, and scale their new ventures to a profitable and sustainable enterprise. The Entrepreneurship minor is available to all students except Business Administration majors. This minor requires 15 credit hours of coursework. Required Courses: ENTR 201: Introduction to Entrepreneurship (3 credits), ENTR 301: New Venture Creation and Funding (3 credits), ENTR 401: Scaling and Commercializing New Ventures (3 credits), MGMT 321: Principles of Management (3 credits), MKTG 220: Principles of Marketing (3 credits).",
        "program website url": "https://daytonabeach.erau.edu/degrees/minors",
        "Accreditation status": null,
        "Program name": "Minor in Entrepreneurship",
        "Program Page url": "https://daytonabeach.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "Explore the interdisciplinary field of environmental science with a minor from Embry-Riddle. Environmental Science is an interdisciplinary field, drawing on the sciences (e.g., biology, chemistry, geology, physics, atmospheric science) and mathematics, as well as engineering, social sciences, and the humanities, to understand environmental challenges facing the world today. Students completing the minor will gain an understanding of environmental issues from various perspectives, develop scientific literacy regarding environmental processes, and build a foundation in environmental management.",
        "program website url": "https://erau.edu/degrees/minor/environmental-science",
        "Accreditation status": null,
        "Program name": "Minor in Environmental Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "A minor in Finance provides students with fundamental knowledge in the areas of corporate finance, investments and financial markets and institutions. Students completing the minor will be prepared for a wide range of career opportunities in the financial services industry, as well as roles requiring financial expertise in corporations, government and non-profit organizations. Through the minor, students learn to analyze financial data, evaluate investment opportunities and make sound financial decisions.",
        "program website url": "https://erau.edu/degrees/minor/finance",
        "Accreditation status": "The College of Business is accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Program name": "Minor in Finance",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Flight is designed for Embry-Riddle Aeronautical University students who desire a basic flight experience in conjunction with their major. It offers students the opportunity to learn fundamental flight skills and concepts, providing a hands-on introduction to aviation. While not leading to a pilot certificate directly, it complements various majors by offering practical knowledge in flight operations and aircraft systems. Students will explore basic aerodynamics, aircraft performance, navigation principles, and aviation safety.",
        "program website url": "https://erau.edu/degrees/minor-flight",
        "Accreditation status": null,
        "Program name": "Minor in Flight",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Flight Test and Simulation Minor offers students a challenging opportunity to supplement their primary degree program by gaining exposure to the principles of flight test and the application of flight simulation and modeling. Students completing the Flight Test and Simulation Minor will understand the principles of flight test and the application of flight simulation and modeling. The minor provides an excellent opportunity for students to complement their major area of study by gaining skills necessary for employment in the flight test or flight simulation and modeling industries. The Flight Test and Simulation Minor is available at the Daytona Beach Campus.",
        "program website url": "https://erau.edu/degrees/flight-test-and-simulation-minor",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Flight Test and Simulation",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Forensic Accounting and Fraud Examination Minor provides students with an understanding of various fraud schemes, their detection and prevention, and the process of investigating fraud. This program will also help students develop skills in litigation support, forensic analysis, financial forensics, and the use of technology in forensic accounting. In addition, students will learn how to prepare forensic reports and communicate findings effectively. This minor is designed for students interested in careers in forensic accounting, fraud examination, internal auditing, and other related fields.",
        "program website url": "https://erau.edu/degrees/forensic-accounting-fraud-examination-minor-daytona-beach",
        "Accreditation status": null,
        "Program name": "Minor in Forensic Accounting & Fraud Examination",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Our Forensic Biology minor provides an overview of the role of biology within a forensic context, covering areas from crime scene investigation to laboratory testing. Topics include general biology, molecular biology, genetics, and forensic applications of biology. You'll gain valuable knowledge that can be applied to fields like law enforcement, forensic science, and criminal justice.",
        "program website url": "https://erau.edu/degrees/minor/forensic-biology",
        "Accreditation status": null,
        "Program name": "Minor in Forensic Biology",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Geographic Information Systems",
        "Program Page url": "https://nwas.org/2021-fall-scholarship-recipients-announced/"
    },
    {
        "Concentration name": null,
        "description": "If you are interested in issues surrounding peace, war, and conflict resolution, you may consider a Minor in Global Conflict Studies. This minor examines the causes and consequences of global conflict as well as various methods of dispute resolution. The minor helps students develop critical analysis skills for understanding international relations and conflict, and it allows them to hone their research, writing, and presentation skills.",
        "program website url": "https://daytonabeach.erau.edu/college-arts-sciences/security-studies",
        "Accreditation status": null,
        "Program name": "Minor in Global Conflict Studies",
        "Program Page url": "https://daytonabeach.erau.edu/college-arts-sciences/security-studies"
    },
    {
        "Concentration name": null,
        "description": "The Helicopter Operations and Safety minor provides students with a detailed and comprehensive understanding of the theory, principles, and concepts related to vertical flight operations. The course curriculum is designed for students interested in a career in helicopter operations, either as a pilot or in management/support roles. The minor emphasizes the operational and safety aspects of rotorcraft, covering topics such as aerodynamic principles of rotary wing flight, helicopter systems, performance, weather considerations, air traffic control procedures, crew resource management, human factors, risk management, and accident investigation. Graduates will be equipped with specialized knowledge that is critical for safety-conscious and efficient helicopter operations across various sectors including commercial, public service, and military applications.",
        "program website url": "https://catalog.erau.edu/daytona-beach/degrees-programs/minors/helicopter-operations-safety/",
        "Accreditation status": null,
        "Program name": "Minor in Helicopter Operations and Safety",
        "Program Page url": "https://erau.edu/course-catalogs"
    },
    {
        "Concentration name": null,
        "description": "A minor in Homeland Security provides an overview of the challenges facing our nation's security and the strategies, policies, and systems designed to mitigate them. Students will gain an understanding of the complex interdisciplinary nature of homeland security issues, preparing them to pursue careers in a wide range of fields from law enforcement and intelligence to emergency management and cybersecurity. The minor enhances professional prospects for students in any discipline while providing a solid foundation for those interested in pursuing further studies in homeland security or related fields. Students completing this minor will gain an understanding of:\n*   The complex nature of homeland security issues.\n*   Strategic approaches to protecting national assets.\n*   The various roles and responsibilities of government agencies.\n*   Risk assessment and management in security contexts.\n*   Cybersecurity challenges and responses.\n*   Emergency planning and disaster response.",
        "program website url": "https://erau.edu/degrees/homeland-security-minor",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Homeland Security",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Learn how to apply human factors principles to the design of systems, products and services. Human factors is a multidisciplinary field that focuses on optimizing human-system performance, safety and usability. Students will explore topics such as human-computer interaction, cognitive psychology, ergonomics, human error and system design. Through hands-on projects and case studies, students will develop practical skills in human factors analysis, evaluation and design. The Human Factors minor is designed to complement a wide range of majors, including engineering, aviation, psychology, computer science and business, providing students with valuable expertise to enhance their career prospects in various industries.",
        "program website url": "https://erau.edu/degrees/human-factors-minor",
        "Accreditation status": null,
        "Program name": "Minor in Human Factors",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "A minor in Human Factors Psychology will allow students to understand human behavior and performance within a variety of systems in both the physical and social worlds. The minor is an excellent addition to technical degrees such as aerospace engineering, mechanical engineering, computer science, and aeronautical science. Students learn the basic principles of cognitive psychology, perception, and human factors. This knowledge allows students to consider human capabilities and limitations when designing a system. The minor requires a total of 18 credit hours beyond the general education requirements. Students must earn a grade of 'C' or better in each course to satisfy the minor requirements.",
        "program website url": "https://daytonabeach.erau.edu/college-arts-sciences/human-factors",
        "Accreditation status": null,
        "Program name": "Minor in Human Factors Psychology",
        "Program Page url": "https://daytonabeach.erau.edu/college-arts-sciences/human-factors"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Human Resources will equip you with a fundamental understanding of the theories and principles of human resources, including how to attract, develop, motivate, and retain employees to meet the goals of an organization. The Minor in Human Resources provides students with the foundational knowledge and skills in key HR areas, including recruitment and selection, training and development, performance management, compensation and benefits, and employee relations. These skills are critical for successful careers in diverse industries, including aviation, aerospace, and business, and are essential for any manager. The knowledge gained in the minor is also applicable to students who plan to continue their education in a related graduate degree program or pursue professional HR certifications.",
        "program website url": "https://worldwide.erau.edu/degrees/minors/human-resources",
        "Accreditation status": null,
        "Program name": "Minor in Human Resources",
        "Program Page url": "https://worldwide.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle Aeronautical University (ERAU) has developed an interdisciplinary HSTEM minor for students within any major to understand the ethical and societal impacts of technology and to learn how to communicate and lead across disciplines. The HSTEM minor will be housed in ERAU's College of Arts and Sciences (COAS). The HSTEM minor provides students with a foundational understanding of the humanities, social sciences, and ethics, with an emphasis on their application to STEM fields. It encourages students to think critically about the implications of scientific and technological advancements, fostering a sense of social responsibility and ethical awareness. Students will learn to analyze complex problems from multiple perspectives, communicate effectively across disciplinary boundaries, and develop innovative solutions that consider both technical feasibility and societal well-being. The minor prepares students to address the challenges of an increasingly complex and interconnected world, equipping them with the skills to navigate ethical dilemmas, promote social justice, and contribute to the responsible development and application of technology.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Humanistic STEM",
        "Program Page url": "https://scispace.com/pdf/what-is-humanistic-stem-and-why-do-we-need-it-y3ejua52fu.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Humanities focuses on the broad, interdisciplinary study of human culture and society. It explores the meaning of the human experience across a wide range of fields, including: Art and design Communication and literature History and philosophy Music and theater Religion and ethics Students will analyze various forms of human expression and their historical, cultural, and philosophical contexts, developing critical thinking, analytical, and communication skills applicable to any career path. This minor is an excellent complement to any STEM degree, providing a broader perspective on the human impact and ethical considerations of technological advancements.",
        "program website url": "https://erau.edu/degrees/minor-in-humanities",
        "Accreditation status": null,
        "Program name": "Minor in Humanities",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Industrial-Organizational (I-O) Psychology is a scientific field of study that focuses on human behavior in the workplace. I-O psychologists research and apply psychological principles to areas like personnel selection and placement, training and development, performance management, employee motivation and engagement, organizational development, and work-life balance. I-O psychologists work in various settings, including consulting firms, corporations, government agencies, non-profits, and universities. A Minor in I-O Psychology is a great option for students in a variety of fields, including business, communication, marketing, human resource management, or other psychology fields like clinical, counseling, or general psychology. The 18-credit minor provides students with the foundational knowledge of I-O psychology. This minor may not be added to the B.A./B.S. in Industrial-Organizational Psychology.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Industrial/Organizational Psychology",
        "Program Page url": "https://www.taylor.edu/academics/degrees/industrial-organizational"
    },
    {
        "Concentration name": null,
        "description": "The Intelligence Minor at Embry-Riddle Aeronautical University prepares students to apply their knowledge and skills in support of national security interests or to pursue graduate studies related to intelligence and national security. The minor introduces students to the core missions, functions, and organizations of the U.S. Intelligence Community while examining its role in supporting the formulation and execution of U.S. foreign policy and national security strategy. The curriculum also introduces students to intelligence collection methods, analysis techniques, intelligence oversight, and covert action. Students will study the history of intelligence, key legal and ethical issues, and how intelligence is used to support decision-making in an increasingly complex and interconnected world. The program also examines the challenges of intelligence support in areas such as counterterrorism, cybersecurity, counterintelligence, and global threats to national security.",
        "program website url": "https://erau.edu/degrees/intelligence-minor",
        "Accreditation status": null,
        "Program name": "Minor in Intelligence",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The International History Minor at Embry-Riddle is designed to broaden the horizons of students in any major, particularly those with a focus on international relations, global studies, or security studies. This minor provides students with a deeper understanding of the historical forces that have shaped our world, offering critical insights into global interactions, conflicts, and cooperation through time. Students will explore diverse historical perspectives, analyze key historical events, and develop a nuanced understanding of international relations from a historical context.",
        "program website url": "https://erau.edu/degrees/international-history-minor",
        "Accreditation status": null,
        "Program name": "Minor in International History",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in International Relations",
        "Program Page url": "https://catalog.illinois.edu/undergraduate/minors/"
    },
    {
        "Concentration name": null,
        "description": "A minor in Latin American Studies helps students gain a greater understanding of the complex cultural, political, economic, and social issues facing this important region of the world. Students interested in the Latin American Studies minor can take courses in Spanish, history, political science, humanities, and communication. They also have the opportunity to study abroad in a Spanish-speaking country. Our interdisciplinary minor prepares students for careers in government, journalism, international business, and graduate studies.",
        "program website url": "https://daytonabeach.erau.edu/college-arts-sciences/humanities-communications/language-classes-culture-minors",
        "Accreditation status": null,
        "Program name": "Minor in Latin American Studies",
        "Program Page url": "https://daytonabeach.erau.edu/college-arts-sciences/humanities-communications/language-classes-culture-minors"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Leadership minor prepares students from all majors to become effective leaders in any industry. This minor will provide students with the opportunity to develop skills in team building, project management, and conflict resolution, which are essential for success in today’s dynamic workforce. Students will also gain a deeper understanding of various leadership theories, ethical decision-making, and communication strategies, which are crucial for inspiring and motivating others.",
        "program website url": "https://erau.edu/degrees/minors",
        "Accreditation status": null,
        "Program name": "Minor in Leadership",
        "Program Page url": "https://erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "Supply chain management is a critical and growing field, and students with a minor in Logistics Management are prepared to enter a dynamic industry. The field is expected to grow by 26% over the next decade. In the Logistics Management Minor, students learn about purchasing, materials management, distribution, transportation, warehousing, and inventory control. The Minor in Logistics Management is available to all Embry-Riddle students across all colleges except those pursuing the Logistics and Supply Chain Management major.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minor/logistics-management",
        "Accreditation status": null,
        "Program name": "Minor in Logistics Management",
        "Program Page url": "https://www.quora.com/What-minor-should-I-choose-as-a-logistics-and-supply-chain-management-major"
    },
    {
        "Concentration name": null,
        "description": "For students in any academic discipline who wish to gain a fundamental understanding of business operations and effective management techniques, the Management Minor will help develop students’ leadership potential. This minor provides a foundational understanding of decision-making, organizational behavior, marketing, finance, and information systems crucial to successful business operations across a wide range of industries, including aviation, aerospace, and all other technology-driven fields. Students will learn the essentials of management theory and practice, preparing them to lead teams and projects, optimize resource allocation, and navigate complex organizational challenges. The Management Minor is an excellent addition for students who plan to pursue entrepreneurship or to advance into leadership positions within larger corporations, non-profit organizations, or government agencies.",
        "program website url": "https://erau.edu/degrees/management-minor",
        "Accreditation status": null,
        "Program name": "Minor in Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Management Information Systems (MIS) at Embry-Riddle is designed to equip students with a fundamental understanding of how information systems are developed, implemented and managed to support business operations and strategic decision-making. Students will gain foundational knowledge in database management, systems analysis and design, and project management. This program provides essential skills for students interested in careers at the intersection of business and technology, making them valuable assets in any organization. The MIS minor is offered through the Department of Decision Sciences in the College of Business.",
        "program website url": "https://erau.edu/degrees/management-information-systems-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Management Information Systems",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Learning a foreign language is an asset in today’s global environment. Language studies enhance your ability to understand other cultures, broaden your career options, and provide you with a competitive edge in any field. Embry-Riddle offers students the opportunity to minor in French, German, Japanese, Mandarin Chinese, Russian, and Spanish.",
        "program website url": "https://prescott.erau.edu/college-business-security-intelligence/foreign-languages",
        "Accreditation status": null,
        "Program name": "Minor in Mandarin Chinese",
        "Program Page url": "https://prescott.erau.edu/college-business-security-intelligence/foreign-languages"
    },
    {
        "Concentration name": null,
        "description": "The Marketing Minor allows students to develop an understanding of marketing principles and practices. This minor is not available to Marketing BS students. You will gain foundational knowledge and practical experience in a variety of marketing concepts, including market research, consumer behavior, strategic marketing, and digital marketing. Courses cover topics such as marketing management, integrated marketing communications, and global marketing.",
        "program website url": "https://erau.edu/degrees/marketing-minor",
        "Accreditation status": null,
        "Program name": "Minor in Marketing",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Minor in Mathematics allows students to develop an understanding of mathematical principles and learn how to apply those principles to real-world scenarios. Students will learn how to think critically and analytically, communicate mathematical ideas effectively, and solve complex problems. Whether you want to pursue a career in data analysis, engineering, finance, or research, a Minor in Mathematics will give you a competitive edge. This minor is available at both the Daytona Beach, FL, and Prescott, AZ, campuses.",
        "program website url": "https://erau.edu/degrees/minor-mathematics",
        "Accreditation status": null,
        "Program name": "Minor in Mathematics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "With a minor in Mechanical Engineering, you can customize your degree program at Embry-Riddle’s Prescott Campus to expand your knowledge of mechanical systems and gain deeper exposure to the processes of research, design, manufacturing, and testing within engineering. Mechanical engineering is the study, design, and analysis of all things mechanical — from the smallest components to the largest, most complex systems. Mechanical engineers design and analyze propulsion systems for aircraft and spacecraft, develop energy systems, create biomechanical devices, and contribute to the advanced design of robotics and autonomous systems. No matter what your major, adding a Mechanical Engineering Minor to your degree will enhance your understanding of mechanical systems and broaden your career opportunities. Mechanical engineering skills are highly valued in aerospace, robotics, renewable energy, and many other industries. This minor can complement a wide range of degrees from Aeronautical Science to Computer Science to Spaceflight Operations, giving you a competitive edge in the job market.",
        "program website url": "https://prescott.erau.edu/degrees/minors/mechanical-engineering-minor",
        "Accreditation status": null,
        "Program name": "Minor in Mechanical Engineering",
        "Program Page url": "https://prescott.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Military Science minor is designed to provide students with additional knowledge, skills, and abilities for leadership development in military organizations. The minor includes courses in subjects such as Army leadership, applied leadership, military history, and ethics in the military profession. Students will gain an understanding of military operations, tactics, and strategy, as well as the importance of effective communication and decision-making in high-pressure environments. The Military Science minor is open to all students, regardless of their major, and provides a valuable complement to any degree program for those interested in a military career or enhancing their leadership skills for other fields.",
        "program website url": "https://erau.edu/degrees/military-science-minor",
        "Accreditation status": null,
        "Program name": "Minor in Military Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "This minor is designed to develop a student's understanding of military history, culture, and current operations in a global context. The minor provides an interdisciplinary approach to the study of the military, allowing students to explore various aspects of military affairs, including leadership, strategy, ethics, and technology. Students completing the Military Studies minor will be able to: Demonstrate knowledge of military history, culture, and operations; Analyze the role of military force in international relations; Evaluate ethical considerations in military contexts; Apply leadership principles within military and organizational settings; Critically assess technological advancements and their impact on military affairs.",
        "program website url": "https://erau.edu/degrees/minor/military-studies-daytona-beach",
        "Accreditation status": null,
        "Program name": "Minor in Military Studies",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Occupational Safety and Health",
        "Program Page url": "https://www.scribd.com/document/911096319/B-S-in-Aeronautics-ERAU-Curriculum-Plan"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Physics is ideal for students who wish to gain a deeper understanding of the fundamental principles that govern the universe. This minor complements a wide range of majors, including engineering, mathematics, and computer science, by providing a strong foundation in physical laws and their applications. Students will delve into topics such as mechanics, electromagnetism, thermodynamics, and quantum mechanics, developing analytical and problem-solving skills crucial for scientific and technological advancements.",
        "program website url": "https://erau.edu/degrees/physics-minor",
        "Accreditation status": null,
        "Program name": "Minor in Physics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "If you are a student interested in becoming a project manager, then Embry-Riddle Aeronautical University’s Minor in Project Management is for you. Located at the Daytona Beach Campus, students enrolled in this program will study the methodologies of initiating, planning, executing, controlling, and closing projects. Students who pursue a minor in Project Management will be well-prepared to sit for the Certified Associate in Project Management (CAPM)® exam, an entry-level certification for project practitioners. As a Project Management minor, you will learn foundational project management skills applicable to a wide array of industries through specific courses such as Project Management Process, Leading Projects, Project Planning, Managing Project Risk, and Project Control.",
        "program website url": "https://erau.edu/degrees/project-management-minor",
        "Accreditation status": null,
        "Program name": "Minor in Project Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Minor in Propulsion provides students with a fundamental understanding of both airbreathing and rocket propulsion. The minor provides a background in propulsion for students in various disciplines, including aerospace engineering, mechanical engineering, space physics and others. This minor will help prepare you for a career in the aerospace industry, working on gas turbine engines, rockets, missiles and more.",
        "program website url": "https://erau.edu/degrees/minor-propulsion",
        "Accreditation status": null,
        "Program name": "Minor in Propulsion",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "At Embry-Riddle, a Psychology minor can provide students from all degree programs with an understanding of human behavior in a variety of contexts, which can lead to better professional performance and a more fulfilling life. The minor expands students' understanding of the human mind, including theories of cognition, personality, and social psychology. These concepts are taught through a diverse curriculum covering topics such as abnormal psychology, forensic psychology, and human factors. Psychology coursework can help students develop practical skills applicable to careers in the military, criminal justice, law, business, and education. Students will also gain valuable experience working with data, learning about research, and developing critical thinking skills related to various real-world situations and career fields.",
        "program website url": "https://erau.edu/degrees/psychology-minor",
        "Accreditation status": null,
        "Program name": "Minor in Psychology",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Research Foundations minor is designed to provide students with foundational knowledge and skills in research methodologies and practices. Students will learn about research ethics, data collection and analysis, scientific writing, and presentation skills. The minor is suitable for students from any discipline who wish to enhance their research capabilities or prepare for graduate studies. This minor provides a strong foundation for future research endeavors in academic or professional settings.",
        "program website url": "https://catalog.erau.edu/daytona-beach/arts-sciences/research-foundations-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Research Foundations",
        "Program Page url": "https://erau.edu/course-catalogs"
    },
    {
        "Concentration name": null,
        "description": "The Robotic Systems Minor at Embry-Riddle's Daytona Beach campus gives students from various majors the opportunity to broaden their skills and knowledge in the growing field of robotics. This minor offers a flexible option to complement a student’s primary area of study and enrich their education by studying robotic systems from a multidisciplinary perspective. The curriculum focuses on an applied, hands-on approach to designing, building, and programming robotic systems. Robotic Systems is a burgeoning field that will impact industries across the globe. Adding a minor in robotic systems to your degree program will enhance your skillset for a variety of occupations, from aerospace to computer science, from engineering to mechanical science. This program can prepare students to: Design, build, and program autonomous robotic systems. Integrate multiple sensors and communication devices into robotic systems. Understand the theory behind robotics while also applying a hands-on approach. Apply problem-solving skills to real-world applications. Analyze and debug robotic systems.",
        "program website url": "https://erau.edu/degrees/robotic-systems-minor",
        "Accreditation status": null,
        "Program name": "Minor in Robotic Systems",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Enhance your skills with an interdisciplinary minor focused on the fundamentals of robotics, including autonomous intelligent systems and robotic systems design. Course work in this minor develops students’ expertise in the foundational mathematics, physics, computing and design principles relevant to modern robotics. This minor is open to all students, but is particularly suitable for engineering and computer science majors. Contact the Department of Mechanical Engineering for more information.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minors",
        "Accreditation status": null,
        "Program name": "Minor in Robotics",
        "Program Page url": "https://daytonabeach.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Russian Studies Minor program is designed for students with an interest in Russian language and culture. Students can complete the program with no prior Russian language experience. Completion of this minor provides students with a foundational understanding of the Russian language as well as Russian literature, history, and culture. Graduates of the program will have a competitive edge for careers in government, intelligence, international relations, and STEM professions requiring a strong understanding of Russian language and culture. The minor requires a minimum of 15 credits including at least 9 credits at the 300-level or above. Students must maintain a minimum 2.0 GPA in the courses that apply toward the minor. Up to 6 credits may be transferred from another institution toward the minor, subject to approval.",
        "program website url": "https://erau.edu/degrees/russian-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in Russian Studies",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Science Literacy minor provides students with the critical thinking skills needed to interpret and evaluate scientific claims and the communication skills to articulate scientific information to both expert and lay audiences. Students will also be able to recognize the impact of scientific issues on society. This interdisciplinary minor builds on the sciences and humanities, preparing students to critically evaluate a wide range of scientific topics encountered in their daily lives, including climate change, public health, and artificial intelligence. The minor also helps students communicate scientific data and theories in an ethical and effective manner, equipping them to translate complex scientific information for public understanding across diverse media platforms.",
        "program website url": "https://erau.edu/degrees/minor/science-literacy",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Science Literacy",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Security and Intelligence",
        "Program Page url": "https://www.scribd.com/document/911096319/B-S-in-Aeronautics-ERAU-Curriculum-Plan"
    },
    {
        "Concentration name": null,
        "description": "The Small Uncrewed Aircraft Systems (sUAS) Operation minor introduces students to the basic aspects of Uncrewed Aircraft Systems (UAS), specifically small uncrewed aircraft (sUA). This minor offers a blend of theoretical knowledge and practical application, providing students with the skills and knowledge necessary to pursue employment in the sUAS industry or to incorporate sUAS operations into their existing profession. The curriculum includes courses that cover UAS regulations, operations, applications, and hands-on flight experience, ensuring graduates are well-versed in both the technical and operational aspects of sUAS.",
        "program website url": "https://erau.edu/degrees/small-uncrewed-aircraft-systems-suas-operation-minor",
        "Accreditation status": null,
        "Program name": "Minor in Small Uncrewed Aircraft Systems (sUAS) Operation",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Students will gain an understanding of how space systems are designed, operated, and integrated into complex space missions. Graduates will be prepared to contribute to the operation of spacecraft, ground systems, and space-related activities in both government and commercial sectors. This minor provides students with knowledge, skills, and abilities for a career in the space industry focusing on operations.\n\nThe Space Operations minor requires 15 credit hours of coursework covering orbital mechanics, spacecraft systems, space mission operations, and space policy and law. Students will learn about the current state of the space industry, its challenges, and opportunities. The minor also provides hands-on experience with space mission design and simulation tools.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minor-space-operations",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Space Operations",
        "Program Page url": "https://daytonabeach.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Space Physics is an excellent option for students pursuing a degree in a related field who want to broaden their knowledge with an understanding of space physics. Space Physics deals with the study of plasma processes occurring in the space environment, particularly in the Earth’s magnetosphere, ionosphere, and the sun’s corona. Space physics is an emerging field with many opportunities for graduates, especially in space weather, where space events affect technological systems on Earth and in space.",
        "program website url": "https://erau.edu/degrees/minor-space-physics/daytona-beach",
        "Accreditation status": null,
        "Program name": "Minor in Space Physics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Space Policy, History and Culture, offered through Embry-Riddle’s College of Arts and Sciences, allows students to explore space as a social, political, economic, and cultural phenomenon. This 15-credit minor focuses on the complex nature of human interactions with the space environment, equipping students with a multidisciplinary understanding of space activities. Students will examine space exploration from various angles, including its historical context, ethical implications, and global governance frameworks. The curriculum covers topics such as international space law, space security, commercial space ventures, and the cultural impact of space on society. Students will learn about space history, policy, law, culture, and ethics. They will analyze historical and contemporary issues in space policy, evaluate the geopolitical and socioeconomic impacts of space activities, develop critical thinking skills to address complex challenges in space governance, and engage in interdisciplinary research on space-related topics. This minor prepares students for roles in space advocacy, diplomacy, policy analysis, and related fields, enhancing career prospects in government agencies (like NASA, NOAA, Department of State), aerospace companies, think tanks, non-profit organizations, and international organizations (like the United Nations Office for Outer Space Affairs). It complements a wide range of majors, including aerospace engineering, aeronautical science, homeland security, and global security and intelligence studies.",
        "program website url": "https://erau.edu/degrees/minor/space-policy-history-and-culture",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Space Policy, History and Culture",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Space Studies program at Embry-Riddle is designed for students seeking to broaden their knowledge in space-related disciplines. This program offers a unique interdisciplinary approach, drawing from various fields such as astronomy, engineering, space law, and policy. Students will explore topics like spacecraft design, orbital mechanics, space exploration, and the legal and ethical aspects of space utilization. This minor is ideal for those passionate about space and looking to enhance their primary degree with specialized expertise, preparing them for careers in the growing space industry or further academic pursuits.",
        "program website url": "https://worldwide.erau.edu/degrees/space-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in Space Studies",
        "Program Page url": "https://worldwide.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Spanish",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic_minor"
    },
    {
        "Concentration name": null,
        "description": "The Supply Chain Management in Aviation and Aerospace minor prepares students to understand and integrate current supply chain technologies and management systems in the aviation and aerospace industry. Students will gain knowledge in areas such as procurement and sourcing, logistics and distribution, quality control, operations management, and supply chain analytics. The minor complements various degree programs by providing a specialized understanding of supply chain principles critical to the aviation and aerospace sector, enhancing graduates' competitiveness in a rapidly evolving global market.",
        "program website url": "https://daytonabeach.erau.edu/degrees/minor/supply-chain-management-aviation-aerospace",
        "Accreditation status": null,
        "Program name": "Minor in Supply Chain Management in Aviation and Aerospace",
        "Program Page url": "https://daytonabeach.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "Systems Engineering is an interdisciplinary field of engineering and engineering management that focuses on how to design and manage complex systems over their life cycles. As a systems engineer, you learn to oversee the complete life cycle of projects and products, from concept to production, operation, and ultimately, disposal. You will learn to integrate the knowledge of all technical disciplines, including software, hardware, and human-factors engineering, into a coherent whole. Systems engineers work with various industries, including aerospace, defense, energy, healthcare, and transportation, and are responsible for ensuring that all components of a project or product work together seamlessly. The Systems Engineering Minor is an excellent option for any student interested in learning about the interdisciplinary aspects of designing, developing, and managing complex systems over their life cycles. This minor helps prepare students for successful careers in various industries, including aerospace, defense, energy, healthcare, and transportation.",
        "program website url": "https://erau.edu/degrees/systems-engineering-minor",
        "Accreditation status": null,
        "Program name": "Minor in Systems Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Technical Intelligence minor prepares students to analyze technical data and synthesize intelligence information from publicly available and classified sources. Students learn the analytical process for identifying, collecting, exploiting, and disseminating technical intelligence about foreign weapons and space systems. The interdisciplinary curriculum focuses on analyzing technical intelligence data with applications to national security and commercial applications. The minor provides a multi-domain analytical framework that focuses on advanced technologies such as cyber, artificial intelligence, unmanned and autonomous systems, hypersonics, and space systems. Students will learn the collection and analytical tradecraft required to support the intelligence community, federal law enforcement, and national security agencies.",
        "program website url": "https://prescott.erau.edu/degrees/minors/technical-intelligence",
        "Accreditation status": null,
        "Program name": "Minor in Technical Intelligence",
        "Program Page url": "https://prescott.erau.edu/degrees/minors"
    },
    {
        "Concentration name": null,
        "description": "The minor in Technical Management provides the business management expertise necessary to effectively manage engineering and technology-oriented programs and projects. Students will gain an understanding of principles such as organizational behavior, financial management, marketing, and the legal and ethical issues related to operating a business in a global environment. This minor is an excellent complement to technical and engineering degrees, providing students with the skills needed to lead teams and manage projects effectively within a technical field.",
        "program website url": "https://erau.edu/degrees/technical-management-minor",
        "Accreditation status": null,
        "Program name": "Minor in Technical Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Terrorism is a serious threat to national and international security. With the Minor in Terrorism Studies program, you will develop an understanding of the historical, political, and cultural factors associated with terrorism and counterterrorism. You will also learn about the policies and strategies for combating terrorism. This minor is open to all students at Embry-Riddle’s Prescott and Worldwide Campuses.",
        "program website url": "https://erau.edu/degrees/terrorism-studies-minor",
        "Accreditation status": null,
        "Program name": "Minor in Terrorism Studies",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in Uncrewed Aircraft Systems",
        "Program Page url": "https://www.sdstate.edu/programs/undergraduate/uncrewed-aircraft-systems-minor"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Uncrewed Aircraft Systems Applications minor focuses on the practical application of UAS and their integration into various operations. From basic UAS operations to advanced remote sensing technologies, students will learn to operate UAS in a safe and legal manner while gaining an understanding of the impact of UAS on society. This interdisciplinary minor allows students to apply these technologies to their primary field of study, enhancing their marketability and giving them a competitive edge.",
        "program website url": "https://erau.edu/degrees/uncrewed-aircraft-systems-applications-minor",
        "Accreditation status": null,
        "Program name": "Minor in Uncrewed Aircraft Systems Applications",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "As UAS technology continues to evolve, so does the demand for qualified operators within various public safety organizations. From law enforcement to search and rescue, UAS are becoming indispensable tools for enhancing situational awareness, improving response times, and increasing overall effectiveness. Embry-Riddle’s Uncrewed Aircraft Systems (UAS) in Public Safety Minor provides students with the knowledge and skills necessary to effectively integrate UAS into public safety operations. Whether you’re pursuing a career in law enforcement, emergency management, or firefighting, this minor will provide you with a competitive edge and prepare you for a rewarding career in an increasingly important field. The curriculum covers a range of topics, including UAS operations, regulations, data analysis, and ethical considerations specific to public safety applications. Students will gain hands-on experience with UAS platforms and software, developing the practical skills needed to deploy and operate UAS safely and efficiently in real-world scenarios.",
        "program website url": "https://erau.edu/degrees/uncrewed-aircraft-systems-uas-in-public-safety-minor",
        "Accreditation status": null,
        "Program name": "Minor in Uncrewed Aircraft Systems (UAS) in Public Safety",
        "Program Page url": "https://erau.edu/degrees"
    }
]