[
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To apply for the Master of Public Administration program, applicants must complete the Graduate Application for Admission, submit a 2-3 page statement of purpose responding to a specific prompt, submit a current résumé detailing educational and work experience, provide two letters of recommendation submitted through the online application system, submit official transcripts from all previously attended colleges, and submit a 3-4 page Critical Essay on an Issue in Public Administration based on a provided topic. A $50 application fee is also required. Some applicants may be invited for an interview.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Public Administration",
        "Program Page url": "https://www.evergreen.edu/offices-services/master-of-public-administration-mpa"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be considered for admission, you will need to submit a complete application. Your application will consist of: Online application with non-refundable fee ($50). Statement of Purpose. Resume. Unofficial transcripts from all colleges/universities you attended. Official transcripts will be required upon acceptance. Two letters of recommendation. Writing Sample (optional).",
        "WritingSample": "Optional",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Environmental Studies",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "A complete application for the Master in Teaching program includes: an online Application for Graduate Study, a two-page Statement of Purpose, official transcripts from all colleges and universities attended, three letters of recommendation submitted through the online application system, passing scores for the Washington Educator Skills Test-Basic (WEST-B) or an approved alternative, documentation meeting the endorsement requirement, a Character & Fitness Supplement, and an interview. An application fee is also required.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": 22,
        "MinimumSATScore": 1125,
        "extraction_level": "program",
        "Program name": "Master in Teaching",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": null,
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Sustainability Master of Business Administration",
        "Program Page url": "https://www.evergreen.edu/admissions-and-aid/graduate-student"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "All applicants must submit:\n\nAn online application for admission to The Evergreen State College Graduate School for the MPA program.\nAn application fee of $50 (this fee may be waived based on financial need).\nOfficial transcripts from all previously attended colleges and universities.\nAt least two letters of recommendation from faculty who have taught you, or supervisors who know your work.\nStatement of purpose describing how the MPA program will help you meet your personal and professional goals (500–750 words).\nA resume listing your relevant work and volunteer experience.\nAn analytical essay based on one of two prompts (500–750 words).",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Tribal Governance",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "The Evergreen MPA is a competitive program. We conduct a holistic review of all application materials to determine the potential of each applicant. Successful applicants typically have a cumulative GPA of 3.0 or higher in their last 90 quarter/60 semester credits of study. We give preference to applicants with one or more years of work or volunteer experience in the public or non-profit sectors. What you need to apply: Online Application and application fee. Official transcripts from any college or university where you earned credit. Two letters of recommendation. Statement of Purpose (1,000 words maximum). Résumé (3 pages maximum). (Optional) Supplemental Essay (500 words maximum). The GRE is not required.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Public and Nonprofit Administration",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "All applicants to the MPA program must submit the following materials to be considered for admission:\n\n*   Graduate Application\n*   Application Fee\n*   Statement of Purpose: In 500-1000 words, tell us why you are applying to Evergreen’s MPA program. This is your opportunity to demonstrate your writing ability and to tell us about your personal and professional goals.\n*   Résumé: Upload a current résumé that highlights your professional and/or academic experience and skills relevant to the MPA program. For applicants with limited professional experience, highlight your relevant volunteer and community service.\n*   Official College Transcripts: Official transcripts from all previously attended colleges and universities are required.\n*   Letters of Recommendation: Three letters of recommendation are required from academic or professional references who can attest to your ability to do graduate-level work.\n*   Analytical Writing Prerequisite: Applicants must be able to demonstrate they have met the prerequisite by submitting one of the following:\n    *   An official transcript showing successful completion of an analytical writing-intensive course or courses in the social sciences, humanities, or sciences. The course(s) must have been completed within the past 5 years and with a grade of 3.0 or higher (on a 4.0 scale).\n    *   A scored analytical writing section of the GRE from a test taken within the past 5 years. A score of 4.5 or higher is required.\n    *   A 3-5 page analytical essay.\n    *   Completion of the MPA Program’s Public Policy and Governance (PP&G) course, taken through open enrollment within the past 5 years. A grade of 3.0 or higher is required.\n    *   For applicants with a graduate degree from a regionally-accredited college or university in the U.S. (or its equivalent in another country) may submit their Academic Statement of Purpose in lieu of the Analytical Writing Prerequisite.",
        "WritingSample": "Optional",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": true,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Public Policy",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    }
]