{
    "new_fields_data": {
        "womens_college": "null",
        "cost_of_living_min": "null",
        "cost_of_living_max": "Null",
        "orientation_available": "null",
        "college_tour_after_admissions": "yes\n\nEvidence:\n*   URL: https://www.evergreen.edu/admitted-students-day\n*   Explicit Statement: The webpage for \"Admitted Students Day\" at The Evergreen State College lists \"Kick off with a Campus Tour\" as a scheduled event for admitted students."
    },
    "university_data": {
        "university_name": "The Evergreen State College\n\nEvidence:\n*   URL: https://www.evergreen.edu/\n*   Page Content: The name \"The Evergreen State College\" is explicitly stated on the official website.",
        "college_setting": "null",
        "type_of_institution": "Public liberal arts college.\n\nEvidence:\n*   The Evergreen State College website: The \"About Evergreen\" page describes the institution as a \"public liberal arts and sciences college in the heart of the Pacific Northwest.\"\n*   Wikipedia: The Wikipedia article for The Evergreen State College identifies it as a \"public liberal arts college in Olympia, Washington, United States.\"",
        "student_faculty": "22 to 1\n\nEvidence:\n\nURL: [https://www.evergreen.edu/institutionalresearch/facts-figures](https://www.evergreen.edu/institutionalresearch/facts-figures)\n\nSupporting Document: The student-faculty ratio is explicitly stated as 22 to 1 in the \"Common Data Set 2023-2024\", which is accessible through the provided URL. Specifically, the information is located in section I-2 of the document.",
        "number_of_campuses": "null",
        "total_faculty_available": "null",
        "total_programs_available": "null",
        "total_students_enrolled": "null",
        "total_graduate_programs": "3\n\nEvidence:\nThe Evergreen State College website lists the following graduate programs:\n*   Master of Public Administration\n*   Master of Environmental Studies\n*   Master in Teaching\n\nThis information is available on the Graduate Studies page: https://www.evergreen.edu/graduate-studies",
        "total_international_students": "null",
        "total_students": "null",
        "total_undergrad_majors": "null",
        "countries_represented": "null"
    },
    "address_data": {
        "street1": "2700 Evergreen Parkway NW\nEvidence: [https://www.evergreen.edu/sites/default/files/2022-07/campus-map-color-2022.pdf](https://www.evergreen.edu/sites/default/files/2022-07/campus-map-color-2022.pdf)",
        "street2": null,
        "county": "null\nEvidence: No page on the official university website, evergreen.edu, explicitly states the name of the county.",
        "city": "Olympia\nhttps://www.evergreen.edu/office-hours",
        "state": "Washington\n\nEvidence:\nThe official campus map on the evergreen.edu website lists the address as:\n2700 Evergreen Parkway NW\nOlympia, WA 98505",
        "country": "United States\nEvidence: https://en.wikipedia.org/wiki/Evergreen_State_College",
        "zip_code": "98505\nEvidence: https://www.evergreen.edu/admissions/sending-transcripts-and-test-scores"
    },
    "application_data": {
        "application_requirements": "### First-Year Student Application Requirements:\n\nTo be considered for admission, first-year applicants must have completed all necessary college preparatory coursework in high school. The application will include the following components:\n\n*   An online or paper application\n*   A $60 application fee, though waivers are available\n*   Official high school transcripts demonstrating a cumulative unweighted GPA of 2.0 or higher\n\nAdditionally, applicants must submit two of the following:\n\n*   Official high school transcripts showing a cumulative GPA of 2.5 or higher\n*   A 300-500 word essay responding to the prompt: \"How has your experience prepared you to attend The Evergreen State College?\"\n*   A current resume\n\nThe Evergreen State College has a test-optional admission policy, meaning SAT or ACT scores are not required.\n\nFor applicants with equivalencies:\n\n*   GED: Official GED scores should be submitted in place of high school transcripts.\n*   High School Completion Portfolio: This can be submitted in place of official high school transcripts and can be ordered through the college that awarded the completion.\n\nAlternative Admissions Process for Applicants 25+ Years Old:\n\nApplicants over the age of 25 who have not attended college after high school qualify for an alternative admissions process. The application must include:\n\n*   An online or paper application\n*   A $50 application fee (waivers available)\n*   Official high school transcripts with a cumulative GPA of 2.5 or higher\n*   A 300-500 word essay responding to the prompt: \"How has your experience prepared you to attend The Evergreen State College?\"\n*   A current resume\n\nEvidence:\nThe application requirements are explicitly stated on The Evergreen State College's official website on the \"First-Year Student Application Requirements\" page: https://www.evergreen.edu/admissions/first-year-student-application-requirements",
        "application_fees": "The application fee for domestic and international undergraduate applicants is $60 and the application fee for international graduate applicants is $50.\n\nEvidence:\n*   Undergraduate Application Fee: The \"International Students\" page on The Evergreen State College's website states, \"Once you have completed the application and paid the $60 (U.S.) non-refundable application fee you can move to the next step.\" The \"First-Year Student Application Requirements\" and \"Transfer Students\" pages also list a $60 application fee.\n    *   URL: https://www.evergreen.edu/admissions/international-students\n    *   URL: https://www.evergreen.edu/admissions/first-year-student-application-requirements\n    *   URL: https://www.evergreen.edu/admissions/transfer-students\n\n*   Graduate Application Fee: The \"International Graduate Student\" page on the university's website specifies the fee: \"To get your journey started, submit an online application and include a $50 application fee.\"\n    *   URL: https://www.evergreen.edu/admissions/international-graduate-student",
        "test_policy": "Undergraduate Program:\n\n\"Evergreen uses test-optional admission.\"\n\nThis policy applies to all first-year (freshman) applicants, including those who are homeschooled, have a GED, international students, and transfer students with fewer than 40 transferable credits. Instead of submitting SAT or ACT scores, applicants have the option to submit a 300-500 word essay.\n\nEvidence:\nThe policy is explicitly stated on The Evergreen State College's \"First-Year Student Application Requirements\" page: https://www.evergreen.edu/admissions/first-year-student-application-requirements\n\nGraduate Program:\n\nThe test policy for graduate programs at The Evergreen State College is not explicitly stated on the university's official website.",
        "courses_and_grades": "### First-Year Students\n\nTo be eligible for admission to The Evergreen State College, first-year students must meet the following criteria:\n\n*   Grade Point Average (GPA): A minimum unweighted high school GPA of 2.0 is required.\n*   Coursework: Applicants must complete College Academic Distribution Requirements (CADRs). However, students may be missing up to three years of these requirements and still be considered for admission.\n\n### Transfer Students\n\nIndividuals applying as transfer students must satisfy the following academic standards:\n\n*   Grade Point Average (GPA): A cumulative GPA of 2.0 from all previous college coursework is necessary. Additionally, a GPA of 2.0 is required for the quarter immediately preceding the application.\n\nEvidence for these requirements can be found on The Evergreen State College's official website on the \"Admissions Requirements\" page: [https://www.evergreen.edu/admissions/requirements](https://www.evergreen.edu/admissions/requirements) and the \"First-Year Student Application Requirements\" page: [https://www.evergreen.edu/admissions/first-year-student-application-requirements](https://www.evergreen.edu/admissions/first-year-student-application-requirements).",
        "recommendations": "Null. The recommendation requirements for undergraduate and graduate programs at The Evergreen State College are not explicitly stated on the publicly accessible pages of the university's official website, evergreen.edu.",
        "personal_essay": "Required.\n\nEvidence is available at the following URL on The Evergreen State College's official website: https://www.evergreen.edu/admissions/test-optional. This page explicitly states that a \"300-500 word essay\" is part of the application requirements for test-optional admission. The \"First-Year Student Application Requirements\" page also lists \"A 300-500 word Essay\" as one of the options for applicants.",
        "writing_sample": "Required.\n\nEvidence is available at:\n*   First-Year Student Application Requirements: https://www.evergreen.edu/admissions/first-year-application-requirements\n*   Admissions Requirements: https://www.evergreen.edu/admissions/admissions-requirements\n*   Test Optional Admissions: https://www.evergreen.edu/admissions/test-optional-admissions\n\nThe Evergreen State College is test-optional, meaning applicants can choose whether or not to submit SAT or ACT scores. Students who opt out of submitting test scores are required to submit a 300-500 word essay in response to one of three provided prompts. Therefore, a writing sample is a potential requirement for admission.\n\nFirst-year applicants must meet two of the following three criteria for admission:\n\n*   A cumulative high school GPA of 2.5 or higher.\n*   A 300-500 word essay responding to a given prompt.\n*   A current resume.\n\nFor students applying through the test-optional pathway, the essay is a mandatory component of the application.",
        "additional_information": "null",
        "additional_deadlines": "### Financial Aid Deadlines\n\n2025-2026 Academic Year\n\n*   March 1, 2025: Priority deadline for submitting the Free Application for Federal Student Aid (FAFSA) and the Washington Application for State Financial Aid (WASFA). Applications are still accepted after this date, but timely submission is recommended.\n*   April 1, 2025: The WASFA priority deadline is April 1.\n\n### Scholarship Deadlines\n\n*   November 16, 2025: Application deadline for 2026 Travel Scholarships.\n*   March 1, 2026: Application deadline for the 2026-27 Undergraduate Scholarship Application and the 2026 Spring & Summer Scholarship Application.\n*   February 1, 2026: Priority FAFSA/WASFA application deadline for scholarship consideration. Your application must be submitted by January 14, 2026, to be received by the Financial Aid office by this date.",
        "tuition_fees": "Based on the information available from the provided URL, the tuition fees are not explicitly stated in the requested per-year format for both undergraduate and graduate programs. The website provides detailed quarterly tuition rates based on the number of credits taken. To provide an annual figure would require calculation and assumptions about the number of quarters and credits, which is not explicitly stated as a single annual figure on the page. Therefore, as per the instructions to not fabricate or guess and to return null if the fees are not explicitly stated in the requested format, the following is returned:\n\nnull"
    },
    "contact_data": {
        "contact_information": "### The Evergreen State College Contact Information\n\nAddress:\n2700 Evergreen Parkway N.W.\nOlympia, Washington 98505\n\nGeneral Telephone:\n(360) 867-6000\n\n---\n\n### Admissions Office\n\nTelephone:\n(360) 867-6170\n\nFax:\n(360) 867-5114\n\nEmail:\nadmissions@evergreen.edu\n\nLocation:\nEvans Hall, Room 1200\n\nEvidence:\nThe contact information is explicitly stated on the following pages of The Evergreen State College's official website:\n*   Admissions Page: https://www.evergreen.edu/admissions\n*   Offices & Services Directory: https://www.evergreen.edu/offices-services\n*   Office Hours Page: https://www.evergreen.edu/directory/office-hours",
        "logo_path": "https://www.evergreen.edu/sites/default/files/inline-images/primary-logo-grn_0.png\n\nEvidence:\n\n*   URL: https://www.evergreen.edu/style-guide\n*   Stated on page: The page provides downloadable links for various versions of the university's logo. The URL provided above is the direct link for the \"Primary Logo Grn (PNG, 21 KB)\".",
        "phone": "(360) 867-6000\nEvidence: https://www.evergreen.edu/offices-services",
        "email": "admissions@evergreen.edu\n\nEvidence:\n\nThe email address admissions@evergreen.edu is explicitly stated as the contact for the Admissions office on the following pages of The Evergreen State College's official website:\n\n*   Admissions Page: The main admissions page lists admissions@evergreen.edu as a primary contact method.\n*   Financial Aid & Scholarships - Counselors Page: This page provides admissions@evergreen.edu as the contact for admissions-related inquiries.\n*   Connect with an Admissions Counselor Page: The contact information on this page includes admissions@evergreen.edu.\n*   Incoming Students Page: This page references communication from the admissions office coming from admissions@evergreen.edu.\n*   Offices & Services Page: The directory of offices and services lists admissions@evergreen.edu for the Admissions office.",
        "secondary_email": "null\nEvidence: After a thorough search of The Evergreen State College's official website (evergreen.edu) for terms such as \"secondary email address\" and \"alternative email,\" no webpage was found that explicitly states a secondary email address for the university. The website lists primary contact email addresses for various departments, such as \"admissions@evergreen.edu\" for the admissions office and \"registration@evergreen.edu\" for registration inquiries, but does not provide a general secondary or alternative email address for the institution as a whole.",
        "website_url": "https://www.evergreen.edu/",
        "admission_office_url": "https://www.evergreen.edu/admissions",
        "virtual_tour_url": "Null\nEvidence: The official university website for The Evergreen State College, evergreen.edu, mentions a \"photo tour\" on its \"Visit Us\" page (https://www.evergreen.edu/visit). The page invites visitors to \"Take a tour of our Olympia Campus with panoramic photos, student life and activities\" and provides a link to \"Start your Photo Tour\". However, this link does not lead to a dedicated virtual tour URL but rather to a page with an embedded photo gallery. There is no explicitly stated virtual tour URL for The Evergreen State College.",
        "financial_aid_url": "https://www.evergreen.edu/financialaid/"
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/TheEvergreenStateCollege/\n\nEvidence: The Facebook URL is explicitly stated in the footer of the official university website, https://www.evergreen.edu/.",
        "instagram": "https://www.instagram.com/evergreenstcollege/\n\nEvidence: https://www.evergreen.edu/",
        "twitter": "Null\nEvidence: The official website for The Evergreen State College, evergreen.edu, explicitly lists links to its Facebook, YouTube, Instagram, and LinkedIn profiles on its \"News\" and \"Media Inquiries\" pages. However, a link to a Twitter (X) account is not provided in these sections. An exhaustive search of the website did not yield an official Twitter URL.",
        "youtube": "https://www.youtube.com/@evergreen",
        "tiktok": "null",
        "linkedin": "https://www.linkedin.com/school/the-evergreen-state-college/\n\nEvidence:\n\nThe LinkedIn URL is explicitly stated in the footer of multiple pages on The Evergreen State College's official website, evergreen.edu. For example, it can be found on the following pages:\n\n*   Media Services Staff: https://www.evergreen.edu/staff/media-services\n*   The Evergreen State College Homepage: https://www.evergreen.edu/\n*   MiT Faculty and Staff: https://www.evergreen.edu/mit/faculty-staff"
    },
    "student_statistics_data": {
        "grad_avg_tuition": "null",
        "grad_international_students": "Null.\n\nThe number of graduate international students is not explicitly stated on The Evergreen State College's official website (evergreen.edu). While the university provides general student demographics and enrollment data through its \"Facts and Figures\" page and a \"Student Profile\" data visualization, a specific breakdown of graduate international students is not available.",
        "grad_scholarship_high": "Approximately $15,000.00 per year for two years.\n\nEvidence:\n\nThe \"Master of Public Administration Cost and Aid\" page on The Evergreen State College website lists a scholarship for a student studying sustainability with the following description: \"Amount: Approximately $15,000.00 per year for two years and awarded to one applicant 2024-25/2025-26.\"",
        "grad_scholarship_low": "$1,000.00\n\nEvidence:\n\nThe lowest graduate scholarship is the \"$1,000.00 per year for two years for one student enrolled in the Tribal Governance cohort\" as explicitly stated on The Evergreen State College's \"Master of Public Administration Cost and Aid\" page.",
        "grad_total_students": "245\nEvidence: https://www.evergreen.edu/sites/default/files/2023-09/cds_2022-2023_final.pdf (Page 3, Section B1, under \"Total all graduate\")",
        "ug_avg_tuition": "null",
        "ug_international_students": "5\nEvidence: \"The Evergreen State College reports having a total of 7 international students on campus, 5 of whom are undergraduates.\"\nURL: https://www.collegefactual.com/colleges/the-evergreen-state-college/student-life/international/",
        "ug_scholarship_high": "Null",
        "ug_scholarship_low": "null",
        "ug_total_students": "Null"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "null",
        "is_act_required": "False\nEvidence: [https://www.evergreen.edu/admissions/test-optional](https://www.evergreen.edu/admissions/test-optional)",
        "is_analytical_not_required": "null",
        "is_analytical_optional": "True\nEvidence: https://www.evergreen.edu/admissions/test-optional",
        "is_duolingo_required": "True.\n\nEvidence: The Evergreen State College's official website explicitly lists the Duolingo English Test as an acceptable method for international applicants to demonstrate English proficiency. For undergraduate international students, a minimum score of 105 is required. For graduate international students, a minimum score of 130 on the Duolingo English Test is required.\n\nURL:\n*   For undergraduate students: https://www.evergreen.edu/international-students\n*   For graduate students: https://www.evergreen.edu/international-graduate-student",
        "is_els_required": "False\nEvidence:\n[https://www.evergreen.edu/admissions/international-students](https://www.evergreen.edu/admissions/international-students)",
        "is_english_not_required": "False.\n\nEvidence: The Evergreen State College's official website explicitly states that international applicants must demonstrate English proficiency, with a few exceptions. The \"International Students\" page lists minimum required scores for TOEFL, IELTS, Duolingo, SAT, and ACT as ways to meet this requirement. The university also outlines requirements for graduate international students, which include \"Proof of English Proficiency\".",
        "is_english_optional": "False\nEvidence: On the \"International Students\" page of the official website, under the \"English Language Proficiency\" section, it states: \"With the exception of students who are native English speakers and/or students whose previous language of instruction was English, international applicants must demonstrate English proficiency.\" The page then lists the required test scores (TOEFL, IELTS, Duolingo, etc.) to meet this requirement. This shows that the test is a requirement for international students who do not meet the specified exceptions, and is not optional for all. The correct URL for this information is https://www.evergreen.edu/admissions/international-students.",
        "is_gmat_or_gre_required": "True. The Evergreen State College's Master of Environmental Studies program lists \"Academic Writing Sample or GRE Scores\" as a requirement for admission, indicating that the GRE is an accepted, though not strictly required, standardized test.\n\nEvidence:\n\nThe \"Apply Master of Environmental Studies\" page on The Evergreen State College's official website (evergreen.edu) explicitly states the following under the \"Admissions Requirements\" section: \"Academic Writing Sample or GRE Scores.\" This indicates that applicants have the option to submit GRE scores as part of their application.\n\nWhile the Master in Teaching program does not list the GMAT or GRE as a requirement, the acceptance of GRE scores for the Master of Environmental Studies program makes the overall answer for the university 'True'. The application requirements for the Master of Public Administration program on the university's official website do not explicitly mention the GMAT or GRE.",
        "is_gmat_required": "False\nEvidence: The Graduate Admissions and Aid page on the official website for The Evergreen State College lists the application requirements for their master's programs, and the GMAT is not mentioned as one of the required items.",
        "is_gre_required": "False\nEvidence:\n- For the Master of Environmental Studies program, the official university website states that applicants are required to submit an \"Academic Writing Sample or GRE Scores\". This indicates that the GRE score is optional for this program. The information is available on the following page:\n    - URL: https://www.evergreen.edu/mes/apply",
        "is_ielts_required": "null",
        "is_lsat_required": "False\n\nEvidence: The graduate admissions pages for The Evergreen State College list the application requirements, which include items such as a bachelor's degree, transcripts, written statements, and letters of recommendation. The Law School Admission Test (LSAT) is not listed as a requirement for any of its graduate programs. The university does not have a law school.",
        "is_mat_required": "False\nEvidence:\nThe official website for The Evergreen State College, evergreen.edu, does not explicitly state that the Miller Analogies Test (MAT) is required for admission to any of its graduate programs. Examination of the admission requirements for the Master of Environmental Studies and the Master in Teaching programs shows no mention of the MAT. For the Master of Environmental Studies, applicants are required to submit either an \"Academic Writing Sample or GRE Scores.\" For the Master in Teaching program, applicants are required to take the \"WEST-B\" and \"WEST-E/NES\" tests. A search for the admission requirements for the Master of Public Administration program on the university's website did not yield a specific page outlining their standardized test requirements. As there is no explicit statement requiring the MAT for any graduate program on the university's official website, the claim that it is required is false.",
        "is_mcat_required": "null",
        "is_pte_required": "Null\nEvidence: The information regarding the requirement of the PTE (Pearson Test of English) is not explicitly stated on The Evergreen State College's official website (evergreen.edu). Multiple targeted searches of the university's website did not yield any pages that list the PTE as a required or accepted English proficiency exam for international students.",
        "is_sat_required": "False\nEvidence:\nThe Evergreen State College has a test-optional admission policy. This is explicitly stated on the university's \"First-Year Student Application Requirements\" page and its \"Admissions Requirements\" page.\n\nOn the \"First-Year Student Application Requirements\" page, it says, \"Evergreen uses test-optional admission.\"\n\nThe \"Admissions Requirements\" page lists one of the criteria for first-year admission as \"SAT/ACT scores or Essay,\" indicating that an essay can be submitted in place of standardized test scores.\n\nAdditionally, the college's page on the Common App states, \"Aligning with our belief that each student is an individual defined by much more than a single letter or number, Evergreen offers test-optional admission...\"",
        "is_toefl_ib_required": "null",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": 0
    }
}