[
    {
        "Concentration name": "Public & Nonprofit Administration, Public Policy, Tribal Governance",
        "description": "Our Master of Public Administration (MPA) program offers an interdisciplinary curriculum that responds to the changing needs of the public and nonprofit sectors. You’ll be prepared for leadership and management positions in public service, from small local nonprofits to large federal agencies. You’ll learn to engage in thoughtful inquiry and act in the public interest with compassion, competence, and commitment. You’ll learn: Critical thinking, writing, quantitative and qualitative analysis to support decision making and problem solving. Collaborative leadership in diverse organizations and communities. How to define public problems and opportunities, analyze policies, and manage programs with an equity lens. Ethical public service that is responsible, accountable, and dedicated to pursuing the public interest.",
        "program website url": "https://www.evergreen.edu/offices-services/master-of-public-administration-mpa",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Public Administration",
        "Program Page url": "https://www.evergreen.edu/offices-services/master-of-public-administration-mpa"
    },
    {
        "Concentration name": null,
        "description": "The Master of Environmental Studies (MES) is a two-year, interdisciplinary graduate degree that prepares you to work in a wide variety of environmental fields. You’ll learn to combine science, policy, and community action to understand and solve complex environmental problems. Our graduates are respected for their skills, confidence, and professionalism. The MES program started in 1984 and has an alumni network of over 1,000 working in environmental professions around the world. We offer a distinctive approach to graduate education based on our interdisciplinary curriculum, collaborative and interactive learning environment, and narrative evaluations instead of grades. You’ll become part of a close-knit and supportive community of learners as you explore the environmental challenges of the Pacific Northwest and the world.",
        "program website url": "https://www.evergreen.edu/mes",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Environmental Studies",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Concentration name": "K-8 Elementary Education, K-12 Special Education, K-12 Reading, English Language Learner",
        "description": "The Master in Teaching (MiT) Program at The Evergreen State College prepares and supports justice-oriented teachers for public schools. We support our teacher candidates in developing the knowledge, skills, and dispositions to bring Evergreen’s five foci to their own work in K-12 classrooms: collaborative, interdisciplinary, student-centered, hands-on, and community-based learning. We are a full-time, in-person, four-quarter cohort program that culminates in a Master in Teaching degree and a Washington State teaching certificate with endorsements in K-8 Elementary Education and/or K-12 Special Education. We also offer pathways to a K-12 Reading endorsement and an English Language Learner endorsement. While in our program, candidates are placed in a professional-track internship in a K-12 public school classroom throughout the school year. They have the opportunity to work alongside an experienced mentor teacher and to connect theory from their graduate coursework to the practice of teaching.",
        "program website url": "https://www.evergreen.edu/mit",
        "Accreditation status": "The Master in Teaching (MiT) program is approved by the Professional Educator Standards Board (PESB).",
        "Level": "Master",
        "Program name": "Master in Teaching",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Evergreen State College is excited to offer a new Master of Business Administration (MBA) in Sustainability. With classes set to begin in Fall 2022, students can expect to gain the necessary business skills and knowledge to lead and manage organizations in an ever-changing world with complex economic, social and environmental challenges.\n\nThe program will focus on strategic thinking, leadership, and collaboration through applied learning taught by a team of faculty who have business and organizational leadership experience. The program provides the business credentials students need to succeed in their careers while also making a positive impact on their communities and the world.\n\nEvergreen’s MBA program will allow students to graduate with the knowledge to manage finances and understand markets, build collaborative organizations, and have the skills to implement long-term goals for success in a sustainable and equitable manner.",
        "program website url": "https://www.evergreen.edu/catalog/programs/sustainability-master-business-administration-11000",
        "Accreditation status": "The MBA program is currently undergoing accreditation review. More information will be available soon.",
        "Level": "MBA",
        "Program name": "Sustainability Master of Business Administration",
        "Program Page url": "https://www.evergreen.edu/admissions-and-aid/graduate-student"
    },
    {
        "Concentration name": "Tribal Governance",
        "description": "The Tribal Governance concentration is the first of its kind in the nation. It is designed for students who are or intend to be managers or leaders in tribal governments or in organizations that work with tribal governments. The concentration addresses the history and legal status of American Indian tribes and the unique governance issues they face. The curriculum emphasizes tribal sovereignty, ethics, and values.",
        "program website url": "https://www.evergreen.edu/mpa",
        "Accreditation status": "Evergreen's MPA program is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA) Commission on Peer Review and Accreditation and listed on the annual roster of accredited programs in conformity with NASPAA standards.",
        "Level": "Masters",
        "Program name": "Concentration in Tribal Governance",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Concentration name": "Public & Nonprofit Administration",
        "description": "Our most flexible concentration, you will gain practical skills in public and nonprofit administration that can be applied in many organizational settings. Customize your learning by selecting the courses that will most benefit your career. You’ll be prepared for leadership positions in local, state, or federal government agencies; nonprofit organizations; or to become a consultant or lobbyist.",
        "program website url": "https://www.evergreen.edu/mpa",
        "Accreditation status": "The Evergreen State College is accredited by the Northwest Commission on Colleges and Universities. Evergreen’s Master of Public Administration program is a member of the Network of Schools of Public Policy, Affairs, and Administration (NASPAA). The MPA program has been granted initial accreditation by NASPAA through August 31, 2029.",
        "Level": "Master",
        "Program name": "Concentration in Public and Nonprofit Administration",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    },
    {
        "Concentration name": "Public Policy",
        "description": "Prepare for a career as a policy analyst or for policy advocacy. You'll gain a firm foundation in the policy process, including analysis, research, strategies, and implementation. Electives can be tailored to fit your policy area of interest.",
        "program website url": "https://www.evergreen.edu/mpa",
        "Accreditation status": "Evergreen's MPA program is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA).",
        "Level": "Master",
        "Program name": "Concentration in Public Policy",
        "Program Page url": "https://www.evergreen.edu/academics/graduate-studies"
    }
]