[
    {
        "Concentration name": null,
        "description": "The Master of Education in Art Education degree program is a 33-credit program for students who currently have a teaching certificate in art. It is designed to further develop artistic and creative talents, deepen knowledge of art history and criticism, investigate contemporary issues and trends in art education, and renew and invigorate the spirit of professionalism. The M.Ed. in Art Education is accredited by the National Association of Schools of Art and Design (NASAD).",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/department-of-art-and-design/graduate-art-education.html",
        "Accreditation status": "accredited by the National Association of Schools of Art and Design (NASAD)",
        "Level": "Master's",
        "Program name": "Master of Education in Art Education",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Art Education Certification program at Kutztown University is an intensive post-baccalaureate program designed for individuals who hold a bachelor’s degree in studio art and now wish to become certified to teach art in Pennsylvania’s public schools, grades pre-kindergarten to 12. Graduates of the program will meet all requirements for a Level I Teaching Certificate. KU's Art Education certification program consists of 33 credits, 27 in art education and 6 in student teaching. The Art Education Certification Program is designed for post-baccalaureate students who already hold a bachelor’s degree in studio art, from an accredited college or university, with a minimum of 40 studio credits. The program results in initial certification only. It does not culminate in a master’s degree. Students who wish to obtain a master’s degree in art education must apply for admission to that program.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/department-of-art-and-design/graduate-programs/art-education-certification.html",
        "Accreditation status": "Kutztown University is accredited by the Middle States Commission on Higher Education and the National Association of Schools of Art and Design (NASAD).",
        "Level": "Certification",
        "Program name": "Art Education (Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Fine Arts in Communication Design program at Kutztown University is a 60-credit degree designed to foster the individual voice and advance the skills of designers who wish to contribute to the global community in a meaningful way. Our nationally ranked MFA program is the only program of its kind in the Pennsylvania State System of Higher Education (PASSHE) and one of the largest graduate Communication Design programs in the country.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/department-of-art/communication-design/graduate-program.html",
        "Accreditation status": "The Master of Fine Arts in Communication Design is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Level": "MFA",
        "Program name": "Master of Fine Arts in Communication Design",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": "Thesis Track, Non-Thesis Track",
        "description": "The Master of Education in Music Education is a fully online program designed for the certified, practicing music educator. The purpose of this program is to expand the student's understanding and application of pedagogy, research, and philosophy in order to improve and inform their teaching in the P-12 music classroom. The Master of Education in Music Education offers a choice between two tracks, Thesis and Non-Thesis, and may be completed in two years. Courses are offered on a rotating cycle and taught by the accomplished and diverse music faculty in the Music Department.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/majors-minors-and-certificates/music/music-degrees/master-of-education-in-music-education.html",
        "Accreditation status": "Kutztown University is an accredited institutional member of the National Association of Schools of Music (NASM).",
        "Level": "Master of Education",
        "Program name": "Master of Education in Music Education",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/majors-minors-and-certificates/music/music-degrees/master-of-education-in-music-education.html"
    },
    {
        "Concentration name": null,
        "description": "The Music Education Certification Program at Kutztown University provides an opportunity for individuals who hold an undergraduate degree in music to complete the coursework required to be recommended for Pennsylvania teacher certification in music. The program is specifically designed to meet the needs of each individual student and can include undergraduate prerequisite courses and deficiencies in addition to the professional education sequence of courses. An initial review of the student's undergraduate transcript will determine the required music and education coursework to be completed for certification.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/departments/music/graduate-programs/music-education-certification.html",
        "Accreditation status": "Kutztown University is an accredited institutional member of the National Association of Schools of Music (NASM).",
        "Level": "Certification",
        "Program name": "Music Education (Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": "General, Supply Chain Management and Logistics, Health Care Management, Leadership, Finance, Business Analytics, Marketing",
        "description": "The Kutztown University Master of Business Administration program provides students with a high-quality graduate business education. Our comprehensive curriculum is designed to give students the theoretical background and practical skills needed for success in today's competitive global business environment. Students in the program develop skills in problem-solving, strategic thinking, and managing people and resources. Courses are taught by a distinguished faculty that are experts in their fields and are also dedicated teachers. Our students represent a diverse mixture of business professionals and managers, recent college graduates, and people seeking a career change. Because of this, the Kutztown MBA curriculum is designed with flexibility in mind. Courses are scheduled in the evening to accommodate our many working students. We also offer a 100% online MBA program. In addition to a general MBA, we offer a variety of in-demand academic tracks and certificate programs.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/business/master-of-business-administration-(mba).html",
        "Accreditation status": "Kutztown University's College of Business is an accredited member of AACSB International, which represents the highest standard of achievement for business schools worldwide. Less than 5% of the world's 13,000 business programs have earned AACSB Accreditation. This distinction is the hallmark of excellence in business education.",
        "Program name": "Master of Business Administration (MBA)",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/business/master-of-business-administration-(mba).html"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Business Decision-Making is designed for individuals who have already earned an undergraduate degree and wish to continue their education at the graduate level to make more effective and efficient data-driven business decisions. Decision-making is a critical skill for any business leader. The curriculum provides a strong foundation in core analytical and quantitative business concepts to allow a leader to use business information and data for more effective decisions. This certificate is ideal for those who are looking to advance in their career or who are considering a graduate degree in business. This 12-credit certificate can be a stand-alone credential or it can be a pathway to the Kutztown University MBA program. Students who successfully complete the graduate certificate with a GPA of 3.0 or higher are eligible to have their GMAT/GRE requirement waived for admission into the Kutztown MBA program. All credits earned in the certificate program can be applied to the KU MBA.",
        "program website url": "https://www.kutztown.edu/decisionmakingcertificate",
        "Accreditation status": "The College of Business at Kutztown University is accredited by AACSB International, The Association to Advance Collegiate Schools of Business. This accreditation represents the highest standard of achievement for business schools worldwide.",
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Business Decision-Making",
        "Program Page url": "https://www.kutztown.edu/decisionmakingcertificate"
    },
    {
        "Concentration name": [
            "Thesis Track",
            "Project Track"
        ],
        "description": "The Master of Science degree in Computer Science is designed for students who have a bachelor's degree in computer science or a related field. The program is specifically designed to expand the students' knowledge and expertise in the field of computer science and information technology. The graduate program includes advanced topics in software engineering, database management, high-performance computing, data analytics, and machine learning. In this program, students will learn advanced topics in computer science and also get a hands-on experience by completing a final project/thesis.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/computer-science-and-information-technology/graduate-programs/computer-science---ms.html",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Computer Science",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The MBA Data Analytics Certificate is for business professionals who seek to enhance their managerial and decision-making skillsets through data analysis. It covers topics such as regression, data mining, text mining, forecasting, and visualization in a business context. Students will acquire hands-on experience by applying these techniques to business problems, using popular software packages such as Excel, Tableau, and SAS Viya. All courses are applicable toward a KU MBA degree. Students can complete this certificate in addition to an MBA degree from KU or from another AACSB accredited business school. Students who complete the certificate can waive the GMAT requirement to join the KU MBA program.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/business/graduate-programs/mba/data-analytics-certificate.html",
        "Accreditation status": "The College of Business at Kutztown University is an accredited member of AACSB International.",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Data Analytics (MBA)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Kutztown University Graduate Certificate in Leadership program provides students the opportunity to gain relevant leadership skills and knowledge from MBA-level coursework. These courses are designed to give students practical tools to effectively lead, motivate and communicate in a dynamic and diverse workforce. The courses taken for this certificate may be applied to the Kutztown University MBA program.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/business/graduate-programs/leadership-certificate.html",
        "Accreditation status": "The College of Business is accredited by AACSB International, a benchmark for business school quality. Less than 5% of the world's 13,000 business programs have earned AACSB Accreditation.",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Leadership (MBA)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": [
            "Nonprofit Administration",
            "Public Management"
        ],
        "description": "The Master of Public Administration (MPA) program at Kutztown University prepares students for careers as leaders and managers in the public and nonprofit sectors. Our graduates are equipped with knowledge of the values and ethics of public service and skills in policy analysis, program evaluation, budgeting and human resource management. The 36-credit hour MPA program combines a core curriculum in public administration with career-track specializations. Courses are offered in a flexible format, using a combination of in-person, hybrid and online classes to meet the needs of our diverse student population. Classes are taught by full-time faculty who hold doctoral degrees in public administration or a related field and have professional experience at all levels of government and nonprofit management.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/political-science-and-public-administration/graduate-program.html",
        "Accreditation status": "Kutztown University's Master of Public Administration (MPA) program is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA) Commission on Peer Review and Accreditation and is listed on the Annual Roster of Accredited Programs in conformity with NASPAA standards. NASPAA is the recognized global accreditor of master's degree programs in public administration, public policy, public affairs, and nonprofit and related fields.",
        "Level": "Master's",
        "Program name": "Master of Public Administration (MPA)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": [
            "Student Affairs Practice",
            "College Student Development and Services"
        ],
        "description": "The Master of Education in Student Affairs in Higher Education is designed to prepare students for a variety of student affairs positions in a college or university setting. The curriculum emphasizes the integration of theory and practice to prepare graduates for entry and mid-level student affairs positions. The program consists of 36 credit hours, which includes an internship experience. This program also fulfills the educational requirements for students to pursue licensure as professional counselors in Pennsylvania and other states. Our program is unique in its flexibility. We offer a variety of course formats, including in-person, hybrid, and fully online, to best meet student needs. Students who are currently working full time in a student affairs setting may choose to complete a 36-credit curriculum that does not include the internship. This non-internship track of the Student Affairs in Higher Education program provides those already working in the field with the knowledge and skills necessary to enhance their professional competence as well as the opportunity for advancement to more responsible positions.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/counseling-and-student-affairs/graduate-programs/student-affairs-in-higher-education.html",
        "Accreditation status": "The Student Affairs in Higher Education program at Kutztown University is consistent with the standards established by the Council for the Advancement of Standards in Higher Education (CAS).",
        "Level": "Master's",
        "Program name": "Master of Education in Student Affairs in Higher Education",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Master of Arts in Addiction Counseling",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/counselor-education-and-student-affairs/student-handbook.html"
    },
    {
        "Concentration name": null,
        "description": "Kutztown University’s Master of Arts in Clinical Mental Health Counseling program prepares students for employment as master’s level counselors in a variety of mental health settings. Graduates are prepared to practice in community agencies, hospitals, college counseling centers, and other settings where counseling services are offered. The program is designed to fulfill the academic requirements for the Licensed Professional Counselor (LPC) in Pennsylvania. Students learn to provide comprehensive counseling services to clients from a diverse population. The program has a strong focus on professional and personal growth.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/counseling-and-student-affairs/graduate-programs/ma-in-clinical-mental-health-counseling.html",
        "Accreditation status": "The Clinical Mental Health Counseling program is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Clinical Mental Health Counseling",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "Kutztown University’s Master of Arts in Marriage, Couple and Family Counseling program prepares students to work with individuals, couples, and families on a wide variety of clinical concerns. The 60-credit hour program fulfills the educational requirements for students to become Licensed Professional Counselors (LPC) in Pennsylvania and most other states, as well as providing the necessary coursework to pursue licensure as a Marriage and Family Therapist (LMFT) in Pennsylvania and most other states. The curriculum is designed to help students develop the awareness, knowledge, and skills necessary to become culturally competent counselors. In addition to core coursework, students complete a 100-hour practicum and a 600-hour internship experience. The Marriage, Couple and Family Counseling program is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/counseling-and-student-affairs/graduate-programs/marriage-couple-and-family-counseling.html",
        "Accreditation status": "The Marriage, Couple and Family Counseling program is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "Program name": "Master of Arts in Marriage, Couple and Family Counseling",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in School Counseling program at Kutztown University is a 60-credit program that is designed to prepare highly qualified professional school counselors to work in K-12 school settings. This program emphasizes a developmental, proactive, and preventative approach. Graduates are prepared to perform a wide range of services including individual and group counseling, classroom guidance, consultation, and coordination of services. Our graduates help children and adolescents with their academic, social, emotional, and career development needs. In addition, graduates are qualified to work towards licensure as a professional counselor (LPC) in Pennsylvania and most other states.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/counselor-education-and-student-affairs/counseling-programs/master-of-science-in-school-counseling.html",
        "Accreditation status": "Kutztown University is accredited by the Middle States Commission on Higher Education, 3624 Market Street, Philadelphia, PA 19104 (267-284-5000). Additionally, the M.S. in School Counseling program is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "Program name": "Master of Science in School Counseling",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/counselor-education-and-student-affairs/counseling-programs/master-of-science-in-school-counseling.html"
    },
    {
        "Concentration name": null,
        "description": "Kutztown University's 12-credit program for the Autism Spectrum Disorders (ASD) Endorsement Certificate is designed for Pennsylvania certified educators. This endorsement may be added to an existing Level I or Level II certificate.\n\nThis non-degree graduate program prepares candidates with the knowledge and skills necessary to become effective teachers of students with autism. Candidates will learn how to:\n- use evidence-based practices to teach students with autism,\n- understand the characteristics of students with autism,\n- create individualized programs for students with autism,\n- perform assessments, and\n- collaborate with families and other school personnel.\n\nThe program is approved by the Pennsylvania Department of Education (PDE) and is offered fully online. Candidates have up to six years to complete the four required courses. Upon completion, they can apply to the PDE for the endorsement to be added to their teaching certificates.\n\nThe KU ASD Endorsement curriculum is aligned with the Council for Exceptional Children (CEC) and the PA Department of Education (PDE) standards for the preparation of special education professionals. As part of this program, candidates learn about research in the field of ASD, best practices for instruction of students with autism, and methods for making data-based decisions in the classroom. Emphasis is placed on candidates' abilities to understand students' rights and advocate for effective educational practices.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/special-education/programs/autism-endorsement.html",
        "Accreditation status": "The program is approved by the Pennsylvania Department of Education (PDE).",
        "Level": "Endorsement Certification",
        "Program name": "Autism (Endorsement Certification)",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/special-education/programs/autism-endorsement.html"
    },
    {
        "Concentration name": null,
        "description": "Kutztown University's Curriculum and Instruction Supervisory Certificate program prepares candidates to serve as supervisors of curriculum and instruction in Pennsylvania's schools. The primary goal of the program is to provide students with the ability to work with teachers, administrators, and the community to improve educational programs for all students. The program is designed to create reflective supervisors who can provide curriculum leadership to schools. The Curriculum and Instruction supervisory program is a 21-credit program that may be used toward Act 48 requirements. Upon completion of this program, students may apply to the Pennsylvania Department of Education for a Curriculum and Instruction Supervisory Certificate.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/secondary-education/graduate-programs/supervisory-certification-curriculum-and-instruction.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Curriculum and Instruction (Supervisory Certificate)",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/secondary-education/graduate-programs/supervisory-certification-curriculum-and-instruction.html"
    },
    {
        "Concentration name": null,
        "description": "The English as a Second Language (ESL) Program Specialist Certificate is a post-baccalaureate teacher certification program. Teachers who currently hold a Level I or Level II teaching certificate in any area are eligible for this program. This program is specifically designed to meet the needs of certified teachers who wish to work with English Language Learners (ELLs) in their classrooms. Kutztown University's ESL Program Specialist Certificate is approved by the Pennsylvania Department of Education (PDE) and is designed for teachers who wish to add the ESL Program Specialist certificate to an existing Instructional I or II certificate. This 18-credit certification program addresses the five domains of the PDE ESL Program Specialist standards.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/department-of-secondary-education/english-as-a-second-language-(certification).html",
        "Accreditation status": "Approved by the Pennsylvania Department of Education (PDE).",
        "Level": "Certification",
        "Program name": "English as a Second Language (Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "This 18-credit program prepares certified teachers to serve as instructional coaches in K-12 school settings. The instructional coach endorsement can be added to an existing Level I or Level II Pennsylvania teaching certificate. All of the courses in the program can be taken online.",
        "program website url": null,
        "Accreditation status": null,
        "Level": "Endorsement Certificate",
        "Program name": "Instructional Coach (Endorsement Certificate)",
        "Program Page url": "https://prps.org/files/download/documents/Kutztown%20University.pdf"
    },
    {
        "Concentration name": null,
        "description": "The M.Ed. in Instructional Technology program is a 30-credit, fully online program that will prepare professionals in a variety of fields to design, develop, and integrate technology to enhance learning and performance. The program supports individuals working in Pre K-12 education, higher education, and corporate/non-profit settings. Students in this program will learn how to: create effective, engaging, and accessible technology-based instruction; assess learning outcomes; develop innovative solutions for learning and performance problems; and manage instructional design and technology projects.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/department-of-secondary-education/med-in-instructional-technology.html",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Education in Instructional Technology",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Instructional Technology Specialist Certification Program is designed to prepare students to be leaders in the field of instructional technology. This program addresses the state and national standards for instructional technology specialists and prepares certified teachers to provide leadership and coordination for improving teaching and learning in P-12 schools through the effective use of technology. The program provides a broad background of knowledge, skills and tools that are essential to integrating educational technology resources into the P-12 environment.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/departments/secondary-education/instructional-technology-specialist-certification.html",
        "Accreditation status": null,
        "Level": "Certification",
        "Program name": "Instructional Technology Specialist (Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": [
            "School Library Concentration",
            "Public/Academic/Special Library Concentration"
        ],
        "description": "The Master of Library Science (MLS) program prepares graduates for professional positions in school, public, academic, and special libraries. The program is offered entirely online. Our graduates lead in the field and are shaping the library of the 21st century. The Master of Library Science (MLS) program at Kutztown University is a 36-credit online program for individuals who wish to work in professional positions in school, public, academic, and special libraries. Concentrations are available for students who wish to specialize their studies. Courses are offered online both synchronously and asynchronously.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/library-and-learning-technologies/graduate-programs/library-science.html",
        "Accreditation status": "The Master of Library Science program at Kutztown University is accredited by the American Library Association Committee on Accreditation, with the status of Continued accreditation. The next comprehensive review visit is scheduled for Fall 2028.",
        "Program name": "Master of Library Science (MLS)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": "Initial Certification in Library Science, Extension of Certification in Library Science",
        "description": "This is an online program that allows students to choose one of two options: A) Initial Certification in Library Science for students who hold a teaching certificate in another content area and wish to pursue a career as a school librarian. B) Extension of Certification in Library Science for students who hold an initial certification in another content area and an Instructional Technology Specialist certificate and wish to pursue a career as a school librarian. Both options require a 36-credit program of study. In addition to coursework, candidates seeking initial or extension of certification must meet all PDE requirements including passing the Library Science Praxis exam. Candidates in both options can choose to add the KU online endorsement in Online Teaching for an additional 6 credits.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/elementary-middle-level-library-and-technologies-education/library-science-programs.html",
        "Accreditation status": "The MS in Library Science program is accredited by the American Library Association (ALA). The College of Education holds accreditation from the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master",
        "Program name": "Master of Library Science (MLS) plus Initial Certification or Extension of Certification",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/elementary-middle-level-library-and-technologies-education/library-science-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The 30-credit Master of Education in Multicultural Education program at Kutztown University is designed to prepare educators and other professionals to be leaders and advocates for social justice in a variety of school and community settings. Students in this program will learn to:\nExamine historical and sociopolitical relationships between marginalized groups and dominant societal institutions, such as education, government, etc.\nCritically analyze their own identity development and cultural positionalities\nAcquire knowledge of diverse cultural groups\nDevelop a critical consciousness through which they may develop and apply an equity pedagogy and become advocates for social justice for diverse groups in their schools and communities.\nThis program does not provide teacher certification.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/department-of-secondary-education/med-in-multicultural-education.html",
        "Accreditation status": null,
        "Level": "Master of Education",
        "Program name": "Master of Education in Multicultural Education",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The PreK-12 Principal Certification at Kutztown University prepares candidates to become transformational leaders in 21st-century schools. Our program leads to Pennsylvania Level I Certification as a PreK-12 Principal. The program is designed to meet the academic requirements for the principal certification as set by the Pennsylvania Department of Education (PDE). It follows a cohort model that allows you to work with a dedicated group of students and instructors throughout your program. You'll work with an experienced advisor to plan a program that fits your academic and career goals. KU's PreK-12 Principal Certification is recognized by PDE as a graduate-level program offered by a college of education that has National Council for the Accreditation of Teacher Education (NCATE)/Council for the Accreditation of Educator Preparation (CAEP) and Middle States Commission on Higher Education (MSCHE) accreditation.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/department-of-secondary-education/prek-12-principal-certification.html",
        "Accreditation status": "KU's PreK-12 Principal Certification is recognized by PDE as a graduate-level program offered by a college of education that has National Council for the Accreditation of Teacher Education (NCATE)/Council for the Accreditation of Educator Preparation (CAEP) and Middle States Commission on Higher Education (MSCHE) accreditation.",
        "Level": "Certification",
        "Program name": "PreK-12 Principal (Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Education in Reading is a 33-credit program designed to prepare certified teachers to work as reading specialists, literacy coaches, and/or supervisors of reading. The program prepares graduates to work with K-12 students who have difficulties with reading and writing and to work with other teachers to improve reading and writing instruction. It has a strong clinical component that provides graduate students with opportunities for practical application of assessment and instructional strategies. The program's content is aligned with the standards of the International Literacy Association, the International Dyslexia Association and the PA Department of Education. Our program is nationally recognized by the International Literacy Association.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/secondary-education/med-in-reading-specialist.html",
        "Accreditation status": "Our program is nationally recognized by the International Literacy Association.",
        "Level": "Master's",
        "Program name": "Master of Education in Reading Specialist",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Reading Specialist Certification program at Kutztown University is a 24-credit program designed for candidates who have a master's degree and a valid PA teaching certificate. This program leads to an additional certification for educators to support literacy instruction in a variety of school settings. After passing the required Praxis Exam, candidates in this program who have at least two years of successful teaching experience are eligible for certification. Upon completion of the program, students will be able to: Demonstrate knowledge of the foundations of reading and writing processes and instruction. Demonstrate the ability to use a wide range of instructional practices, approaches and methods, including technology, for learners at all levels. Demonstrate the ability to use a variety of assessment tools and practices to plan and evaluate effective reading and writing instruction. Demonstrate the ability to create a literate environment that fosters reading and writing by integrating foundational knowledge, instructional practices, and assessments. Demonstrate the ability to view professional learning and leadership as a career-long effort and responsibility.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/departments/secondary-education/graduate-programs/reading-specialist-certification.html",
        "Accreditation status": "Our program is also accredited by the International Dyslexia Association (IDA).",
        "Level": "Certification",
        "Program name": "Reading Specialist (Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": [
            "Biology",
            "Chemistry",
            "Communication/English",
            "Curriculum and Instruction",
            "English",
            "Earth and Space Science",
            "History",
            "Mathematics",
            "Physics",
            "Social Studies",
            "Spanish"
        ],
        "description": "The Master of Education in Secondary Education degree at Kutztown University prepares already-certified teachers to become leaders in their schools and in the profession. The goal of the program is to develop teacher-leaders by expanding and deepening their content knowledge, their pedagogical skills, and their understanding of the social context of schooling. In consultation with a graduate advisor, candidates pursue one of several concentrations. They develop advanced skills in their specialty area and gain valuable experience designing and implementing a classroom-based research project.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/secondary-education/med-in-secondary-education.html",
        "Accreditation status": "The program is accredited by the Council for the Accreditation of Educator Preparation (CAEP) and the Middle States Commission on Higher Education.",
        "Level": "Master",
        "Program name": "Master of Education in Secondary Education",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": [
            "Art Education (PK-12)",
            "Biology (7-12)",
            "Chemistry (7-12)",
            "Communication Studies (7-12) - currently suspended",
            "Earth and Space Science (7-12)",
            "English (7-12)",
            "General Science (7-12)",
            "Mathematics (7-12)",
            "Modern Language (French or Spanish, PK-12)",
            "Physics (7-12)",
            "Social Studies (7-12)"
        ],
        "description": "The Master of Education in Secondary Education program is a 30-credit program designed to prepare candidates to meet Pennsylvania Department of Education requirements for Level II certification in Secondary Education. In addition to meeting the academic requirements, candidates for Level II Certification must have three years of successful teaching on a Level I certificate in their certification area and have completed a PDE-approved induction program.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/department-of-secondary-education/med-secondary-education.html",
        "Accreditation status": "Kutztown University's teacher education programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP) and are also approved by the Pennsylvania Department of Education (PDE).",
        "Level": "Master's",
        "Program name": "Secondary Education (M.Ed. plus Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "Kutztown University's Special Education Certification Program provides graduate students with the knowledge, skills, and values to effectively meet the complex challenges of teaching exceptional learners. Upon successful completion of the certification program and all Pennsylvania Department of Education (PDE) requirements, graduates are eligible for Pennsylvania's Special Education PK-12 certification. This program focuses on evidence-based instructional practices for teaching children and youth with disabilities. Candidates have the opportunity to work collaboratively with professionals in the fields of Special Education and Elementary Education. Candidate performance is evaluated through field-based experiences, instructional design and delivery, and research and theory application. Candidates are also evaluated through the development of a professional portfolio.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/department-of-special-education/graduate-programs/special-education-certification.html",
        "Accreditation status": "All certification programs at Kutztown University are accredited by the Pennsylvania Department of Education (PDE). In addition, the Special Education program is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Certification",
        "Program name": "Special Education (Certification)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "Kutztown University's Doctor of Education in Transformational Teaching and Learning is an innovative and flexible program designed to meet the needs of working professionals. Through our cohort model, you will have the opportunity to collaborate and build relationships with a professional learning community as you complete this 60 credit post-master's program. In the Ed.D. in Transformational Teaching and Learning, you will examine the complexities of teaching and learning in an ever-changing world. This advanced degree is designed for those who wish to transform their professional practice and become leaders in the field of education. Upon completion of this program, you will have developed the skills and knowledge to address critical issues within PK-12, higher education, and related educational organizations. The program focuses on four key domains: Leadership, Curriculum & Pedagogy, Professional & Community Development, and Diversity & Social Justice. These domains are integrated throughout the program coursework and culminating dissertation.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/college-of-education/department-of-secondary-education/doctor-of-education-in-transformational-teaching-and-learning.html",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Education in Transformational Teaching and Learning (EdD)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Visual Impairment Certification Program at Kutztown University is the only program of its kind in the state of Pennsylvania. This certification program is available to individuals who hold a bachelor's degree. Students who wish to apply to the certification program must already hold a Level I or Level II teaching certificate in another area of education (e.g., special education, elementary education, secondary education, reading specialist, etc.). Graduates of the program are eligible for the Pennsylvania Department of Education certification as a Teacher of the Visually Impaired (TVI). The program's coursework may be taken entirely online or through a combination of online and on-campus courses. Students in the program take courses such as Introduction to Visual Impairment, Braille I, Braille II, Anatomy & Physiology of the Eye, Methods for Students with Visual Impairments, and Assistive Technology. In addition, students complete field experiences including a practicum with an itinerant TVI and student teaching with a TVI in a center-based school. The coursework is also available as a track in the M.Ed. in Special Education.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/special-education/programs/visual-impairment-certification-preparation-program.html",
        "Accreditation status": null,
        "Level": "Certification",
        "Program name": "Visual Impairment (Certification)",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/education/academic-departments/special-education/programs/visual-impairment-certification-preparation-program.html"
    },
    {
        "Concentration name": null,
        "description": "The School Social Work certificate is a 12-credit post-master's program that will prepare you to be an effective social work practitioner in a school setting and provides eligibility to apply to be a certified school social worker in Pennsylvania. Kutztown University's Master of Social Work program is accredited by the Council on Social Work Education (CSWE), and this certificate is built on that foundation. This program consists of 12 credits taken over 12 months with both online and in-person components. Your fieldwork experience in a school setting provides direct practice experience with diverse populations, and coursework will cover evidence-based practices that focus on the issues and difficulties that impact school-aged children and adolescents. The School Social Work certificate prepares students to deal with issues of violence, trauma, substance abuse, and to gain competence in working with individuals, groups, families and communities.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/social-work/graduate-programs/school-social-work-certificate.html",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in School Social Work",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": "Behavioral Health",
        "description": "The Master of Social Work (MSW) program at Kutztown University is a professional degree that provides students with the advanced knowledge and skills necessary to address a variety of human problems. The program emphasizes the promotion of social and economic justice, multiculturalism, and empowerment of oppressed and vulnerable populations. KU's MSW is built upon a strong clinical foundation with special attention given to evidence-based practice and a behavioral health concentration. Students develop the abilities to implement clinical interventions as well as engage in advocacy and policy practice to meet the needs of diverse clientele in our ever-changing society.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/social-work/graduate-program-msw.html",
        "Accreditation status": "The Master of Social Work program at Kutztown University is accredited by the Council on Social Work Education's Commission on Accreditation.",
        "Level": "Master's",
        "Program name": "Master of Social Work (MSW)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": "Leadership and Innovation",
        "description": "The Doctor of Social Work (DSW) in Leadership and Innovation at Kutztown University is a practice doctorate designed for social work leaders who want to advance in their career and become innovators in the field. This DSW program is for individuals who possess a Master of Social Work (MSW) degree from a Council on Social Work Education (CSWE) accredited program and have at least three years of post-MSW practice experience. The DSW curriculum has a strong focus on leadership and innovation, providing students with the knowledge and skills needed to address complex social problems. The program emphasizes the use of evidence-based practice and a commitment to social justice. Graduates of the DSW program will be prepared to take on leadership roles in a variety of settings, including nonprofit organizations, government agencies, and private practice. Students in the DSW program have the opportunity to engage in a rigorous course of study that includes both online and in-person components. The program is designed to be completed in three years, and students can choose to attend either part-time or full-time. Classes are offered in a hybrid format, with some coursework completed online and some in-person.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/social-work/dsw-program.html",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Social Work (DSW)",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The 12-credit Creative Catalyst Graduate Certificate is a hands-on learning experience for professionals, career changers, or those with non-design bachelor’s degrees who are interested in pursuing an advanced degree in Communication Design. This certificate gives students a foundation in essential design skills and conceptual thinking processes to build a portfolio of communication design work. The Creative Catalyst certificate can serve as a bridge to Kutztown University's Master of Fine Arts in Communication Design (CD MFA) program or as a stand-alone certificate to enhance your creative problem-solving skills.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/department-of-art-and-design/graduate-programs/communication-design/creative-catalyst-certificate.html",
        "Accreditation status": "Kutztown University is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Communication Design: Creative Catalyst",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The 12-credit Graduate Certificate in Communication Design: Creative Futures is a dynamic, interdisciplinary program for working professionals who wish to sharpen their creative thinking skills to become more strategic leaders and innovators in their fields. The program builds foundational skills in creative problem solving, design thinking, strategic foresight, visual communication, and leadership. Students learn to navigate and influence the changing social and business landscapes with an emphasis on research, creative strategy, and social innovation. The program can be completed in as little as 10 months and consists of four, eight-week, fully online classes. This unique certificate can be taken as a stand-alone professional credential or can be stacked with the MFA in Communication Design.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/department-of-art-and-design/graduate-certificate-in-communication-design-creative-futures.html",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Communication Design: Creative Futures",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": "Creative Refresh",
        "description": "The Creative Refresh Graduate Certificate in Communication Design helps professionals update their portfolio with projects focusing on the latest design practices, technology, and theories. You will learn how to design, evaluate, and produce work across various media in a curriculum that suits your professional goals.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/majors-minors-and-certificates/art-and-design/graduate-certificates-in-communication-design.html",
        "Accreditation status": "The Department of Art and Design is accredited by the National Association of Schools of Art and Design (NASAD).",
        "Program name": "Graduate Certificate in Communication Design: Creative Refresh",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/visual-and-performing-arts/majors-minors-and-certificates/art-and-design/graduate-certificates-in-communication-design.html"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Data Analytics will provide students an opportunity to learn to extract, clean, analyze, visualize, and interpret data while gaining a strong foundation in computer science and statistics. This 12-credit certificate provides students from a variety of academic backgrounds with a wide range of job opportunities in the growing field of data analytics. This program is offered 100% online.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/computer-science-and-information-technology/graduate-programs/data-analytics-certificate.html",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Computer Science: Data Analytics",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": "Database Design and Administration",
        "description": "The Graduate Certificate in Computer Science with a specialization in Database Design and Administration is designed to provide computing professionals with an opportunity to receive recognition for completing a coherent set of four graduate courses in the database area. The successful completion of the coursework for this graduate certificate will be recorded on the student's official transcript. This program will be particularly beneficial to professionals who are preparing for a career transition into the database field.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/computer-science-and-information-technology/graduate-certificate-in-cs-database-design-and-administration.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Computer Science: Database Design and Administration",
        "Program Page url": "https://www.kutztown.edu/about-ku/administrative-offices/graduate-studies/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The graduate certificate program in geography with a specialization in geospatial information technology is designed to provide individuals who already possess a baccalaureate degree with specialized training in geospatial technology. This certificate program is an excellent complement to degrees in geography, geology, environmental science, marine science, biology, computer science, criminal justice, political science, sociology, anthropology, business, and public administration. Individuals from other disciplines, as well as individuals already in the workplace, will find that the program will enrich their technological skill set and enhance their career opportunities. The program is offered completely online.",
        "program website url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/geography/graduate-programs/graduate-certificate.html",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Geography: Geospatial Information Technology",
        "Program Page url": "https://www.kutztown.edu/academics/colleges-and-departments/liberal-arts-and-sciences/departments/geography/program-and-course-information/geography-course-descriptions.html"
    }
]