[
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Completed Application Form with Application Fee. A Bachelor’s Degree or its equivalent from an accredited college or university. Official transcripts from all previously attended post-secondary institutions. Resume. Statement of Purpose. English Language Proficiency: Applicants whose native language is not English must demonstrate English proficiency. A minimum undergraduate GPA of 3.0 is desirable. Students with a Bachelor’s degree in a field other than Computer Science or Information Technology may need to complete a set of prerequisite courses to be successful in the MSIT program.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Information Technology",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Completed Application for Admission Form; A bachelor’s degree from an accredited institution. Official transcripts from all post-secondary institutions attended. Transcripts not in English must be accompanied by a certified English translation; Proof of English proficiency is required for all applicants; A statement of purpose describing your academic and professional background, your career goals, and how the WUST MSIT degree will help you achieve your goals; Resume or curriculum vitae (CV); Copy of government-issued photo identification; A non-refundable application fee of $100.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Information Technology with a Concentration in IT Systems & Management",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": "Completed Application Form\nApplication Fee\nA Bachelor's degree or its equivalent from an accredited college or university\nOfficial transcripts from all post-secondary institutions attended\nAny additional requirements specified for the chosen program of study\nProof of English Proficiency for International Students\nProof of Financial Support",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Information Technology with a Concentration in Data Management & Analytics",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "A completed online Application Form; Application Fee ($50 for US applicants, $100 for international applicants); A Bachelor’s degree from an institution of higher education that is accredited by a US accrediting agency recognized by the US Department of Education, or an equivalent foreign institution; Official transcripts from all post-secondary institutions attended; A Statement of Purpose describing your academic and professional accomplishments and goals; A current resume; Proof of English Language Proficiency for international students whose native language is not English. Acceptable proofs are: TOEFL (minimum score of 80), IELTS (minimum score of 6.5), PTE (minimum score of 53), Duolingo (minimum score of 105), or a transcript from a US institution showing completion of an English composition course with a grade of B or better, or a degree earned from a US institution; GRE/GMAT scores (Optional).",
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": true,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Information Technology with a Concentration in Software Design & Management",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Completed online application form. A bachelor’s degree from an accredited institution. Applicants with a degree in computer science, cybersecurity, or a related field are preferred. Official transcripts from all post-secondary institutions attended. Minimum GPA of 2.75 on a 4.0 scale. Proof of English proficiency for international students (TOEFL, IELTS, etc.). Resume or Curriculum Vitae (CV). Statement of Purpose: A 500-word essay detailing your academic and professional goals and how the MSCS program at WUST will help you achieve them. Two letters of recommendation (optional but recommended). Application fee.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Cybersecurity",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "A completed online application and a $100 non-refundable application fee. Official transcripts from all post-secondary institutions attended. A bachelor’s degree from an accredited institution with a minimum GPA of 2.5 on a 4.0 scale. Statement of Purpose. Resume or curriculum vitae (CV). A copy of a government-issued photo ID. For international students, additional requirements may apply, including proof of English proficiency.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration",
        "Program Page url": "https://www.lamar.edu/business/management-marketing-and-general-business/master-of-business-administration/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be admitted to the MBA degree program, the applicant must:\n\nHold a bachelor’s degree from an institution accredited by an agency recognized by the U.S. Department of Education.\n\nHave a minimum undergraduate Grade Point Average (GPA) of 2.5 on a 4.0 scale. Applicants with a GPA less than 2.5 may be considered for admission on a probationary basis. The student must earn a 3.0 GPA in the first nine credit hours to be removed from academic probation.\n\nComplete an online application form.\n\nSubmit a Statement of Purpose.\n\nSubmit a resume.\n\nReceive a positive recommendation from the WUST Admission Committee after an interview and a review of the applicant’s documents.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration with a Concentration in Leadership and Management",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "The applicant must have earned a Bachelor’s degree or its equivalent from an institution of higher education. Prospective students are required to complete an application form and submit it to the Office of Admissions. The following documents are required for an application to be considered for admission: Application form; A non-refundable application fee of $100; Official transcripts from all post-secondary institutions attended; Statement of Purpose (SOP); Resume; A copy of a government-issued photo ID. For applicants whose native language is not English, a proof of English proficiency is required. WUST accepts TOEFL or IELTS test scores.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration with a Concentration in Accounting & Finance",
        "Program Page url": "https://www.wust.edu/mba"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Complete WUST’s Graduate Admission Application Form; Bachelor’s degree from a college or university accredited by an accrediting agency recognized by the U.S. Department of Education; Official transcripts from all institutions attended; A current résumé; A personal statement that describes the applicant’s academic and professional accomplishments, goals, and how the degree from WUST will help to achieve their goals; Proof of English proficiency for all applicants whose native language is not English; GRE/GMAT scores (This is optional for applicants with a cumulative GPA of 3.0 or higher); Copy of a government-issued photo ID; A $100 non-refundable application fee.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": true,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration with a Concentration in Information Technology",
        "Program Page url": "https://www.jcu.edu.au/courses/master-of-information-technology-master-of-business-administration"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be considered for admission to a WUST graduate program, applicants must have earned a bachelor’s degree from an institution of higher education accredited by an agency recognized by the U.S. Department of Education, or the equivalent for international students. All applicants must submit the following: An application for graduate admission; A bachelor’s degree from an accredited institution; Official transcripts from all post-secondary institutions attended; A current resume; A statement of purpose; Two letters of recommendation (Optional for MBA, MSIT, and MSCS programs); Evidence of English Proficiency (for international students); GRE/GMAT scores (Optional for all applicants); A nonrefundable application fee of $100.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": true,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration with a Concentration in Health Care Management",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Optional",
        "Requirements": "A bachelor’s degree from an accredited institution. A completed graduate admission application form. A non-refundable application fee of $100. An official transcript from the institution that conferred the undergraduate degree. A copy of a government-issued photo ID. For the MBA program, applicants must submit a professional resume. WUST encourages all applicants to submit a Statement of Purpose. Letters of Recommendation are optional for graduate applicants. WUST may require an English proficiency test score from all applicants whose native language is not English.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration with a Concentration in Human Resources Management",
        "Program Page url": "https://www.wust.edu/graduate-program"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "A completed application form. A bachelor’s degree from an institution accredited by an agency recognized by the U.S. Department of Education. Official transcripts from all post-secondary institutions attended. A current resume. A statement of purpose. English Proficiency Test score for international students. Additional requirements may be applicable for certain programs.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration with a Concentration in Project Management",
        "Program Page url": "https://www.wust.edu/graduate-program"
    }
]