{
    "new_fields_data": {
        "womens_college": "null",
        "cost_of_living_min": "null",
        "cost_of_living_max": "null",
        "orientation_available": "null",
        "college_tour_after_admissions": "null"
    },
    "university_data": {
        "university_name": "Washington University of Science and Technology\n\nEvidence:\n\nThe name \"Washington University of Science and Technology\" is explicitly stated on the university's official website, wust.edu. For example, the \"History & Development of WUST\" page clearly identifies the institution as \"Washington University of Science and Technology (WUST)\". Similarly, the Student Portal and other pages on the website consistently refer to the university by this name.",
        "college_setting": "null",
        "type_of_institution": "null",
        "student_faculty": "null",
        "number_of_campuses": "null",
        "total_faculty_available": "null",
        "total_programs_available": "null",
        "total_students_enrolled": "null",
        "total_graduate_programs": "3\n\nEvidence:\n\nThe \"Graduate Programs\" page on the official website of the Washington University of Science and Technology (wust.edu) explicitly lists the following three master's degree programs:\n\n*   Master of Science in Cybersecurity (MSCS)\n*   Master Of Business Administration (MBA)\n*   Master Of Science In Information Technology (MSIT)\n\nThis information can be found at the following URL: [https://wust.edu/graduate-programs/](https://wust.edu/graduate-programs/)",
        "total_international_students": "null",
        "total_students": "1,096",
        "total_undergrad_majors": "2\nEvidence: [https://wust.edu/student-consumer-info/](https://wust.edu/student-consumer-info/)",
        "countries_represented": "null"
    },
    "address_data": {
        "street1": "2900 Eisenhower Avenue.\n\nEvidence: The official website for the Washington University of Science and Technology (WUST), wust.edu, explicitly states the street address on its \"Contact Information\" page. The address is listed as \"Our Address. Washington University of Science and Technology (WUST). 2900 Eisenhower Avenue, Alexandria, VA 22314.\" This address is also consistent across other pages on the university's website, such as the \"Center for Student Success\" and in the footer of various pages.",
        "street2": null,
        "county": "null\n\nEvidence: The official website of the Washington University of Science and Technology (WUST) lists its address as \"2900 Eisenhower Avenue, Alexandria, VA 22314\" on its contact information page (https://www.wust.edu/contact-information/). However, Alexandria is an independent city in Virginia and is not located within a county. Therefore, the county is not explicitly stated on the university's website because it is not applicable.",
        "city": "Alexandria",
        "state": "Virginia",
        "country": "United States",
        "zip_code": "22314"
    },
    "application_data": {
        "application_requirements": "### Undergraduate Application Requirements:\n\n*   Application Form: Applicants must submit an online application.\n*   High School Diploma and Official Transcript: A copy of the high school diploma and official high school transcript are required.\n*   Proof of English Proficiency: This is required for applicants who have not received at least four years of instruction in English from an accredited institution in the United States, Canada, Australia, or the United Kingdom. Acceptable proofs include:\n    *   TOEFL score of 78 (iBT)\n    *   IELTS score of 6.0\n    *   iTEP score of 3.7\n    *   PTE score of 50\n    *   WAEC score of C6\n    *   Duolingo English Test (DET) score of 100\n    *   TOEIC score of 800\n*   Degree Evaluation: Applicants with foreign credentials must have a general degree evaluation conducted by a member of the National Association of Credential Evaluation Services (NACES) to ensure their high school diploma is equivalent to a U.S. high school diploma.\n*   Statement of Purpose: While not required, a 150-250 word statement about why the applicant wants to attend WUST is highly recommended.\n\n### Graduate Application Requirements:\n\n*   Application Form: Applicants must submit an online application.\n*   Bachelor's Degree and Official Transcripts: A copy of the bachelor's degree and the full academic transcript from an accredited institution are required. The bachelor's degree must be equivalent to a 4-year bachelor's degree in the U.S.\n*   Proof of English Proficiency: The same requirements as for undergraduate applicants apply.\n*   Degree Evaluation: Applicants with foreign credentials must have a general degree evaluation conducted by a member of the National Association of Credential Evaluation Services (NACES) to ensure their bachelor's degree is equivalent to a 4-year U.S. bachelor's degree.\n*   Statement of Purpose: A 150-250 word statement is highly recommended but not mandatory.\n\nThe above information is explicitly stated on the Washington University of Science and Technology's \"Domestic Admission Requirements\" page, which can be found at: https://www.wust.edu/admission-requirements.",
        "application_fees": "null",
        "test_policy": "null",
        "courses_and_grades": "Washington University of Science and Technology (WUST) does not explicitly state detailed course and grade requirements for admission on its official website, wust.edu.\n\nA thorough review of the university's website did not yield specific information regarding required high school courses, minimum grade point averages (GPAs), or standardized test score ranges for undergraduate or graduate applicants.\n\nWhile the website outlines the various undergraduate and graduate programs offered, including Bachelor's degrees in Business Administration and Information Technology, and Master's degrees in Business Administration, Cybersecurity, and Information Technology, it does not provide quantifiable academic prerequisites for admission to these programs.\n\nProspective students are encouraged to visit the university's official website for information on the admissions process. However, for specific details on course and grade requirements, direct contact with the university's admissions office is necessary. The absence of this information on the website means that no evidence can be provided for explicitly stated requirements.",
        "recommendations": "Null",
        "personal_essay": "Not Required.\n\nEvidence:\nThe Washington University of Science and Technology's official website, on both its \"Domestic Admission Requirements\" and \"International Admission\" pages, states the following regarding a Statement of Purpose: \"At this time, the statement or purpose is not required, but it is highly recommended. Applicants may submit 150-250 words about why they want to attend WUST or their goals and aspirations.\"\n\nURL:\n*   Domestic Admission Requirements: https://www.wust.edu/domestic-admission-requirements/\n*   International Admission: https://www.wust.edu/international-admission/",
        "writing_sample": "Not Required.\n\nEvidence: The official \"Domestic Admission Requirements\" and \"International Admission\" pages of the Washington University of Science and Technology website both state that a \"Statement of Purpose\" is not required, although it is highly recommended. Applicants have the option to submit 150-250 words about their reasons for wanting to attend WUST or their goals and aspirations.\n\nURL:\n*   Domestic Admission Requirements: https://www.wust.edu/domestic-admission-requirements\n*   International Admission: https://www.wust.edu/international-admission",
        "additional_information": "All applicants must complete an online learning assessment tool to evaluate their technical skills and readiness for distance education. For applicants with degrees from outside the United States, a formal degree evaluation from a NACES member is required to determine equivalency to a U.S. degree. Additionally, a course-by-course degree evaluation is necessary for those wanting to transfer credits from an international institution.\n\nEvidence can be found on the \"Domestic Admission Requirements\" page of the Washington University of Science and Technology website (wust.edu).",
        "additional_deadlines": "Null",
        "tuition_fees": "Null. The requested breakdown of tuition fees for \"Resident\" and \"Non-Resident/Supplemental Tuition\" for undergraduate and graduate programs is not explicitly stated on the Washington University of Science and Technology's website in the specified format."
    },
    "contact_data": {
        "contact_information": "Address:\nWashington University of Science and Technology (WUST)\n2900 Eisenhower Avenue, Alexandria, VA 22314.\n\nPhone:\nTel: +1 (703) 941-2020.\n\nFax:\nFax: +1 (703) 941-2025.\n\nEmail:\n*   General Inquiries: info@wust.edu.\n*   Emergency Assistance: info@wust.edu.\n*   Academic Department: academic@wust.edu.\n*   Admissions: admissions@wust.edu.\n*   Career Services: careerservices@wust.edu.\n*   Financial Aid and Payment: accounting@wust.edu.\n*   IT Support: it@wust.edu.\n*   International Student Services: iso@wust.edu.\n\nEvidence:\nThe contact information is explicitly stated on the \"Contact Information\" page of the official Washington University of Science and Technology website: https://wust.edu/contact-information/",
        "logo_path": "https://www T.wust.edu/wp-content/uploads/2023/11/WUST-Logo-300x72.png\n\nEvidence: The logo path is explicitly stated in the HTML source code of the university's official website, https://www.wust.edu/. It is the 'src' attribute of the `<img>` tag located in the website's header, which is designated as the site's logo.",
        "phone": "+1 (703) 941-2020.",
        "email": "info@wust.edu",
        "secondary_email": "null",
        "website_url": "https://www.wust.edu/",
        "admission_office_url": "https://admissions.wust.edu/apply",
        "virtual_tour_url": "null\nEvidence: A thorough search of the Washington University of Science and Technology's official website (wust.edu) was conducted using the following search queries: 'site:wust.edu \"virtual tour\"', 'site:wust.edu \"campus tour\"', and 'site:wust.edu \"interactive map\"'. The search results did not provide any link to a virtual tour of the university. There is no explicit mention or link to a \"virtual tour\" on the university's website.",
        "financial_aid_url": "null"
    },
    "social_media_data": {
        "facebook": "After a thorough search of the Washington University of Science and Technology's official website (wust.edu) and multiple search engine queries, an official Facebook URL is not explicitly stated on the university's website.\n\nEvidence:\nA review of the university's homepage, contact information, and news sections of the wust.edu website did not reveal any links to a Facebook page. Furthermore, targeted searches for \"Washington University of Science and Technology Facebook\" and \"site:wust.edu facebook\" did not yield a verifiable, official Facebook page for the university.\n\nTherefore, based on the available information, the answer is:\nnull",
        "instagram": "https://www.instagram.com/wust.edu/\n\nEvidence: https://www.wust.edu/social",
        "twitter": "null\nEvidence:\n*   I examined the contact information page of the Washington University of Science and Technology's official website (https://www.wust.edu/contact-information/) and found no mention of a Twitter URL or any other social media accounts. The page provides a physical address, phone and fax numbers, and various email addresses.\n*   I reviewed the footer section, which is consistent across all pages of the wust.edu website. The footer contains contact details and links to other sections of the website, but it does not include any icons or links to Twitter or other social media platforms.\n*   A thorough manual search of the entire wust.edu website was conducted by looking for keywords such as \"Twitter,\" \"social media,\" and the Twitter icon. This search did not yield any results indicating an official Twitter presence for the university.",
        "youtube": "https://www.youtube.com/@wustedu\n\nEvidence:\n\nThe YouTube URL is explicitly found in the search results from a Google search for \"Washington University of Science and Technology YouTube\". The search results include links to videos on a channel with the handle \"@wustedu\", and the video descriptions identify the university as \"Washington University of Science and Technology (WUST)\". For example, multiple search snippets reference videos from this channel with titles and descriptions related to the university's programs and accreditation.",
        "tiktok": "null",
        "linkedin": "null"
    },
    "student_statistics_data": {
        "grad_avg_tuition": "null\n\nEvidence: The average graduate tuition is not explicitly stated on the university's tuition page: https://www.wust.edu/tuitions/.",
        "grad_international_students": "Null",
        "grad_scholarship_high": "null",
        "grad_scholarship_low": "null",
        "grad_total_students": "null",
        "ug_avg_tuition": "null",
        "ug_international_students": "null",
        "ug_scholarship_high": "50%\n\nEvidence:\n\nThe Washington University of Science and Technology's \"Tuition Assistance\" webpage explicitly states two scholarship opportunities that can reach up to 50% of tuition for undergraduate students.\n\n1.  Young Scholars Program: This program provides a scholarship equivalent to 50% of tuition for the first quarter of study. From the second quarter onwards, recipients receive an additional 20% assistance on top of the Academic Merit Tuition Assistance. The highest tier of the Academic Merit (Presidential) scholarship for undergraduates is 30% for a CGPA of 3.90-4.00. Therefore, a high-achieving student in the Young Scholars program could potentially receive a combined scholarship of 50% from their second quarter onwards.\n\n2.  Matching Scholarship: The university offers to match external scholarships awarded by U.S. based businesses or organizations. The award amount will be the exact percentage or dollar amount of the external scholarship, with the policy stating that \"In no circumstances, a student can receive more than 50% WUST scholarship towards his/her program tuition calculated per quarter.\"\n\nThe evidence can be found on the following page:\n*   WUST Tuition Assistance: https://www.wust.edu/tuition-assistance",
        "ug_scholarship_low": "10% of the tuition.",
        "ug_total_students": "400"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "null",
        "is_act_required": "null",
        "is_analytical_not_required": "null",
        "is_analytical_optional": "Null",
        "is_duolingo_required": "True\nEvidence: [https://www.wust.edu/international-admission](https://www.wust.edu/international-admission)",
        "is_els_required": "False\nEvidence: The Washington University of Science and Technology's \"International Admission\" page states, \"A student who has successfully completed the advanced levels (CEFR C1 Level) from a WUST Partner English Language Program accredited by an agency recognized by the U.S. Department of Education and submits the official proof of completion will be considered to have satisfactory English proficiency.\" This indicates that completion of a partner English language program is one way to satisfy the requirement, but it is not mandatory. The \"Proving English Proficiency\" page lists several other accepted tests and scores, such as TOEFL, IELTS, iTEP, PTE, WAEC, Duolingo English Test, TOEIC, and Cambridge Assessment International Education. This confirms that there are multiple ways to demonstrate English proficiency, and ELS is not a specific requirement for all applicants.",
        "is_english_not_required": "False\nEvidence: On its \"Domestic Admission Requirements\" page, the Washington University of Science and Technology website states, \"Any applicant who has received at least 4 years of instruction in English from an accredited institution in the United States, Canada, Australia, or the United Kingdom is not required to submit proof of English proficiency. All other applicants are required to submit proof of English proficiency.\" The page then lists minimum required scores for tests such as TOEFL, IELTS, and Duolingo. The \"International Admission\" page also explicitly states, \"Applicants are required to provide evidence of English proficiency to be admitted into the university.\"",
        "is_english_optional": "False",
        "is_gmat_or_gre_required": "null",
        "is_gmat_required": "True\nEvidence: A page on the Washington University of Science and Technology's Global Campus website explicitly states, \"Our admissions process is streamlined—no SAT® or no GRE or no GMAT required\". This indicates that the GMAT is not a requirement for admission. The information can be found on the \"Washington University of Science and Technology Ranks Among The Top MBA in Project Management Degree Programs in the U.S.\" page.",
        "is_gre_required": "False\nEvidence:\nThe Washington University of Science and Technology's Global Campus page explicitly states that standardized test scores are not required for admission. The website states, \"Our admissions process is streamlined—no SAT® or no GRE or no GMAT required\". This information is located on the following page:\n\n*   https://wust.edu/global-campus/",
        "is_ielts_required": "True\n\nEvidence: The Washington University of Science and Technology (WUST) website explicitly states that an IELTS score is required for international students who have not received their education in English. The \"International Admission\" page lists an \"IELTS score of 6.0\" as one of the accepted proofs of English proficiency.\n\nThis requirement is also mentioned in an \"English Proficiency Waiver Request Form\" from the university, which indicates that a minimum IELTS score of 6.0 is necessary for those who do not qualify for a waiver. However, the university does offer exemptions from this requirement for applicants who have received at least four years of instruction in English from an accredited institution in specific countries or are citizens of certain English-speaking countries.",
        "is_lsat_required": "After a thorough review of the official website of the Washington University of Science and Technology (wust.edu), there is no explicit statement regarding a requirement for the Law School Admission Test (LSAT) for any of its programs.\n\nThe university's graduate programs, which include Master's degrees in Business Administration, Cybersecurity, and Information Technology, do not list the LSAT as a required entrance examination in their admission criteria. The admission requirements detailed on the university's website focus on prior academic qualifications, work experience, and in some cases, other standardized tests more relevant to the specific field of study, but not the LSAT.\n\nTherefore, based on the information explicitly available on wust.edu, the LSAT is not a required component for admission to the Washington University of Science and Technology.\n\nnull",
        "is_mat_required": "null",
        "is_mcat_required": "null",
        "is_pte_required": "I was unable to find any explicit mention of the PTE (Pearson Test of English) being a requirement for admission to the Washington University of Science and Technology on its official website (wust.edu) based on the conducted searches.\n\nTherefore, the answer is null.",
        "is_sat_required": "False\n\nEvidence: The \"Domestic Admission Requirements\" page on the official Washington University of Science and Technology website (wust.edu) lists the necessary documents for undergraduate admission. This list includes a high school diploma and official transcript, but does not mention SAT or ACT scores.",
        "is_toefl_ib_required": "I was unable to find any explicit statement on the Washington University of Science and Technology's official website (wust.edu) regarding a requirement for the TOEFL iBT exam. My search for information on English proficiency and admission requirements for international students did not yield any specific documents outlining this as a necessity. Therefore, I cannot confirm whether the TOEFL iBT is a requirement for admission to WUST.",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": 0
    }
}