[
    {
        "Concentration name": null,
        "description": "Are you good with numbers and looking for a career that uses these skills? If you are, an Associate’s Degree in Accounting from Post University may be the right program for you. The Associate’s Degree in Accounting program offers students a broad range of accounting courses to prepare students for entry-level accounting positions. It is a stepping stone for your future and a way to increase your earning potential in any business, large or small. Upon completion of this program, students will have a strong foundation in core accounting principles and be able to: Perform bookkeeping, payroll and tax preparation tasks. Process accounts payable and accounts receivable. Prepare financial statements. Analyze financial data. Work with accounting software. Recognize the ethical challenges faced by today’s accounting professional. The curriculum also includes courses in business, communications, and liberal arts, ensuring that you develop a well-rounded skill set applicable to various professional settings.",
        "program website url": "https://post.edu/blog/dropdowns/associates-degree/",
        "Accreditation status": null,
        "Program name": "Associate's Degree in Accounting",
        "Program Page url": "https://post.edu/blog/dropdowns/associates-degree/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Accounting",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": "Post University offers a Bachelor of Science (B.S.) in Biology to help students interested in the field develop the skills they need to pursue a wide range of career opportunities. The Post University B.S. in Biology curriculum helps students develop critical analytical thinking, and quantitative reasoning skills. Students will explore biology fundamentals and learn how to apply their skills in a wide variety of environments. The Biology program is designed to provide students with a solid foundation in the principles of biology, including genetics, cell biology, ecology, and evolution. Students will also gain hands-on experience through laboratory work and fieldwork, allowing them to apply their knowledge in real-world settings. With a B.S. in Biology from Post University, students will be well-prepared to pursue a variety of career paths in the biological sciences, including research, healthcare, environmental conservation, and education.",
        "program website url": "https://post.edu/academics/undergraduate-degrees/bachelor-of-science-in-biology/",
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Biology",
        "Program Page url": "https://post.edu/blog/post-university-educational-opportunities-in-online-biology/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Associate's Degree in Business",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Business",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor's Degree in Child Care and Support Services Management",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor's Degree in Child Development",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Communications",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": "Our Bachelor of Science (B.S.) in Computer Information Systems degree program prepares students for various entry-level positions in the computer technology field. Students will learn the essentials of computer hardware and software, computer programming, computer networking, cybersecurity, and data analysis. The program helps students develop the fundamental knowledge and essential skills for a career in the rapidly expanding computer technology field. It is designed to prepare students for various entry-level positions in areas like computer programming, computer networking, cybersecurity, and data analysis. The Bachelor of Science (B.S.) in Computer Information Systems degree program at Post University offers students a well-rounded and flexible curriculum, preparing them for entry-level positions in a variety of computer-related fields. Students will develop proficiency in computer hardware, software, and networking, an understanding of computer programming and logic, an introduction to cyber security and data analytics, and the ability to apply critical thinking and problem-solving skills to real-world computing challenges. The total credits for the program are 120, and the program length is 8 semesters.",
        "program website url": "https://post.edu/academics/undergraduate-degrees-certificates/bachelor-degree-in-computer-information-systems/",
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Computer and Information Sciences",
        "Program Page url": "https://post.edu/academics/undergraduate-degrees-certificates/bachelor-degree-in-computer-information-systems/"
    },
    {
        "Concentration name": "Mental Health Counseling",
        "description": "The Bachelor of Arts in Psychology program offers a comprehensive curriculum that provides students with a strong foundation in psychological principles, theories, and research methods. Through a combination of coursework, hands-on experiences, and critical thinking exercises, students develop a deep understanding of human behavior, cognitive processes, and emotional well-being. The program emphasizes ethical considerations in psychology, cultural diversity, and the application of psychological knowledge to real-world issues. Graduates are prepared for various entry-level positions in fields such as human services, mental health, education, and research, or for advanced studies in psychology and related disciplines. The Mental Health Counseling Concentration within this program is designed for students interested in pursuing careers in mental health counseling or related fields. It focuses on developing essential skills in counseling techniques, assessment, and intervention strategies. Students gain knowledge of various theoretical approaches to counseling, ethical guidelines, and an understanding of diverse populations. The curriculum also prepares students for graduate-level studies in counseling or clinical psychology.",
        "program website url": "https://post.edu/student-services/academic-affairs/university-catalog/#bachelor-of-arts-in-psychology",
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Counseling Psychology",
        "Program Page url": "https://post.edu/student-services/academic-affairs/university-catalog/"
    },
    {
        "Concentration name": null,
        "description": "The Associate of Science in Criminal Justice and Safety Studies degree at Post University helps prepare you for an entry-level position in the criminal justice field, or to pursue further education in a bachelor’s degree program. Our degree programs are built with a career focus, providing you with the essential skills and knowledge you’ll need to excel. Our online criminal justice program features a comprehensive curriculum taught by experienced faculty, many of whom have worked in the criminal justice system themselves. They provide real-world insights into the field through online and in-person instruction, helping you prepare for a variety of entry-level roles as a:\n* Criminal Investigator\n* Police Officer\n* Corrections Officer\n* Probation and Parole Officer\n* Security Professional\n* Forensic Science Technician\n\nYou will examine topics such as criminal investigation, law enforcement management, juvenile justice, constitutional law, and more, as you build a foundation for a career that serves your community. Take the first step toward a career in public safety and the law with an Associate of Science in Criminal Justice and Safety Studies.",
        "program website url": "https://post.edu/academics/undergraduate-degrees/associate-of-science-in-criminal-justice-and-safety-studies/",
        "Accreditation status": "Post University is accredited by the New England Commission of Higher Education (NECHE).",
        "Program name": "Associate's Degree in Criminal Justice and Safety Studies",
        "Program Page url": "https://online.lsu.edu/online-degree-programs/associates/associate-science-criminal-justice/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Criminal Justice and Safety Studies",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Crisis/Emergency/Disaster Management",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Data Science",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": "Ready to make a meaningful difference in the lives of children? The Bachelor’s Degree in Child Studies at Post University prepares you to understand and support the comprehensive development of young people. This program is ideal for individuals passionate about working with children and families in diverse settings, from early childhood education to social services and advocacy roles. Our curriculum provides a deep dive into child development theories, family dynamics, cultural influences, and effective strategies for promoting well-being. You’ll explore crucial topics such as cognitive, social, and emotional development, child health and safety, and ethical practices in child care and education. Graduates are well-prepared for various entry-level positions or to pursue graduate studies in related fields, equipped with both theoretical knowledge and practical skills to make a positive impact.",
        "program website url": "https://post.edu/academics/undergraduate-degrees-certificates/bachelor-degree-in-child-studies/",
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Education",
        "Program Page url": "https://post.edu/academics/undergraduate-degrees-certificates/bachelor-degree-in-child-studies/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Educational/Instructional Technology",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": "Post University is proud to announce the launch of its first-ever 100% online Bachelor of Science in Equine Studies program. This groundbreaking program is designed to provide students with a comprehensive understanding of the equine industry, combining rigorous academic study with practical knowledge relevant to various career paths within the field. The Bachelor of Science in Equine Studies program at Post University is meticulously crafted to address the evolving needs of the equine sector. It offers a unique blend of scientific principles, business acumen, and hands-on operational skills, preparing graduates for leadership roles and entrepreneurial ventures. Students will delve into subjects such as equine anatomy and physiology, nutrition, health and disease management, genetics, reproduction, training methodologies, and ethical practices. The curriculum also encompasses crucial business aspects like marketing, finance, facility design, and legal considerations specific to the equine industry. Upon completion of the program, graduates will possess the critical thinking skills, problem-solving abilities, and industry-specific knowledge necessary to excel in diverse roles such as stable managers, equine event coordinators, breeding farm operators, veterinary assistants, equine therapists, and more.",
        "program website url": null,
        "Accreditation status": "Accredited by the New England Commission of Higher Education (NECHE)",
        "Program name": "Bachelor's Degree in Equine Studies",
        "Program Page url": "https://post.edu/blog/first-ever-online-bachelor-of-science-in-equine-studies-program/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor's Degree in Finance",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": "As a student in Post University’s Bachelor of Science in Health Care Management program, you will develop a deep understanding of the health care system, including operations, finance, human resources, and policy. Our curriculum is designed to prepare you for leadership roles in a variety of health care settings, from hospitals and clinics to long-term care facilities and public health agencies. You’ll gain essential skills in critical thinking, problem-solving, and communication, all vital for navigating the dynamic health care landscape. Our program emphasizes practical application, with real-world case studies and projects that give you hands-on experience in addressing complex health care challenges. Graduates are equipped to make a positive impact on patient care and organizational efficiency, contributing to the overall improvement of health care services. Upon completion, students will be able to apply management theories and practices to health care organizations; analyze the legal, ethical, and regulatory issues impacting the health care industry; evaluate financial management principles and their application in health care settings; develop effective communication strategies for diverse health care stakeholders; and formulate solutions to complex health care challenges using critical thinking and problem-solving skills.",
        "program website url": "https://post.edu/academics/bachelors-degrees/bachelor-of-science-in-health-care-management/",
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Health/Health Care Administration/Management",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Higher Education/Higher Education Administration",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor's Degree in Homeland Security and Disaster Management",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": "Human resources are a vital part of any organization. As an HR professional, you’ll be responsible for building a strong workforce through talent acquisition, compensation and benefits, employee relations, and training and development. This is a business-critical function that aligns with the organization’s overall strategy, objectives, and values.\n\nThe Bachelor of Science in Human Resource Management degree program at Post University offers a comprehensive curriculum designed to help you develop the essential skills you need to become an effective HR leader. You’ll explore current trends and best practices in human resources, including strategic planning, recruitment, performance management, and legal compliance. Our faculty members bring real-world experience to the classroom, providing you with practical insights and guidance. Whether you’re looking to advance your current career or start a new one, this program can help you achieve your goals.",
        "program website url": "https://post.edu/academics/bachelors-degrees/bachelor-of-science-in-human-resource-management/",
        "Accreditation status": "Accredited by the International Accreditation Council for Business Education (IACBE).",
        "Program name": "Bachelor's Degree in Human Resources",
        "Program Page url": "https://post.edu/blog/6-ways-technology-is-changing-the-face-of-human-resources/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Human Services",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor's Degree in Information Science",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Associate's Degree in Legal Studies",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": "Legal Nurse Consultant (LNC), Paralegal Studies",
        "description": "Pursue your career in the legal field with a Bachelor of Science (B.S.) in Legal Studies online degree from Post University. With two concentrations available, you can build a strong foundation of knowledge in legal theory and practice to take your career to the next level. Our B.S. in Legal Studies program offers two concentrations: Legal Nurse Consultant (LNC) or Paralegal Studies. We’ve designed a comprehensive curriculum that provides a well-rounded legal education focusing on areas of the law, including civil litigation, contract law, criminal law, family law, property law, legal research, and writing. When you earn a Legal Studies degree, you’ll be prepared for many career opportunities in the legal industry. As a student in our Legal Studies program, you’ll learn from faculty with extensive experience in the field. You’ll be prepared to demonstrate the following skills and abilities after graduation: Understand federal and state courts, judicial processes and administrative agencies; Identify ethical issues and responsibilities in the legal profession; Conduct legal research through primary and secondary sources; Draft legal documents relevant to the legal profession; Utilize technology in the legal profession.",
        "program website url": "https://post.edu/program/bachelors-degree-in-legal-studies/",
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Legal Studies",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor's Degree in Management Science",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Associate's Degree in Marketing",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Marketing",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Mental Health Counseling/Counselor",
        "Program Page url": "https://post.edu/financial-aid/tuition-fees/online/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Nursing Administration",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Parks, Recreation and Leisure Studies",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Psychology degree program at Post University is designed to help you understand the complexities of the human mind and behavior, and to provide you with the theoretical knowledge, research skills, and practical experience needed to pursue a variety of careers in psychology, social work, counseling, human resources, criminal justice, or education. With a blend of scientific inquiry, critical thinking, and ethical considerations, you’ll explore the underlying principles of human behavior, cognition, and emotion. The curriculum emphasizes evidence-based practices, psychological theories, and research methodologies, preparing you to analyze and interpret data, conduct ethical research, and apply psychological principles to real-world problems. Whether you aspire to work directly with individuals, contribute to research, or advance to graduate studies, our program offers a strong foundation for your future success. This program is offered on campus in Waterbury, CT and online.",
        "program website url": "https://post.edu/academics/undergraduate/bachelors-degree-psychology/",
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Psychology",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": "Public Administration",
        "description": "GCU’s Bachelor of Arts in Government with an Emphasis in Public Administration program explores the core concepts of government and how they apply to the public sector. As a BA in Government with an Emphasis in Public Administration student, you will learn the legal, political, administrative and economic foundations of public governance. The curriculum is designed to help you prepare for careers in public administration, including government and non-profit settings. This program is offered by the College of Humanities and Social Sciences. Through the government and public administration curriculum, you will delve into how governments function, the structure and organization of government bodies, legal, political, administrative and economic foundations of public governance, the role of public administrators in society, and best practices in public sector management. With a BA in Government with an Emphasis in Public Administration, you can apply your skills to careers in public administration, government agencies, non-profit organizations, policy analysis, and research.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Public Administration",
        "Program Page url": "https://www.gcu.edu/degree-programs/bachelor-arts-government-public-administration"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Sport and Fitness Management",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor's Degree in Sports Studies",
        "Program Page url": "https://en.wikipedia.org/wiki/Academic"
    }
]