[
    {
        "Concentration name": null,
        "description": "Are you a numbers person who loves solving puzzles? Do you want to work with clients and help them make better financial decisions? If you are detail-oriented and have strong critical thinking and analytical skills, a bachelor’s degree in accounting could be a great career path for you. Midway University’s Bachelor of Science in Accounting program prepares students for a career in both public and private accounting. You will learn how to analyze financial information, prepare taxes, audit financial statements, and manage financial data. Our curriculum emphasizes ethical decision-making, problem-solving, and communication skills, which are essential for success in the accounting profession. Whether you choose to work as a public accountant helping clients with a variety of accounting needs, or as a private accountant managing the finances of a single organization, Midway University’s Bachelor of Science in Accounting program can help you reach your goals. As a student in Midway University’s BS in Accounting program, you will study accounting information systems, financial accounting, managerial accounting, auditing, and tax. Our curriculum is designed to help you develop the knowledge and skills needed to become a successful accounting professional. We also offer several internship opportunities to gain valuable real-world experience before graduation. Upon graduation, you will be prepared for a wide range of entry-level accounting positions. For those interested in pursuing the Certified Public Accountant (CPA) license, our program provides a strong foundation for further study. It’s important to note that most states require 150 credit hours of college coursework to be eligible to sit for the CPA exam. Our advisors will work with you to develop an academic plan to meet these requirements.",
        "program website url": "https://degrees.midway.edu/bachelor-of-science-in-accounting.html",
        "Accreditation status": null,
        "Program name": "Accounting",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Agricultural Business and Management, General",
        "Program Page url": "https://www.tuitionrewards.com/colleges/513/midway-university"
    },
    {
        "Concentration name": null,
        "description": "Our Bachelor of Science (B.S.) in Biology provides students with the broad scientific background required to understand biological phenomena. With small class sizes, one-on-one attention from faculty, and hands-on learning experiences, students will be prepared for a variety of careers in health care, environmental science, research, and education. Graduates are also well-prepared for entry into graduate school or professional schools such as medical, dental, or veterinary school. The curriculum allows students to develop an understanding of the relationship between organismal and environmental interactions and to explore areas of molecular and cellular biology, organismal biology, and evolution and ecology. Midway University’s Biology graduates are also critical thinkers, problem solvers, and effective communicators, which are skills necessary to be successful in the workforce or in graduate school.",
        "program website url": "https://degrees.midway.edu/undergraduate-majors/biology-bs.html",
        "Accreditation status": null,
        "Program name": "Biology",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://degrees.midway.edu/undergrad-majors-landing-page.html",
        "Accreditation status": null,
        "Program name": "Biology (Minor)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University is excited to be the first Kentucky institution to offer a minor in Bourbon Studies. The minor provides students with a foundational knowledge of the bourbon industry and its impact on the state and national economy. The curriculum explores the historical, cultural, and scientific aspects of bourbon production, including its role in Kentucky's heritage. Students will gain an understanding of the business practices, marketing strategies, and regulatory frameworks unique to the bourbon industry. The program also delves into the sensory evaluation of bourbon, offering students the opportunity to develop their palate and appreciation for this iconic spirit. Additionally, students will learn about the agricultural aspects of bourbon, from grain selection to aging processes. This interdisciplinary minor prepares students for various career paths within the bourbon and hospitality industries, including distillery management, tourism, marketing, and entrepreneurship. Through a combination of coursework, hands-on experiences, and industry insights, students will be equipped with the knowledge and skills necessary to thrive in this growing sector. Program Description: The Bourbon Studies minor at Midway University offers a unique opportunity for students to explore the rich history, intricate science, and dynamic business landscape of Kentucky’s signature spirit. This interdisciplinary program is designed to provide a comprehensive understanding of the bourbon industry, from grain to glass. Students will delve into the historical evolution of bourbon, its cultural significance, and its profound economic impact. The curriculum covers the scientific principles behind distillation, aging, and sensory evaluation, allowing students to develop a sophisticated appreciation for bourbon’s complexities. Furthermore, the program examines the business and marketing strategies employed within the industry, along with the regulatory environment that shapes its operations. Field experiences, guest speakers from the industry, and opportunities for practical application are integral components, ensuring students gain real-world insights and connections. This minor is ideal for students interested in careers in distillery operations, tourism, hospitality, marketing, sales, and entrepreneurship within the thriving bourbon sector.",
        "program website url": "https://degrees.midway.edu/bourbon-studies-minor.html",
        "Accreditation status": null,
        "Program name": "Bourbon Studies (Minor)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Our Bachelor of Business Administration (BBA) degree prepares students for various roles in business settings and beyond. We focus on providing a thorough understanding of management principles and practices, accounting, finance, marketing, and business law concepts. Whether you wish to work in the private sector, nonprofit, or government, our business administration program will provide the knowledge and skills necessary for success in a competitive global market. You’ll be prepared to lead, manage, and innovate in a variety of industries.",
        "program website url": "https://degrees.midway.edu/undergraduate-programs/business-administration.html",
        "Accreditation status": null,
        "Program name": "Business Administration",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Human Resource Management",
        "description": "The Human Resource Management concentration is designed for students seeking to develop knowledge and skills to manage an organization’s most valuable asset—its human capital. Graduates will be prepared for a variety of entry-level and mid-level human resource positions. Courses within this concentration focus on topics such as employment law, compensation and benefits, performance management, employee relations, and talent acquisition. Students will also gain an understanding of strategic human resource management, diversity and inclusion, and HR analytics.",
        "program website url": "https://degrees.midway.edu/undergrad-business-administration.html",
        "Accreditation status": null,
        "Program name": "Business Administration - Human Resource Management",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Leadership",
        "description": "In Midway University’s Bachelor of Business Administration program, you will learn the fundamentals of business, including accounting, economics, finance, management, and marketing. You will gain knowledge and skills to lead and manage an organization effectively in both for-profit and non-profit industries. Our experienced faculty brings real-world experience to the classroom and are committed to helping you develop the skills necessary to become a successful business professional. Midway offers five concentrations to enhance your career opportunities even more. Each concentration helps prepare you for specific career fields. Students pursuing the Leadership concentration will develop the skills necessary to influence and motivate others. They will learn how to build effective teams, make strategic decisions, and drive organizational change. Graduates with this concentration will be prepared for leadership roles in various industries, including management, consulting, and human resources.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/business-administration.html",
        "Accreditation status": null,
        "Program name": "Business Administration - Leadership Concentration",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/business-administration.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://degrees.midway.edu/undergrad-majors-landing-page.html",
        "Accreditation status": null,
        "Program name": "Chemistry (Minor)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Coaching & Sport Leadership degree program at Midway University is for students who want to develop strong leadership and coaching skills to prepare them for careers in sport-related fields. This program is a collaborative effort between the Midway University School of Health Sciences and the Midway University Department of Athletics. Students will learn how to effectively lead and motivate athletes, manage athletic programs, and apply sound ethical and legal principles to sport. Coursework includes sport psychology, athletic administration, coaching methods, and legal aspects of sport. Graduates of this program will be well-prepared for roles as coaches, athletic administrators, sport program managers, and other leadership positions within the sports industry.",
        "program website url": "https://degrees.midway.edu/coaching-and_sports.html",
        "Accreditation status": null,
        "Program name": "Coaching and Sport Leadership",
        "Program Page url": "https://degrees.midway.edu/coaching-and_sports.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s Bachelor of Science (BS) in Computer Science program focuses on providing students with a strong foundation in computer science theory and practical skills in programming, software development, data management, and cybersecurity. Our curriculum is designed to prepare students for a wide range of careers in the technology industry, including software engineering, data analysis, network administration, and cybersecurity analysis. The program emphasizes hands-on learning, problem-solving, and critical thinking, equipping graduates with the knowledge and abilities to adapt to new technologies and excel in a rapidly evolving field. Beyond technical proficiency, the program also cultivates essential soft skills such as teamwork, communication, and ethical reasoning, which are crucial for success in professional environments. Whether you aspire to develop innovative software, protect digital assets, or harness the power of data, the Computer Science program at Midway University offers a robust and relevant education to help you achieve your goals. Why choose Computer Science at Midway University? Comprehensive Curriculum: A well-rounded curriculum covering core computer science principles, programming languages, algorithms, data structures, operating systems, networking, databases, and cybersecurity. Hands-on Learning: Practical experience through lab assignments, projects, and potential internship opportunities, allowing students to apply theoretical knowledge to real-world scenarios. Experienced Faculty: Learn from dedicated faculty members with academic credentials and industry experience, providing valuable insights and mentorship. Career Preparation: Prepare for diverse career paths in software development, data science, network security, IT management, and more. Small Class Sizes: Benefit from individualized attention and a supportive learning environment. Program Learning Outcomes: Apply knowledge of computing and mathematics to solve complex problems. Analyze a problem, and identify and define the computing requirements appropriate to its solution. Design, implement, and evaluate a computer-based system, process, component, or program to meet desired needs. Function effectively on teams to accomplish a common goal. Understand professional, ethical, legal, security, and social issues and responsibilities. Communicate effectively with a range of audiences. Recognize the need for and an ability to engage in continuing professional development. Use current techniques, skills, and tools necessary for computing practice.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/computer-science.html",
        "Accreditation status": null,
        "Program name": "Computer Science",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/computer-science.html"
    },
    {
        "Concentration name": null,
        "description": "Criminal Justice is a robust field that aims to protect society from crime through the prevention, detection, and investigation of crimes, the apprehension and prosecution of criminals, and the incarceration and rehabilitation of convicted offenders. The Criminal Justice program at Midway University is designed to help students understand the complexity of crime, criminals, and society’s response to these challenges. Students will gain a solid foundation in the various components of the criminal justice system – law enforcement, the judicial system, and corrections. Students will also be exposed to diverse topics such as criminal behavior, forensic psychology, drug use, victimology, and homeland security. The program features two distinct tracks: a traditional, campus-based program and a fully online program designed for working adults seeking to complete their degree.",
        "program website url": "https://degrees.midway.edu/undergrad-majors/criminal-justice-ba.html",
        "Accreditation status": null,
        "Program name": "Criminal Justice",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "The Data Analytics (BS) major at Midway University offers students the opportunity to develop a unique blend of mathematical, statistical, computer science, and business skills in a market that continues to grow. Data analytics focuses on the analysis and interpretation of data, which informs real-world decision-making across industries. This interdisciplinary major provides students with the knowledge and practical skills needed to collect, process, analyze, and interpret large datasets to discover insights, solve complex problems, and make data-driven decisions. The curriculum emphasizes both theoretical understanding and hands-on application, preparing graduates for successful careers as data analysts, business intelligence analysts, data scientists, and other related roles in various sectors such as healthcare, finance, marketing, and technology.",
        "program website url": "https://degrees.midway.edu/data-analytics-bs-major.html",
        "Accreditation status": null,
        "Program name": "Data Analytics",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s Elementary Education program trains students to be highly effective teachers in today’s diverse classrooms. Students are prepared to teach grades P-5 through a combination of coursework and field experiences including student teaching. Our faculty are experts in the field and passionate about preparing the next generation of teachers. They foster a supportive and challenging environment for our students. Our degree is designed to lead to Kentucky teacher certification for grades P-5.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/elementary-education.html",
        "Accreditation status": null,
        "Program name": "Education (Elementary)",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/elementary-education.html"
    },
    {
        "Concentration name": null,
        "description": "Do you love working with middle school-aged children and want to help them grow and learn? Earn your degree in Middle School Education at Midway University! As an educator, you’ll have the opportunity to positively impact the lives of countless young students. The Middle School Education program at Midway University is designed to equip you with the knowledge and skills necessary to teach students in grades 5-9 in specific content areas. Our curriculum offers a blend of theoretical knowledge, practical teaching methods, and hands-on experience through practicum and student teaching experiences. Graduates are prepared for careers as middle school teachers in various settings, including public and private schools. You will choose a specific concentration within the program, such as Biology, English, Mathematics, or Social Studies. Upon successful completion of the program and passing the required Praxis exams, students are recommended for initial teacher certification in Kentucky.",
        "program website url": "https://degrees.midway.edu/undergrad-majors/education/middle-school.html",
        "Accreditation status": "Approved by the Education Professional Standards Board (EPSB) of Kentucky.",
        "Program name": "Education (Middle School)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "English",
        "description": "The Middle School Education program at Midway University prepares students to teach in grades 5-9. Students completing the program will be eligible for licensure in Kentucky with an emphasis in English, Social Studies, Mathematics, or Science. Graduates are prepared for a variety of roles within the middle school setting. The program focuses on developing effective instructional strategies, classroom management, and a deep understanding of middle school adolescent development. Students will engage in practical field experiences, including student teaching, to gain real-world teaching experience. Upon successful completion of the program, students will possess the knowledge, skills, and dispositions necessary to be effective middle school educators.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/middle-school-education.html",
        "Accreditation status": "Midway University’s teacher education programs are approved by the Kentucky Education Professional Standards Board (EPSB). Students completing the Middle School Education program will meet the requirements for initial teacher licensure in grades 5-9 in the Commonwealth of Kentucky in their chosen area of emphasis.",
        "Program name": "Middle School Education - English (Area of Emphasis)",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/middle-school-education.html"
    },
    {
        "Concentration name": "Math (Area of Emphasis)",
        "description": "With a Middle School Education degree with an Area of Emphasis in Mathematics from Midway University, you will have the knowledge and skills necessary to teach math to students in grades 5-9 in Kentucky public and private schools. You will gain extensive knowledge of mathematics content including algebra, geometry, statistics, and calculus. Additionally, you will learn how to design, implement, and evaluate effective math instruction that is engaging and relevant for middle school-aged students. Our program will also help you develop critical thinking, problem-solving, and communication skills to successfully teach in diverse classroom settings. The program will prepare you to pass the Praxis II Content Exam in Mathematics and the Principles of Learning and Teaching (PLT) 5-9 exam.",
        "program website url": "https://degrees.midway.edu/middle-school-education-math-area-of-emphasis.html",
        "Accreditation status": "Midway University’s Teacher Education Program has been granted accreditation by the Kentucky Education Professional Standards Board (EPSB).",
        "Program name": "Middle School Education - Math (Area of Emphasis)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Science (Area of Emphasis)",
        "description": "Midway University offers a Bachelor of Arts (BA) in Middle School Education, preparing students to teach middle grades (5-9) in Kentucky in the subject areas of Math, English, Social Studies, or Science. Students pursuing this degree must choose two areas of emphasis in which to be certified. Midway University also offers a Master of Arts in Education (MAEd) with middle school tracks, including Initial Certification and Rank Change for those who wish to earn a master’s degree and teach in the middle grades.\nMidway University students enjoy a high rate of success on the PRAXIS exams and securing teaching positions after graduation.\nCoursework for the program provides a strong content background, as well as hands-on experience in teaching methods. Field experiences begin early in the program and culminate in a 16-week student teaching internship. Our graduates are highly prepared to lead in classrooms throughout the Commonwealth of Kentucky and beyond.\nThis program is offered in a traditional format on our Midway campus.",
        "program website url": "https://degrees.midway.edu/undergraduate-majors/middle-school-education/",
        "Accreditation status": "The teacher education programs are approved by the Education Professional Standards Board (EPSB) of Kentucky for teacher certification.",
        "Program name": "Middle School Education - Science (Area of Emphasis)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Social Studies (Area of Emphasis)",
        "description": "Midway University offers a Bachelor of Arts degree in Middle School Education with areas of emphasis in English, Mathematics, Science, and Social Studies. Our program prepares future educators to meet the unique needs of 5th through 9th graders, providing them with the knowledge and skills necessary for success in this critical developmental stage. Graduates of our program are equipped with strong content area expertise, pedagogical skills, and practical experience gained through extensive field placements and student teaching. Our faculty, composed of experienced educators, are dedicated to fostering a supportive and engaging learning environment where students develop into confident and effective teachers.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/middle-school-education.html",
        "Accreditation status": "Approved by the Kentucky Education Professional Standards Board (EPSB).",
        "Program name": "Middle School Education - Social Studies (Area of Emphasis)",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/middle-school-education.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://degrees.midway.edu/undergrad-majors-landing-page.html",
        "Accreditation status": null,
        "Program name": "Education (Secondary)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Biology",
        "description": "Do you want to share your passion for learning and make a difference in the lives of adolescents? Secondary education is one of the most fulfilling careers you can choose! Our program allows students to earn their Bachelor of Arts in Secondary Education, along with initial certification from the Kentucky Education Professional Standards Board (EPSB) to teach grades 8-12 in one of the following areas: Biology, English, Mathematics, or Social Studies. The Secondary Education program at Midway University is built on current research and best practices. As a Secondary Education student at Midway University, you will have a wide range of field experiences where you will gradually increase your time in actual classrooms. Midway University students observe, assist, teach small groups, and finally, student teach in either a semester-long or year-long placement, gaining valuable experience for a smooth transition into your first classroom.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/secondary-education.html",
        "Accreditation status": null,
        "Program name": "Secondary Biology Education",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/secondary-education.html"
    },
    {
        "Concentration name": null,
        "description": "The English Education program at Midway University prepares students to become highly qualified, effective English teachers in grades 8-12. Our curriculum combines a strong foundation in English language and literature with pedagogical theory and practical teaching experiences. Students will develop their critical thinking, writing, and communication skills while learning best practices for classroom management, instructional design, and assessment. The program includes extensive field experiences and student teaching, ensuring graduates are well-prepared to meet the demands of today’s diverse high school English classrooms.",
        "program website url": "https://degrees.midway.edu/undergraduate-majors/english-education-8-12.html",
        "Accreditation status": "Approved by the Education Professional Standards Board (EPSB) of Kentucky.",
        "Program name": "Secondary English Education",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Secondary Mathematics Education",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Education Studies",
        "Program Page url": "https://www.quora.com/What-is-the-difference-between-academics-and-education"
    },
    {
        "Concentration name": "English",
        "description": "Midway University offers a Bachelor of Arts degree in Education Studies. This degree is designed for those students who want to become educators, but do not want to go through the traditional teacher certification process required for teaching in public school settings. Education Studies majors are ideal for students who want to work in private schools, higher education settings, corporate training, non-profit organizations, or other education-related fields. The Education Studies program provides students with a strong liberal arts background along with knowledge and skills in various educational areas including foundations of education, educational psychology, educational technology, curriculum development, and assessment. Students will also gain field experience in various educational settings. Students concentrating in English will develop knowledge and skills in literary analysis, composition, and various genres of literature. Graduates will be prepared to teach English in various settings or pursue further graduate studies in English or related fields.",
        "program website url": "https://www.midway.edu/academics/undergraduate/education-studies/",
        "Accreditation status": "Midway University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate, baccalaureate, and master’s degrees.",
        "Program name": "Education Studies - English (Concentration)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Math",
        "description": "Midway University’s Bachelor of Arts in Education Studies (BAES) offers students the opportunity to learn best practices for teaching in various settings. Students enrolled in this program may apply to pursue an initial teaching certification with the Kentucky Education Professional Standards Board (EPSB) once they have completed the BAES and subsequently completed the Master of Arts in Teaching (MAT) or Master of Arts in Education (MAED) from Midway University or another institution. This pathway is perfect for students who want to enter the field of education but aren’t yet ready to commit to teaching in a public school. It’s also ideal for those who desire to work in other settings such as private schools, community-based educational organizations, or higher education support programs.",
        "program website url": "https://degrees.midway.edu/program_pages/education-studies-ba-online.html",
        "Accreditation status": "Midway University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate, baccalaureate, and master’s degrees. Teacher preparation programs are accredited by the Kentucky Education Professional Standards Board (EPSB).",
        "Program name": "Education Studies - Math (Concentration)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s Bachelor of Arts in Education Studies prepares individuals for a variety of roles within education fields that do not require state licensure to teach in a traditional classroom setting. This program is for students who are passionate about learning and exploring the broader field of education from a non-licensure perspective. The Education Studies program includes a core of education courses, general education coursework, and an area of concentration. Students can select concentrations in Biology, Business, Chemistry, English, Mathematics, or Social Studies. Graduates are prepared for a variety of roles, including but not limited to, museum educator, parks and recreation educator, corporate trainer, and school paraprofessional. Students interested in pursuing teaching licensure may be eligible to apply for Midway University's Master of Arts in Teaching (MAT) program.",
        "program website url": "https://degrees.midway.edu/education-studies-ba/",
        "Accreditation status": null,
        "Program name": "Education Studies - Science (Concentration)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Social Studies",
        "description": "The Bachelor of Arts in Education Studies program with a concentration in Social Studies at Midway University is designed for students who are passionate about history, civics, geography, and economics, and who aspire to a career where they can share this passion with others. This program prepares students for roles in educational settings, youth development programs, museums, and other community organizations where a deep understanding of social sciences and educational principles is valued. Students in this concentration develop a strong foundation in various social science disciplines, combined with pedagogical knowledge and skills essential for effectively engaging diverse learners. The curriculum emphasizes critical thinking, research, and communication, ensuring graduates are well-equipped to promote civic responsibility and a comprehensive understanding of human societies. Whether you aim to teach in private schools, lead educational initiatives in non-profits, or contribute to public discourse, this program provides the academic rigor and practical experience necessary for success.",
        "program website url": "https://degrees.midway.edu/education-studies-social-studies.html",
        "Accreditation status": null,
        "Program name": "Education Studies - Social Studies (Concentration)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Penn Foster's online Bachelor's Degree in Criminal Justice is designed to help students prepare for a career in law enforcement or corrections. The self-paced online program allows students to complete coursework on their schedule, making it ideal for working adults or those with busy lives. Throughout the studies, students will develop critical skills and a deeper understanding of the American criminal justice system. The curriculum covers topics such as criminal investigation, forensics, cybercrime, criminology, juvenile justice, and more, as well as how the American criminal justice system operates and the theories behind crime and criminal behavior. The program provides comprehensive, interactive courses and study materials to prepare students for success in the field, helping them take the first steps toward a new career or advance in their current one.",
        "program website url": "https://www.pennfoster.edu/programs/legal/criminal-justice-bachelors-degree",
        "Accreditation status": "Penn Foster College is nationally accredited by the Distance Education Accrediting Commission (DEAC) and is a Candidate for Accreditation by the Middle States Commission on Higher Education (MSCHE). The Bachelor of Science in Criminal Justice program is not programmatically accredited.",
        "Program name": "Emergency Management/Homeland Security",
        "Program Page url": "https://www.pennfoster.edu/programs/legal/criminal-justice-bachelors-degree"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s English program will provide you with a comprehensive understanding of literature, writing, and critical analysis. In this program, students explore diverse literary traditions, genres, and historical periods, developing strong analytical, research, and communication skills. The curriculum emphasizes close reading, effective written and oral expression, and the application of theoretical approaches to texts. Graduates are prepared for a wide range of careers in fields such as education, publishing, journalism, law, public relations, and graduate studies.",
        "program website url": "https://degrees.midway.edu/academics/undergraduate-programs/majors/english-ba.html",
        "Accreditation status": null,
        "Program name": "English",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University's Bachelor of Science in Environmental Science degree provides students with a broad and interdisciplinary understanding of environmental issues. It is designed to prepare students for careers addressing environmental problems using the principles of natural sciences. Students will gain experience in the field, laboratory, and classroom settings. Through field and lab work, students learn to apply environmental principles, evaluate policies, and develop solutions. This interdisciplinary program prepares students for various careers including environmental scientist, consultant, policy analyst, or educator. Our graduates are equipped to address challenges in areas like conservation, sustainability, and public health.",
        "program website url": "https://www.midway.edu/academics/undergraduate/environmental-science/",
        "Accreditation status": null,
        "Program name": "Environmental Science",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University is synonymous with equine education. Our campus sits in the heart of Kentucky’s legendary Bluegrass Region, providing students with countless opportunities to gain hands-on experience in one of the world’s largest horse industries. The Equine Business and Sales program focuses on training future equine professionals in business and sales skills directly applicable to the horse industry. Whether you are passionate about a particular breed, discipline, or simply the business of horses, Midway University has opportunities for you. Our students are prepared to be leaders in the industry by being equipped with the critical business and sales skills that are essential to operate and manage a successful equine business. Students are introduced to the various aspects of the equine industry and focus on areas such as equine law, business principles, marketing, sales, and management. Students also benefit from internship opportunities with equine organizations in the surrounding area.",
        "program website url": "https://degrees.midway.edu/equine-business-sales-bs.html",
        "Accreditation status": null,
        "Program name": "Equine Business and Sales",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University is one of the few institutions in the nation to offer an Equine Studies Bachelor of Science Degree. Our program encompasses a broad base of courses that allows students to focus their studies in many areas of the equine industry. Located in the heart of Kentucky’s Bluegrass region, students benefit from a variety of internship opportunities and a strong network within the industry. Through hands-on experience and a relevant curriculum, students will develop the skills to succeed in diverse careers, including equine management, equine science, equine rehabilitation, and equine training and instruction.",
        "program website url": "https://degrees.midway.edu/undergrad-majors-equine-studies.html",
        "Accreditation status": null,
        "Program name": "Equine Studies",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s Bachelor of Science (BS) in Exercise Science program is designed to provide students with a comprehensive understanding of human movement, physiology, biomechanics, and nutrition. Our curriculum focuses on preparing students for successful careers in various health and fitness fields, as well as for further graduate studies in allied health professions. Through a combination of rigorous coursework, hands-on laboratory experiences, and practical internships, students will develop the knowledge and skills necessary to assess, design, and implement exercise programs for diverse populations. Graduates are well-prepared for roles as personal trainers, strength and conditioning coaches, wellness coordinators, exercise physiologists, and sports performance specialists. The program also serves as an excellent foundation for those interested in pursuing advanced degrees in physical therapy, occupational therapy, chiropractic, medicine, and other health-related fields.",
        "program website url": "https://www.midway.edu/exercise-science-bs.html",
        "Accreditation status": null,
        "Program name": "Exercise Science",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University announced today that it will begin offering a new Bachelor of Arts (BA) degree in Game Studies and Design beginning in the Fall of 2024 semester. The new program will teach students the principles of game design and development including game art, level design, coding, game production, and narrative design. Graduates of the program will be prepared to enter the workforce in the burgeoning gaming industry or pursue advanced degrees. Students will learn the essential skills to create and develop interactive experiences, understand game theories, apply design principles, and develop a portfolio of work that demonstrates their abilities in various aspects of game design and production. “We are thrilled to launch the Game Studies and Design program, as it represents our commitment to providing innovative and relevant educational opportunities for our students,” said Dr. Celeste Rynders, Vice President of Academic Affairs. “The gaming industry is booming, and this program will equip our graduates with the knowledge and skills needed to thrive in this dynamic field.” The Game Studies and Design program aims to provide a comprehensive curriculum that combines artistic creativity with technical expertise. Students will have access to state-of-the-art facilities and experienced faculty who are passionate about gaming and education. The program emphasizes hands-on learning, collaboration, and critical thinking, preparing students for successful careers as game designers, developers, artists, writers, and producers.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Game Studies and Design",
        "Program Page url": "https://www.midway.edu/news/2024/game_design-press_release.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s Bachelor of Business Administration (BBA) in Healthcare Administration program is designed to provide students with the foundational business knowledge and specialized skills needed to succeed in the dynamic and growing healthcare industry. This program focuses on the unique challenges and opportunities within healthcare management, preparing graduates for a variety of administrative roles in hospitals, clinics, long-term care facilities, and other healthcare organizations.\nStudents in the BBA in Healthcare Administration program will gain expertise in areas such as healthcare policy, finance, human resources, operations, and strategic planning within a healthcare context. The curriculum emphasizes ethical decision-making, leadership, and communication skills essential for navigating the complexities of the healthcare environment. Graduates will be equipped to contribute to the efficient and effective delivery of healthcare services, improve patient outcomes, and adapt to evolving industry standards and regulations.",
        "program website url": "https://degrees.midway.edu/bachelor-of-business-administration-in-healthcare-administration.html",
        "Accreditation status": null,
        "Program name": "Health Care Administration",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Students interested in pursuing careers in areas such as Dentistry, Optometry, Pharmacy, Physical Therapy, Occupational Therapy, Physician Assistant, and Public Health will benefit from the coursework designed to prepare them for professional programs. Midway University offers individualized advising for these students to ensure they are taking the necessary prerequisite coursework for their intended field of study. Students typically major in a science, such as Biology, and utilize the Health Service Preparatory Studies advising track to plan their course of study.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/pre-professional-programs.html",
        "Accreditation status": null,
        "Program name": "Health Service Preparatory Studies",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/pre-professional-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Interdisciplinary Studies is designed for the student who wants to obtain a broad-based liberal arts education while exploring academic subjects of particular interest. This degree is specifically structured for the student who wishes to combine a minimum of two academic fields that align with their career goals. Choose two emphasis areas from a broad list of academic disciplines in order to develop an individual course of study. The Bachelor of Arts in Interdisciplinary Studies degree offers a highly customizable program that enables students to pursue their interests across multiple disciplines. You’ll choose two emphasis areas from a broad list of academic disciplines and work with a faculty advisor to create a unique degree plan tailored to your career aspirations. This program offers a unique blend of flexibility, academic rigor, and career relevance, making it an ideal choice for students seeking a versatile and marketable education. This degree is also offered fully online, providing students the flexibility to complete their studies from anywhere.",
        "program website url": "https://degrees.midway.edu/bachelor-of-arts-in-interdisciplinary-studies.html",
        "Accreditation status": null,
        "Program name": "Interdisciplinary Studies",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Liberal Arts and Humanities",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/index.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Marketing Communications",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Graphic Design",
        "description": "Our Bachelor of Arts (BA) in Marketing Communications prepares you to excel in the dynamic world of marketing and public relations. You’ll develop a strong understanding of foundational marketing principles, advertising strategies, public relations tactics, and communication techniques essential for building compelling brand narratives and engaging audiences across various platforms. Students will explore market research, consumer behavior, digital marketing, content creation, and strategic communications, gaining practical skills through hands-on projects and real-world case studies. Students pursuing the Graphic Design specialization will focus on visual communication and design principles, preparing them for roles in graphic design, web design, and multimedia production.",
        "program website url": "https://degrees.midway.edu/marketing-communications.html",
        "Accreditation status": null,
        "Program name": "Marketing Communications - Graphic Design (Specialization)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Writing",
        "description": "Marketing Communications combines the skills of communication with the strategic application of marketing theories to create effective brand messages, campaigns, and content. The Writing Specialization prepares students for a variety of roles in the marketing and communications fields that require strong writing skills. Graduates of this program will be equipped for careers in content creation, copywriting, public relations, social media management, technical writing, and more. This program is ideal for students who want to blend their passion for writing with the dynamic world of marketing and communications.",
        "program website url": "https://degrees.midway.edu/marketing-communications-writing-specialization-bachelor-of-arts.html",
        "Accreditation status": null,
        "Program name": "Marketing Communications - Writing (Specialization)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "A degree in Mathematics prepares students for a variety of careers in fields such as engineering, education, finance, and technology. This program offers a rigorous curriculum that covers essential mathematical concepts, including calculus, linear algebra, differential equations, and statistics. Graduates will develop strong analytical and problem-solving skills, making them highly sought after in today’s data-driven world. Additionally, the Mathematics program at Midway University provides a solid foundation for further graduate studies.",
        "program website url": "https://www.midway.edu/academics/undergraduate/mathematics-bs/",
        "Accreditation status": null,
        "Program name": "Mathematics",
        "Program Page url": "https://www.midway.edu/campaigns/stem.html"
    },
    {
        "Concentration name": null,
        "description": "The Music Minor at Midway University allows students to explore music theory and history, ensemble performance, and applied studies. It provides a foundation in music for students pursuing other academic interests while still engaging with the arts.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/music.html",
        "Accreditation status": null,
        "Program name": "Music (Minor)",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/music.html"
    },
    {
        "Concentration name": "General Music",
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Music (Minor) - General Music (Track)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Music Education Track",
        "description": "The Music Minor with a Music Education Track is designed for students who desire to teach music in grades P-12. The minor provides a foundation in music theory, history, and performance, along with specialized coursework in music education methods, curriculum development, and classroom management. Students will gain practical experience through field placements and student teaching opportunities. Graduates of this track will be prepared to pursue state licensure as a music educator.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/music-minor-music-education-track.html",
        "Accreditation status": null,
        "Program name": "Music (Minor) - Music Education (Track)",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/index.html"
    },
    {
        "Concentration name": "Music Therapy",
        "description": "Midway University is the only college or university in Central Kentucky that offers a music therapy track. Music therapy is the clinical and evidence-based use of music interventions to accomplish individualized goals within a therapeutic relationship by a credentialed professional who has completed an approved music therapy program. This track will prepare you for a graduate degree in music therapy.",
        "program website url": "https://degrees.midway.edu/undergraduate/music-minor.html",
        "Accreditation status": null,
        "Program name": "Music (Minor) - Music Therapy (Track)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Performance Track",
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Music (Minor) - Performance (Track)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s Associate Degree Nursing (ADN) program prepares you to become a Registered Nurse (RN) and practice in a variety of healthcare settings. In this program, you will develop the knowledge, skills, and values required to provide quality patient-centered nursing care. Upon completion of the program, you will be eligible to apply to take the National Council Licensure Examination (NCLEX-RN) for licensure as a registered nurse.",
        "program website url": "https://www.midway.edu/academics/undergraduate-programs/nursing-adn/",
        "Accreditation status": "The Associate Degree Nursing program at Midway University is approved by the Kentucky Board of Nursing (KBN), 312 Whittington Pkwy, Suite 300, Louisville, KY 40222; (502) 429-3300. In addition, the Associate Degree Nursing program is accredited by the Accreditation Commission for Education in Nursing (ACEN), 3390 Peachtree Road NE, Suite 1400, Atlanta, GA 30326, (404) 975-5000.",
        "Program name": "Nursing (ADN)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University offers a Bachelor of Science in Nursing (BSN) program designed for students who are ready to become registered nurses. Our pre-licensure track prepares students with no prior nursing experience for the NCLEX-RN exam. With a blend of classroom instruction, hands-on labs, and clinical experiences, students gain the knowledge and skills necessary to excel in a variety of healthcare settings. Our curriculum emphasizes critical thinking, evidence-based practice, and patient-centered care. Graduates are prepared to provide safe, compassionate, and effective nursing care to individuals, families, and communities. Key learning outcomes include: Assessing patient health status and developing individualized care plans; Administering medications and treatments safely and effectively; Utilizing critical thinking to make informed clinical decisions; Collaborating with interdisciplinary healthcare teams; Advocating for patients and promoting health and wellness; Demonstrating leadership skills in nursing practice; Integrating ethical principles into professional nursing practice.",
        "program website url": "https://www.midway.edu/academics/undergraduate-programs/nursing-prelicensure-bsn/",
        "Accreditation status": "The baccalaureate degree program in nursing at Midway University is accredited by the Commission on Collegiate Nursing Education (CCNE), 655 K Street NW, Suite 750, Washington, DC 20001, 202-887-6791. For more information, please visit the CCNE website.",
        "Program name": "Nursing (Prelicensure BSN)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Are you a Registered Nurse (RN) with an Associate degree or diploma in nursing who is looking to earn your Bachelor of Science in Nursing (BSN)? Midway University’s online RN-BSN program is designed to help you achieve your career goals. This program is for working professionals, with 100% online courses and no on-campus requirements. Midway University’s RN-BSN program prepares nurses to provide leadership, critical analysis and application of research in evidence-based practice and community health. The curriculum is built on a strong liberal arts foundation and includes courses in the natural, social, and behavioral sciences. Upon completion of the program, graduates will be able to: Synthesize knowledge from the liberal arts, sciences, and nursing to apply the nursing process for evidence-based practice; Utilize leadership skills, management concepts, and communication in professional nursing practice within a variety of health care settings; Integrate concepts of person-centered care for individuals, families, groups, communities, and populations into nursing practice; Apply knowledge of current healthcare policies, financial, and regulatory initiatives to improve quality and safety in diverse healthcare settings; Utilize research and information technology to improve healthcare outcomes; Demonstrate professional standards of moral, ethical, and legal conduct in the practice of nursing; Utilize professional communication, collaboration, and advocacy for individuals, families, groups, communities, and populations. The program includes clinical experiences that allow students to apply their knowledge and skills in real-world settings.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/rn-bsn.html",
        "Accreditation status": "The baccalaureate degree program in nursing at Midway University is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Bachelor's",
        "Program name": "Nursing (RN-BSN)",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/rn-bsn.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University offers a Bachelor of Science in Nursing (BSN) with a specialization in Nursing Administration. This fully online program builds upon an associate degree or diploma in nursing, preparing registered nurses (RNs) for leadership roles in various healthcare settings. The curriculum emphasizes management principles, healthcare policy, finance, and human resources, equipping graduates to effectively lead nursing teams and manage healthcare operations. It's designed for working RNs seeking career advancement and a deeper understanding of administrative aspects of nursing. Students in the Nursing Administration BSN program will develop skills in: Leadership and management in nursing, Healthcare policy and regulations, Budgeting and financial management in healthcare, Human resource management in nursing, Quality improvement and patient safety, Strategic planning and organizational development.",
        "program website url": "https://degrees.midway.edu/nursing-administration-bsn-degree.html",
        "Accreditation status": null,
        "Program name": "Nursing Administration",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Nursing Education Track",
        "description": "Midway University’s Master of Science in Nursing (MSN) is offered as a Nursing Education Track. This online program prepares nurses for roles as faculty in schools of nursing and staff educators in healthcare institutions. Upon completion of the MSN Nursing Education Track, students are eligible to sit for the National League for Nursing (NLN) Certified Nurse Educator (CNE) exam.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/msn.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master’s degree program in nursing, and post graduate APRN certificate program at Midway University are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Nursing Education",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/msn.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Physical Education Teaching and Coaching",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/coaching-and-sport-leadership.html"
    },
    {
        "Concentration name": null,
        "description": "Unlock the mysteries of the human mind. The Bachelor of Science (BS) in Psychology program at Midway University is designed to provide students with a deep understanding of human behavior, thought processes, and emotions. Through a blend of theoretical knowledge and practical application, students will explore various subfields of psychology, including cognitive, developmental, social, and abnormal psychology. This program prepares graduates for a wide range of career opportunities in mental health, social services, human resources, education, and research, or for advanced studies in graduate school.",
        "program website url": "https://degrees.midway.edu/undergrad-majors/bs-in-psychology.html",
        "Accreditation status": null,
        "Program name": "Psychology",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": "Alcohol and Drug Counseling",
        "description": "The Psychology program provides students with an understanding of human behavior through a scientific lens. Psychology majors are trained in the scientific method, the ethical guidelines for conducting research with humans and animals, and basic statistical analyses. The curriculum covers a wide range of psychological concepts including abnormal psychology, biological psychology, cognitive psychology, developmental psychology, and social psychology. This broad training provides students with a solid foundation for a variety of careers or graduate school. Students have the option to complete a general Psychology major or to choose one of two concentrations to better align with their career goals: Alcohol and Drug Counseling or Pre-Professional. Upon graduation, students can seek employment in settings such as mental health agencies, hospitals, human resource departments, or law enforcement. Graduates are also prepared for further education in graduate or professional school.",
        "program website url": "https://www.midway.edu/academics/undergraduate/psychology/",
        "Accreditation status": null,
        "Program name": "Psychology - Alcohol and Drug Counseling (Concentration)",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Our Public Health program offers an interdisciplinary approach to understanding and improving population health. Students learn to assess community health needs, develop evidence-based interventions, and advocate for health policy changes. The curriculum covers epidemiology, biostatistics, environmental health, health promotion, and global health, preparing graduates for diverse roles in public health agencies, non-profits, healthcare organizations, and research institutions. Emphasizing practical skills and ethical considerations, the program equips students to address pressing public health challenges and promote well-being in communities.",
        "program website url": "https://degrees.midway.edu/undergraduate-majors/public-health-bs.html",
        "Accreditation status": null,
        "Program name": "Public Health",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Are you interested in a career in sports? With a degree in Sport Management from Midway University, you can take your passion for sports and turn it into a profession. This multidisciplinary program combines business and sport-specific courses to prepare students for various careers in the sports industry. Students will gain a strong foundation in business principles, including marketing, finance, and management, while also exploring the unique aspects of the sports world, such as event planning, facility management, and sports law.",
        "program website url": "https://degrees.midway.edu/undergrad-majors/sport-management.html",
        "Accreditation status": null,
        "Program name": "Sport Management",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Sport Marketing degree at Midway University provides students with the foundational knowledge and skills to thrive in the dynamic and rapidly evolving sport industry. This program is ideal for individuals passionate about sports and business, offering a unique blend of theoretical learning and practical application. Students will gain expertise in various aspects of sport marketing, including brand management, sponsorship, event promotion, public relations, consumer behavior, and digital marketing strategies specific to the sport sector. Through a comprehensive curriculum, students will develop critical thinking, analytical, and communication skills essential for success in diverse roles within professional sports organizations, collegiate athletics, marketing agencies, and other sport-related businesses. The program emphasizes real-world application through case studies, internships, and opportunities to engage with industry professionals, preparing graduates to make an immediate impact in their chosen careers.",
        "program website url": "https://www.midway.edu/academics/majors-and-programs/sport-marketing.html",
        "Accreditation status": null,
        "Program name": "Sport Marketing",
        "Program Page url": "https://www.midway.edu/academics/majors-and-programs/sport-marketing.html"
    },
    {
        "Concentration name": null,
        "description": "Do you want a career that allows you to combine your passion for sports with your strong communication skills? The Bachelor of Arts in Sports Communication at Midway University helps prepare you for a variety of in-demand careers in this dynamic and growing field. From public relations and broadcasting to social media and digital content creation, our program helps you develop the skills and knowledge you need to succeed in the exciting world of sports communication. This unique program helps you craft skills in sports journalism, public relations, social media, and more. Our faculty bring real-world experience to the classroom, providing you with a practical education that prepares you for the challenges and opportunities of the sports communication industry. Through our comprehensive curriculum, you will learn to develop effective communication strategies for various sports organizations and audiences; write compelling sports stories, press releases, and digital content; utilize social media platforms to engage with fans and promote sports brands; understand the legal and ethical considerations in sports communication; create professional sports broadcasts and multimedia presentations; analyze sports data and trends to inform communication decisions; develop strong interview skills; and craft sports photography skills.",
        "program website url": "https://degrees.midway.edu/bachelor-of-arts-in-sports-communication-ba/",
        "Accreditation status": null,
        "Program name": "Sports Communication",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    },
    {
        "Concentration name": null,
        "description": "Midway University’s Bachelor of Business Administration (BBA) in Supply Chain Management prepares students to manage the flow of goods and services, from raw materials to consumer, in an efficient and timely manner. Through the program, students will learn to oversee the manufacturing and delivery of products, logistics, sourcing, purchasing, forecasting, inventory, and supply chain strategies. Demand for supply chain professionals continues to grow and Midway University’s graduates will be prepared for a wide range of careers.",
        "program website url": "https://degrees.midway.edu/academics/undergraduate/supply-chain-management-bba.html",
        "Accreditation status": null,
        "Program name": "Supply Chain Management",
        "Program Page url": "https://degrees.midway.edu/undergrad-majors-landing-page.html"
    }
]