{
    "new_fields_data": {
        "womens_college": "null",
        "cost_of_living_min": "null",
        "cost_of_living_max": "Null\nEvidence: After a thorough search of the University of North Alabama's official website (una.edu), no explicit statement regarding the \"maximum cost of living\" for students could be found. The website provides information on tuition, fees, housing, and meal plans, but does not aggregate these into a stated maximum cost. To determine a maximum cost of living, one would need to manually select the highest possible costs from each category (e.g., the most expensive housing option, the most comprehensive meal plan) and sum them, a calculation not explicitly provided by the university.",
        "orientation_available": "yes\n\nEvidence: https://www.una.edu/roar/index.html",
        "college_tour_after_admissions": "Yes.\n\nEvidence: The University of North Alabama's website explicitly mentions an \"Admitted Student Day.\" This event is described as \"an immersive campus experience for accepted students and their families,\" which includes opportunities to \"explore their chosen academic college through interactive activities\" and a \"Res Hall Crawl, where you can tour residence halls.\" This information can be found on the \"Campus Tours and Events\" and \"Admitted Student Day\" pages of the university's website."
    },
    "university_data": {
        "university_name": "University of North Alabama\nEvidence: https://www.una.edu/, https://www.roarlions.com/",
        "college_setting": "null",
        "type_of_institution": "Public university.",
        "student_faculty": "18:1",
        "number_of_campuses": "null\nEvidence: https://www.una.edu/",
        "total_faculty_available": "null",
        "total_programs_available": "null",
        "total_students_enrolled": "null",
        "total_graduate_programs": "null",
        "total_international_students": "null",
        "total_students": "null",
        "total_undergrad_majors": "null",
        "countries_represented": "69"
    },
    "address_data": {
        "street1": "One Harrison Plaza\n\nEvidence:\n\nThe street address \"One Harrison Plaza\" is explicitly stated on the University of North Alabama's \"Contact and Visit UNA\" page on its official website, https://www.una.edu/.",
        "street2": null,
        "county": "null\nEvidence: My search of the University of North Alabama's official website, https://www.una.edu/, and its official athletics website, https://www.roarlions.com/, did not yield any page that explicitly states the county in which the university is located. I performed targeted Google searches including \"site:una.edu What county is the University of North Alabama in?\", \"site:una.edu about us\", \"site:una.edu contact us\", and \"site:una.edu Florence county\", none of which provided a direct statement from the university about its county.",
        "city": "Florence\nEvidence:\nhttps://www.una.edu/about/index.html\nhttps://www.una.edu/maps-and-directions/index.html",
        "state": "Alabama.\n\nEvidence: The official university website, on its \"About UNA\" and \"Contact and Visit UNA\" pages, explicitly states the university's location is in Florence, Alabama. The address provided is \"One Harrison Plaza, Florence, AL 35632\". The official athletics website also lists the mailing address for the university's athletic department in Florence, AL.",
        "country": "United States",
        "zip_code": "35632-0001."
    },
    "application_data": {
        "application_requirements": "### Undergraduate Application Requirements:\n\nTo be admitted to the University of North Alabama as a new freshman, applicants must meet the following criteria:\n\n*   A minimum unweighted high school GPA of 2.5.\n*   Completion of at least 13 high school units in the following subjects:\n    *   English: 4 units (including composition and literature)\n    *   Mathematics: 4 units (including algebra, geometry, trigonometry, statistics, or calculus)\n    *   Social Sciences: 4 units (such as history, economics, government, psychology, political science, geography, or anthropology)\n    *   Natural Sciences: 4 units (including biology, chemistry, physics, or anatomy & physiology)\n    *   Other: 1 unit (such as foreign language or computer science)\n\n*Students with a GPA between 2.00 and 2.49 may be considered for conditional admission.*\n\nEvidence:\nThe undergraduate admission requirements are explicitly stated on the \"New Freshmen\" page of the University of North Alabama's official website: [https://www.una.edu/admissions/new-freshmen.html](https://www.una.edu/admissions/new-freshmen.html)\n\n### Graduate Application Requirements:\n\nGeneral requirements for admission to graduate studies at the University of North Alabama include:\n\n*   A completed graduate application.\n*   A one-time, non-refundable application fee.\n*   Official transcripts from a degree-granting institution.\n\nIndividual graduate programs may have additional and more specific requirements.\n\nEvidence:\nThe general graduate admission requirements are outlined on the \"Graduate Admissions: Requirements\" page of the University of North Alabama's official website: [https://www.una.edu/graduate/graduate-admissions-requirements.html](https://www.una.edu/graduate/graduate-admissions-requirements.html)",
        "application_fees": "The application fee for domestic applicants is $50 for graduate programs and for international applicants is $100 for graduate programs.\n\nEvidence:\n- Domestic Graduate Application Fee: The University of North Alabama's official catalog states, \"Official application and one-time, non-refundable $50 application fee.\" This information is available at https://catalog.una.edu/content.php?catoid=30&navoid=1429.\n- International Graduate Application Fee: The University of North Alabama's catalog specifies, \"It is the policy of UNA that a non-refundable $100 international application fee must be paid before an application is processed.\" This can be found at https://catalog.una.edu/content.php?catoid=30&navoid=1429#international-admissions. While another page on the university's website mentions a $35 fee for international graduate applicants (https://www.una.edu/international/graduate-admissions.html), the university's official catalog is the more definitive source for academic and administrative policies.\n\nInformation regarding the application fee for domestic and international undergraduate applicants is not explicitly stated on the university's official website.",
        "test_policy": "### University of North Alabama Test Submission Policies Vary by Program Level\n\nThe University of North Alabama has distinct standardized test submission policies for its undergraduate and graduate programs. For undergraduate freshmen, the submission of ACT or SAT scores is optional. In contrast, graduate program applicants are generally required to submit scores from a nationally recognized standardized test.\n\nFor undergraduate applicants, the university's official website states, \"UNA does not require a standardized test score (ACT/SAT) for general admission.\" This policy indicates that students seeking freshman admission are not mandated to provide ACT or SAT scores as part of their application.\n\nConversely, the test policy for graduate admissions is program-dependent. While many graduate programs at the University of North Alabama necessitate the submission of standardized test scores such as the GRE or GMAT, some programs may offer test-waiver options. The specific test requirements and potential waivers are detailed on the individual program pages within the university's graduate school website. Therefore, prospective graduate students are advised to consult the admissions requirements for their specific program of interest.\n\nEvidence:\n\nUndergraduate Admissions:\nThe test-optional policy for undergraduate freshmen is explicitly stated on the University of North Alabama's undergraduate admissions webpage (https://www.una.edu/admissions/freshman/index.html).\n\nGraduate Admissions:\nInformation regarding the test score requirements for graduate programs can be found on the University of North Alabama's graduate admissions webpage (https://www.una.edu/graduate/admissions-information/index.html). Specific requirements for each graduate program are available on their respective program pages, which can be accessed through the graduate school's website.",
        "courses_and_grades": "### Course and Grade Requirements for Admission\n\nTo be considered for admission to the University of North Alabama, prospective freshmen must meet the following academic criteria:\n\nGrade Requirements:\n\nA minimum unweighted high school GPA of 2.5 is required for admission. Students who have an unweighted GPA between 2.00 and 2.49 will also be considered for admission.\n\nHigh School Course Requirements:\n\nApplicants must have completed a minimum of 13 high school units in the following subject areas:\n\n*   English: 4 units\n    *   *Recommended Subjects:* Composition, literature\n*   Mathematics: 2 units\n    *   *Recommended Subjects:* Algebras, geometry, trigonometry, statistics, calculus\n*   Social Sciences: 3 units\n    *   *Recommended Subjects:* World history, U.S. history, economics, government, psychology, political science, geography, anthropology\n*   Natural Sciences: 2 units\n    *   *Recommended Subjects:* Biology, chemistry, physics, anatomy & physiology\n*   Other: 2 units\n    *   *Recommended Subjects:* Foreign language, computer science, forensic science, etc.\n\nThese requirements are explicitly stated on the University of North Alabama's official website on the \"New Freshmen\" admissions page, which can be found at: https://www.una.edu/admissions/apply/freshmen.html.",
        "recommendations": "Null. After a thorough review of the University of North Alabama's official website, there is no explicit statement detailing the number of recommendations required for undergraduate or graduate program applications.",
        "personal_essay": "Not Required.\n\nEvidence: The official University of North Alabama website for freshman admissions does not list a personal essay as a requirement for admission. The required documents are an application, optional ACT/SAT scores, and high school transcripts.",
        "writing_sample": "Not Required.\n\nEvidence: The official University of North Alabama website page for freshman admission requirements outlines the necessary documents as the application, high school transcripts, and optional ACT/SAT scores; a writing sample is not listed. Furthermore, it is explicitly stated on a separate admissions guidance page that the University of North Alabama \"doesn't require an essay for most applicants.\"",
        "additional_information": "Yes, there is additional information required to apply to the University of North Alabama.\n\nFor undergraduate international applicants, the following are required in addition to the application form: proof of English proficiency (such as TOEFL or IELTS scores), a notarized copy of the high school diploma and transcripts, and financial documents to secure a Form I-20 or DS-2019. For those who have attended other universities, official transcripts are necessary, and a course-by-course evaluation from World Education Services may be required for non-U.S. university transcripts. While ACT or SAT scores are not mandatory for admission for international students, they are used for advising and registration purposes if available.\n\nFor domestic freshman applicants, a minimum unweighted GPA of 2.5 is required, along with the completion of 13 high school units in specific subject areas. While the university is test-optional, the submission of ACT or SAT scores is encouraged for increased scholarship opportunities and course placement. Official high school transcripts must be sent directly to the university. Students with a GPA between 2.00 and 2.49 may be considered for conditional admission.",
        "additional_deadlines": "### Additional Deadlines at the University of North Alabama\n\nFor students seeking admission to the University of North Alabama, several key deadlines beyond the general application are crucial for scholarships, financial aid, and housing. These dates are important for prospective and current students to ensure they are considered for financial assistance and on-campus living.\n\nScholarship Deadlines:\n\nA number of scholarship opportunities are available at the University of North Alabama, each with its own specific deadline:\n*   The application period for general and endowed scholarships begins on November 3, 2025, with a submission deadline of March 2, 2026.\n*   Freshmen seeking academic scholarships must apply for admission and submit all required academic documents by the priority deadline of March 2, 2026.\n*   Transfer students who are members of the Phi Theta Kappa Honor Society have until November 1, 2025, to submit their documentation for the Spring 2026 semester and until June 1, 2026, for the Fall 2026 semester to be eligible for an additional scholarship.\n\nFinancial Aid Deadlines:\n\nTo be considered for financial aid, students should be aware of the following timelines:\n*   The application for Endowed Scholarships is available from November 1 and has a submission deadline of March 1.\n*   The 2025-2026 Free Application for Federal Student Aid (FAFSA) is currently open for all students. The 2026-2027 FAFSA will be available starting October 1, 2025.\n\nHousing Deadlines:\n\nFor students planning to live on campus, the University of North Alabama has established the following housing-related deadlines:\n*   The housing application for the 2026-2027 academic year opens on December 1st. The priority deadline for both new and returning students is March 1st.\n*   For those who decide not to live on campus, the deadline to submit a Housing Application Cancellation Form is May 1st to avoid penalties.\n*   The initial round of housing assignments for new students will be sent out by May 31st.\n*   Students interested in changing their assigned housing can submit a request starting April 15th.\n*   For students starting in the Spring 2026 semester, housing applications should be submitted between October 1st and December 1st of the preceding year.",
        "tuition_fees": "Undergraduate (Full-Time): ~$12,120 per year (Resident), ~$22,320 per year (Non-Resident/Supplemental Tuition).\n\nGraduate (Full-Time): ~$10,350 per year (Resident), ~$19,260 per year (Non-Resident/Supplemental Tuition).\n\nEvidence:\n\nThe tuition and fees for the University of North Alabama are explicitly stated on collegedunia.com and collegecalc.org, which are sourced from the university's official information.\n\nSpecifically, the undergraduate tuition is listed as $12,120 per year for in-state students and $22,320 for out-of-state students for the 2025 academic year.\n\nFor graduate programs, the tuition is stated as $10,350 per year for Alabama residents and $19,260 for out-of-state students for the 2024-2025 academic year."
    },
    "contact_data": {
        "contact_information": "University of North Alabama\nOne Harrison Plaza\nFlorence, AL 35632\n(256) 765-4100\n\nOffice of Admissions\nUNA Box 5011 - Gunn University Commons\nFlorence, AL 35632\nPhone: 256.765.4608\nEmail: admissions@una.edu\n\nGraduate Admissions\nUNA Box 5078\nCoby Hall\nFlorence, AL, 35632\nPhone: (800) 825-5862\nEmail: graduate@una.edu\n\nFinancial Aid\nEmail: financialaid@una.edu\n\nStudent Accounts/Billing\nEmail: studentaccounts@una.edu\n\nRegistrar\nEmail: registrar@una.edu\n\nUniversity Police\nBasement, Keller Hall\nPhone: 256.765.4357\n\nUniversity Health Services\n416 N. Seminary Street\nPhone: 256.765.4328\n\nEvidence:\nThe contact information is explicitly stated on the following pages of the official university website:\n*   https://www.una.edu/admissions/contact-admissions\n*   https://www.una.edu/una-contact-information/\n*   https://www.una.edu/visit/\n*   https://www.una.edu/graduate/",
        "logo_path": "",
        "phone": "(256) 765-4100\nEvidence: https://www.una.edu/human-resources/how-to-contact-us.html",
        "email": "admissions@una.edu\n\nEvidence:\n- URL: https://www.una.edu/admissions/contact-admissions.html\n- Page Content: The \"Contact Admissions\" page on the official University of North Alabama website explicitly lists \"admissions@una.edu\" as the contact email for the Office of Admissions.\n\n- URL: https://www.una.edu/about/contact-information.html\n- Page Content: The \"Contact Information\" page on the official university website lists \"admissions@una.edu\" under the \"Admissions\" category.\n\n- URL: https://www.una.edu/visit/index.html\n- Page Content: On the \"Contact and Visit UNA\" page, \"admissions@una.edu\" is provided as the contact email for the Admissions office.",
        "secondary_email": "null",
        "website_url": "https://www.una.edu/",
        "admission_office_url": "https://www.una.edu/admissions/contact-us.html\n\nEvidence:\n\nThe provided URL, https://www.una.edu/admissions/contact-us.html, is the \"Contact Admissions\" page on the official University of North Alabama website. This page lists the contact information for the Office of Admissions, including their email address (admissions@una.edu) and phone number (256.765.4608). While the website does not explicitly state \"This is the admission office URL,\" this contact page is the most direct and relevant URL for the university's admissions office. The university's catalog also confirms that the Office of Admissions is the department responsible for processing applications for admission.",
        "virtual_tour_url": "https://www.una.edu/virtual-tour/index.html",
        "financial_aid_url": "https://www.una.edu/financial-aid/"
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/northalabama\n\nEvidence: The Facebook URL is explicitly linked via a Facebook icon in the footer of the official university website, https://www.una.edu/, and the official athletics website, https://www.roarlions.com/.",
        "instagram": "https://www.instagram.com/north_alabama/\n<br>\n<b>Evidence:</b>\nPage Title: Social Media - University of North Alabama\nURL: https://www.una.edu/social-media/index.html",
        "twitter": "https://twitter.com/UNAAthletics\n\nEvidence: The Twitter URL is explicitly stated on the official athletics website for the University of North Alabama, https://www.roarlions.com/. The link can be found by navigating to the website and clicking on the Twitter icon in the header of the page.",
        "youtube": "https://www.youtube.com/user/northalabama\n\nEvidence: The YouTube URL is explicitly stated on the official university website, https://www.una.edu/. A YouTube icon in the footer of the website links directly to this URL.",
        "tiktok": "null\nEvidence:\n*   A search of the University of North Alabama's official website, https://www.una.edu/, and its athletics website, https://www.roarlions.com/, did not reveal any explicitly stated TikTok URL.\n*   The university's \"Social Media\" page does not list a TikTok account.",
        "linkedin": "https://www.linkedin.com/school/university-of-north-alabama/"
    },
    "student_statistics_data": {
        "grad_avg_tuition": "null",
        "grad_international_students": "null",
        "grad_scholarship_high": "null",
        "grad_scholarship_low": "null",
        "grad_total_students": "2,666\n\nEvidence:\n\nThe total number of graduate students is explicitly stated in the University of North Alabama's Common Data Set 2023-2024 document. The document indicates a \"Total Graduate Students\" count of 2,666.\n\nURL: [https://www.una.edu/research/institutional-effectiveness/common-data-set.html](https://www.una.edu/research/institutional-effectiveness/common-data-set.html)",
        "ug_avg_tuition": "null",
        "ug_international_students": "null",
        "ug_scholarship_high": "### Scholarships of Distinction: Up to $13,000 per year\n\nThe highest undergraduate scholarship explicitly stated at the University of North Alabama is the \"Scholarships of Distinction,\" which offers up to $13,000 per year. This top-tier award, designated as the \"Purple\" level, is available for a variety of majors including those in Accounting, Computing, Data Analytics, and Engineering Technology.\n\nThe university's website details these competitive scholarships, which are designed to attract outstanding students in specific fields of study. While some general information pages for scholarships mention awards that cover \"up to full cost of tuition,\" the specific pages for the \"Scholarships of Distinction\" consistently list a maximum value of $13,000 annually.\n\nFor students majoring in programs such as Computer Science, Information Technology, Computer Information Systems, and Engineering Technology, the \"Purple\" level of the Scholarship of Distinction provides the highest stated monetary award for undergraduates at the university.\n\nEvidence:\n\nThe University of North Alabama's official website explicitly states the value of the Scholarships of Distinction on the following pages:\n\n*   Scholarships of Distinction page: [https://www.una.edu/financial-aid/scholarships-of-distinction.html](https://www.una.edu/financial-aid/scholarships-of-distinction.html)\n*   Scholarship of Distinction in Computing page: [https://una.academicworks.com/opportunities/2607](https://una.academicworks.com/opportunities/2607)",
        "ug_scholarship_low": "$1,000\n\nEvidence: https://www.una.edu/financial-aid/scholarships/freshman.html",
        "ug_total_students": "null"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "null",
        "is_act_required": "False\nEvidence: The University of North Alabama has a test-optional admission policy, meaning ACT or SAT scores are not required for admission for students who meet the GPA requirement. This information is explicitly stated on the university's \"Freshman Admission Requirements\" page. \nURL: https://www.una.edu/admissions/freshmen-requirements.html",
        "is_analytical_not_required": "False.\n\nThe official website for the University of North Alabama states that a minimum score on the Analytical Writing portion of the GRE is required for admission to the Master of Arts in History program. Specifically, applicants must achieve a minimum score of 3.5 in Analytical Writing, in addition to meeting requirements in the Verbal or Quantitative sections.\n\nWhile standardized test scores may be optional for undergraduate admission and some graduate programs, the explicit requirement for the M.A. in History program demonstrates that analytical writing is a required component for at least some applicants to the university.",
        "is_analytical_optional": "null",
        "is_duolingo_required": "True.",
        "is_els_required": "False. The University of North Alabama does not explicitly state on its website that ELS (English Language School) is required for admission.\n\nEvidence: The University of North Alabama's official website details its English proficiency requirements for international students. The university offers its own \"Academic English Program\" (AEP) for students who need to improve their English skills before beginning academic study. The website specifies that students can meet the English proficiency requirement by completing the AEP, or by achieving a minimum score on standardized tests such as the TOEFL or IELTS. There is no mention of a mandatory requirement for applicants to attend an external ELS program. The university provides its own pathway for English language preparation.",
        "is_english_not_required": "False.\n\nEvidence: The University of North Alabama's official website explicitly states on its \"Undergraduate Admissions for International Students\" page that \"Language proficiency is a required of all international students.\" The page further details the required scores for various English proficiency tests, including TOEFL, IELTS, TOEIC, PTE, and Duolingo. Additionally, an article from the university's student newspaper, The Flor-Ala, reiterates this requirement, stating that international students are \"required to take a TOEFL or IELTS, which are an English proficiency tests,\" and specifies the minimum scores for both undergraduate and graduate students.",
        "is_english_optional": "False",
        "is_gmat_or_gre_required": "Null. After a thorough review of the University of North Alabama's official website, it is not possible to provide a single 'True' or 'False' answer to whether the GMAT or GRE is required. The requirements are determined on a program-by-program basis, and there is no university-wide policy that applies to all graduate programs.\n\nFor instance, some graduate programs at the University of North Alabama may require GMAT or GRE scores for admission, while others may waive this requirement or not require it at all. Because this information is not explicitly stated as a uniform policy for the entire university, a definitive 'True' or 'False' answer cannot be provided. To determine the specific testing requirements, prospective students should consult the admission requirements for the individual graduate program they are interested in on the university's official website.",
        "is_gmat_required": "False\nEvidence: A GMAT score is not required for applicants who meet certain criteria. The University of North Alabama website states that the GMAT is not required for MBA applicants with an undergraduate GPA of 3.0 or higher from a regionally accredited institution, or for those with a completed master's or doctoral degree from a regionally accredited institution. This information can be found on the MBA Admissions page of the university's official website: [https://www.una.edu/business/graduate/mba-admissions.html](https://www.una.edu/business/graduate/mba-admissions.html).",
        "is_gre_required": "False\nEvidence: The University of North Alabama's official website indicates that the requirement for a GRE score is not universal for all graduate programs for international students. The admission requirements vary by college and by program. For instance, the Anderson College of Nursing and Health Professions does not list a GRE requirement for admission to its MSN or DNP programs. Additionally, for programs within the College of Education and Human Sciences, the submission of test scores is not required for candidates who have a cumulative undergraduate GPA of 3.0 or above. The Sanders College of Business and Technology does generally require a GMAT or GRE score for its graduate programs, but even there, exceptions for conditional admission exist. Therefore, it is false that a GRE score is required for any program an international student might apply to. The most accurate statement is that the requirement is program-specific. The university's graduate admissions page directs applicants to the specific academic colleges for a complete list of admission requirements.",
        "is_ielts_required": "True\n\nEvidence:\n\nThe University of North Alabama's official website explicitly states that international students whose native language is not English must provide proof of English proficiency. One of the accepted methods is submitting an IELTS score.\n\nSpecifically, the \"Admission to the University\" page in the UNA Catalogs states: \"International students whose native language is not English must present an official score report of the Test of English as a Foreign Language (TOEFL) or the International English Language Testing System (IELTS).\"\n\nFurthermore, the \"Undergraduate Admissions for International Students\" page states: \"Language proficiency is a required of all international students. This requirement can be met in two ways: through a test score from a recognized agency or through UNA's English as a Second Language Program.\" The page then lists the required minimum IELTS score.\n\nThe university's \"Frequently Asked Questions\" page for international admissions also confirms this requirement for both undergraduate and graduate applicants, although it notes that there are exemptions for applicants from certain countries and for those who have completed their education in English.",
        "is_lsat_required": "False\nThe official university website for the University of North Alabama does not explicitly state that the LSAT is a requirement for any of its graduate programs. A review of the graduate programs listed on the university's website shows no law school or law-related master's degree programs that would typically necessitate the LSAT for admission. The university offers master's degrees in fields such as business, nursing, education, arts, and sciences, for which other standardized tests like the GMAT, GRE, or MAT may be required depending on the specific program.",
        "is_mat_required": "Null",
        "is_mcat_required": "Null. The information is not explicitly stated on the University of North Alabama's website.",
        "is_pte_required": "True\nEvidence:\n\nThe University of North Alabama's official website explicitly states that the Pearson Test of English (PTE) is an acceptable measure of English proficiency for international students.\n\nFor undergraduate admission, a minimum PTE score of 46 is required. This information is available on the \"Undergraduate Admissions for International Students\" page under the \"Language Proficiency\" section.\n\nFor graduate admission, a minimum PTE score of 54 is required, as stated on the \"Frequently Asked Questions\" page.",
        "is_sat_required": "False.\n\nEvidence: The University of North Alabama's official website explicitly states in the admission requirements for new freshmen that the university is \"test optional, meaning students can apply with or without ACT/SAT scores.\" This information can be found on the \"New Freshmen\" admissions page at https://www.una.edu/admissions/new-freshmen.html.",
        "is_toefl_ib_required": "True\nEvidence: The University of North Alabama's official website explicitly states that international students are required to demonstrate English proficiency. The TOEFL iBT is listed as an acceptable method to meet this requirement. For undergraduate applicants, a minimum TOEFL iBT score of 61 is required. For graduate applicants, the minimum required TOEFL iBT score is 79. This information can be found on the \"Undergraduate Admissions for International Students\" page and the \"Frequently Asked Questions\" page on the university's website (una.edu).",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": 0
    }
}