{
    "new_fields_data": {
        "womens_college": "No.",
        "cost_of_living_min": "null",
        "cost_of_living_max": "null",
        "orientation_available": "Yes.\n\nEvidence:\n*   **First Time Freshmen Orientation:** The Northern Kentucky University website explicitly states, \"Orientation is where your NKU journey officially begins!\" and \"Both Orientation AND Extended Orientation are mandatory for all incoming freshmen.\" This information is available at https://nku.edu/admissions/undergraduate/ssp/orientation/freshmen.html.\n*   **Adult & Transfer Orientation:** The website also confirms orientation for adult and transfer students, stating, \"All new incoming students are required to participate in an orientation experience.\" Details can be found at https://nku.edu/admissions/undergraduate/ssp/orientation/transfer.html.\n*   **International Student Orientation:** There is a dedicated page for International Orientation which outlines the schedule and purpose of the orientation for international students. This is located at https://inside.nku.edu/isss/incoming/orientation.html.\n*   **New Graduate Student Orientation:** The university provides an orientation for new graduate students, as mentioned on this page: https://nku.edu/admissions/graduate/orientation.html.",
        "college_tour_after_admissions": "Yes.\n\nEvidence: An agenda for Northern Kentucky University's \"Admitted student day\" on March 20th, 2020, includes a campus tour. This indicates that in-person tours are offered for admitted students as part of these dedicated events. The document can be found at https://inside.nku.edu/content/dam/admissions/docs/forms/Admitted%20student%20day%20Agenda%203.20.20.pdf.",
        "term_format": "Semester\nEvidence: https://inside.nku.edu/registrar/calendars.html"
    },
    "university_data": {
        "university_name": "Northern Kentucky University\n\n**Evidence:** The name of the university is explicitly stated in the provided text from the website **nku.edu**.\n**Quote:** \"Established in 1968, **Northern Kentucky University** is a public university located in Highland Heights, Kentucky, just seven miles southeast of Cincinnati.\"",
        "college_setting": "Suburban.\n\n**Evidence:** Northern Kentucky University's official website states, \"We are located only seven miles southeast of Cincinnati in the quiet suburb of Highland Heights, Kentucky.\" This is corroborated by multiple other sources.",
        "type_of_institution": "Public university",
        "student_faculty": "19:1",
        "number_of_campuses": "2\nEvidence:\n*   **Highland Heights Campus:** \"Northern's main campus is located along US 27, seven miles southeast of Cincinnati, Ohio.\"\n*   **Grant County Campus:** \"The Grant County Center, located in Williamstown, KY, is housed in a building leased from Grant County Foundation for Higher Education.\"\n*   The \"Campus Information\" page on the official Northern Kentucky University website provides details for both the Highland Heights Campus and the Grant County Campus.",
        "total_faculty_available": "null\nEvidence: The official university website for Northern Kentucky University (nku.edu) does not explicitly state the total number of faculty. The website mentions a combined number for faculty and staff. For example, one page states, \"nearly 2,000 faculty and staff\" and another mentions, \"over 1,900 faculty and staff\". However, a precise breakdown of only the total number of faculty is not provided.",
        "total_programs_available": "null",
        "total_students_enrolled": "null",
        "total_graduate_programs": "null",
        "total_international_students": "506",
        "total_students": "15,801",
        "total_undergrad_majors": "null",
        "countries_represented": "65\n\nEvidence:\n- URL: https://www.thenortherner.com/news/2022/10/19/international-student-population-the-highest-ever-in-seven-years/"
    },
    "address_data": {
        "street1": "Nunn Drive.",
        "street2": null,
        "county": "Campbell County\n\n**Evidence:** https://www.nku.edu/locations.html",
        "city": "Highland Heights.",
        "state": "Kentucky\nEvidence: https://www.nku.edu/about.html",
        "country": "null",
        "zip_code": "41099."
    },
    "application_data": {
        "application_requirements": "### Freshman Application Requirements:\n\nFor admission, new freshmen who are degree-seeking and have an unweighted high school GPA of 2.75 or higher on a 4.00 scale are eligible for admission, regardless of ACT or SAT scores. Students with an unweighted high school GPA between 2.0 and 2.749 may also be eligible for admission, potentially through the Pathfinders program. Northern Kentucky University is a test-optional institution.\n\nAll incoming undergraduate students seeking a degree must submit an official, final high school transcript or GED before the last day of midterms for the semester they are applying for.\n\n### Transfer Application Requirements:\n\nTo be considered for regular admission, transfer applicants must have a minimum GPA of 2.00. Applicants are required to complete the online application and submit official transcripts from all colleges and universities they have attended.\n\nTransfer applicants with fewer than 24 transferable semester hours (or 36 quarter hours) must also provide their final and official high school transcript or GED scores. If their unweighted high school GPA is less than 2.75, they will also need to submit ACT, SAT, or COMPASS/ACCUPLACER test scores.\n\n### Graduate Application Requirements:\n\nApplicants seeking a graduate degree must complete the online application. A fundamental requirement is the successful completion of an undergraduate degree that is equivalent to a four-year U.S. bachelor's degree. Admission requirements for graduate programs include:\n*   Official transcripts\n*   A minimum GPA of 2.5 on a 4.0 scale\n*   Scores from English language proficiency tests\n*   GRE/GMAT scores\n*   A portfolio\n*   Resume\n*   An essay\n*   A statement of purpose\n*   Letters of recommendation\n*   Financial certification\n*   A copy of a valid passport\n*   A bank statement showing sufficient funds\n*   A declaration and financial certificate\n\n### International Student Application Requirements:\n\nInternational students must also meet several requirements to be considered for admission. The general admission requirements include submitting an online application, official academic transcripts, and English language proficiency scores. Other required documents include:\n*   Standardized test scores\n*   A portfolio\n*   Letters of recommendation\n*   Financial certification\n*   A copy of a valid passport\n*   A bank statement demonstrating sufficient funds",
        "application_fees": "The application fee for domestic applicants is $40 and for international applicants is $40.\n\n**Evidence:**\n*   **Miscellaneous Fees Page:** The Northern Kentucky University \"Miscellaneous Fees\" page lists a general \"Admissions Application Fee\" of $40.\n    (https://inside.nku.edu/studentaccountservices/tuition/miscellaneous-fees.html)\n*   **International Admissions Page:** The \"International Admissions and Enrollment\" page specifies a \"$40 nonrefundable application fee\" for international undergraduate applicants.\n    (https://inside.nku.edu/registrar/non-us-transcripts/international-admissions.html)",
        "test_policy": "Test Optional\n\n\n**Evidence:**\nThe Northern Kentucky University website explicitly states its test-optional policy on the \"Test Optional\" page. The university's policy indicates that first-time freshmen applying for degree-seeking programs are not required to submit ACT or SAT scores to be considered for admission. This information is also reiterated on the \"Freshman Standards & Requirements\" page.",
        "courses_and_grades": "null",
        "recommendations": "null\nEvidence: https://www.nku.edu/admissions/international/admission-requirements.html",
        "personal_essay": "Type: Personal Essay / Personal Statement\nStatus: Not Required\nPrompt: null\nEvidence_URL: https://www.nku.edu/admissions/undergraduate/apply/freshman-requirements.html",
        "writing_sample": "Not Required.",
        "additional_information": "Certain graduate programs and selective undergraduate programs at Northern Kentucky University require additional information beyond the standard application.\n\nFor graduate applicants, supplemental forms are required for several programs, including but not limited to: Education Specialist in Educational Leadership, MA in School Counseling, and various MAEd and Ed.D. programs. Additional documentation for some graduate programs may include letters of recommendation, program-specific application forms, employment verification forms for advanced nursing programs, and writing samples.\n\nUndergraduate transfer students with fewer than 24 transferable semester hours must submit their final high school transcript or GED scores, as well as ACT or SAT scores if their high school GPA was less than 2.75. While NKU has a \"Direct Admit\" policy for high school seniors with a GPA of 2.75 or higher which requires no application or fee, some selective undergraduate programs may have additional admission requirements.\n\nInternational students, both at the undergraduate and graduate levels, are required to submit proof of English language proficiency, financial certification, and a copy of their passport. Graduate international applicants may also need to provide GRE/GMAT scores, a portfolio, resume, essay, or statement of purpose depending on their program of interest.",
        "additional_deadlines": "Based on a thorough review of the Northern Kentucky University website, nku.edu, there are no explicitly stated additional deadlines for scholarships, financial aid, or other academic matters apart from general application deadlines.\n\nExtensive searches were conducted to locate specific dates for scholarship applications and financial aid priority, however, the university's website does not provide a centralized and clear list of these deadlines. While general information regarding the availability of financial aid and scholarships is present, specific dates for submission for the upcoming academic year are not available. Similarly, the academic calendar does not contain explicit deadlines related to financial aid or scholarships.\n\nTherefore, as per the requirement that only explicitly stated deadlines be returned, the result is null.",
        "tuition_fees": "null"
    },
    "contact_data": {
        "contact_information": "**General Contact Information**\n\n*   **Address:** Northern Kentucky University, Nunn Drive, Highland Heights, KY 41099\n*   **Phone:** (859) 572-5100\n\n**Admissions**\n\n*   **Undergraduate Admissions:**\n    *   **Phone:** (859) 572-5220 or (800) 637-9948\n    *   **Email:** beanorse@nku.edu\n*   **Graduate Admissions:**\n    *   **Phone:** (859) 572-6364\n    *   **Email:** graduate@nku.edu\n*   **Law School Admissions:**\n    *   **Phone:** (859) 572-5490\n*   **Transfer Admissions:**\n    *   **Phone:** (859) 572-5220 or (800) 637-9948\n    *   **Email:** atc@nku.edu\n\n**Registrar's Office**\n\n*   **Address:** 301 Nunn Drive, Highland Heights, KY 41099\n*   **Phone:** (859) 572-5556\n*   **Fax:** (859) 572-6094\n*   **Email:** registrar@nku.edu\n\n**Colleges**\n\n*   **College of Arts and Sciences:** (859) 572-5860\n*   **College of Education:** (859) 572-6069, coedean@nku.edu\n*   **College of Health and Human Services:** (859) 572-5347, healthprofessions@nku.edu\n*   **Haile College of Business:** (859) 572-5165, cob@nku.edu\n*   **Salmon P. Chase College of Law:** (859) 572-5340\n\n**Other Departments**\n\n*   **Student Financial Assistance:** (859) 572-5143 or (888) 225-4499\n*   **University Housing:** (859) 572-5676 or (866) 572-5676\n*   **Student Account Services:** (859) 572-5204\n\nA comprehensive departmental directory with additional contact information is also available on the university's website.",
        "logo_path": null,
        "phone": "(859) 572-5100",
        "email": "nkuadmissions@nku.edu\n**Evidence:**\n- **URL:** https://www.nku.edu/admissions/contact.html\n- On this page, under the \"Office of Admissions\" section, the email address is explicitly stated as \"nkuadmissions@nku.edu\".",
        "secondary_email": "null",
        "website_url": "https://www.nku.edu/",
        "admission_office_url": "https://www.nku.edu/admissions/undergraduate.html",
        "virtual_tour_url": "https://www.nku.edu/admissions/visit/virtual-content.html",
        "financial_aid_url": "https://inside.nku.edu/financialaid.html"
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/nkuedu",
        "instagram": "https://www.instagram.com/nkuedu/\n\n**Evidence:** The Northern Kentucky University's official website, on its Social Media Hub page, explicitly states \"Follow Us @nkuedu\". The URL for this page is https://www.nku.edu/news/media-center/social.html.",
        "twitter": "https://twitter.com/nkuedu",
        "youtube": "https://www.youtube.com/user/nkuedu\nEvidence: https://www.nku.edu/news/media/video.html",
        "tiktok": "https://www.tiktok.com/@nku_norse\n\n**Evidence:**\n\nThe TikTok URL for Northern Kentucky University is explicitly stated on the following pages of the official university website, nku.edu:\n\n*   **Social Media - Inside NKU:** https://inside.nku.edu/marketing/services/social-media.html\n*   **Program Videos - Northern Kentucky University:** https://www.nku.edu/academics/gradschool/programs/videos.html\n*   **Webmail - Northern Kentucky University:** https://www.nku.edu/webmail.html",
        "linkedin": "https://www.linkedin.com/school/northern-kentucky-university/"
    },
    "student_statistics_data": {
        "grad_avg_tuition": "$16,380\nEvidence: 2025-2026 Graduate Costs (General); Tuition, Annual Full-Time Tuition (18 credit hours), $16,380",
        "grad_international_students": "Null",
        "grad_scholarship_high": "null",
        "grad_scholarship_low": "$500.",
        "grad_total_students": "null",
        "ug_avg_tuition": "$21,912\nEvidence: The NKU's tuition & fees is $11,088 for Kentucky residents and $21,912 for out-of-state students for the academic year 2024-2025.",
        "ug_international_students": "249\n\nEvidence: [https://www.collegefactual.com/colleges/northern-kentucky-university/student-life/international/](https://www.collegefactual.com/colleges/northern-kentucky-university/student-life/international/)",
        "ug_scholarship_high": "**Haile Foundation Undergraduate Full Tuition Scholarship**\n\nThe highest undergraduate scholarship offered at Northern Kentucky University is the Haile Foundation Undergraduate Full Tuition Scholarship. This award covers in-state, full-time tuition for both the Fall and Spring semesters, and its value adjusts with any increases in the university's tuition rate.\n\nEvidence for this can be found on the Northern Kentucky University's \"View Available Scholarships\" webpage for the Haile College of Business, located at [https://inside.nku.edu/cob/alumni-give/scholarships/available-scholarships.html](https://inside.nku.edu/cob/alumni-give/scholarships/available-scholarships.html).",
        "ug_scholarship_low": "$500\n\nEvidence: https://inside.nku.edu/iss/scholarships.html",
        "ug_total_students": "10,327"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "After a thorough investigation of the provided Northern Kentucky University website (nku.edu) and the specific international admission requirements page, no explicit policy was found regarding the submission of applications to more than one program for the same intake term. The searches for keywords such as 'multiple applications', 'concurrent applications', and 'more than one program' did not yield any specific regulations on this matter.\n\nTherefore, based on the information available on the official university website, the answer is as follows:\n\nAllowed: null\nRestrictions: null\nEvidence_URL: null\nQuote: null",
        "is_act_required": "False\n**Evidence:** \"NKU is test optional for all freshmen applicants.\"\n**URL:** https://www.nku.edu/admissions/undergraduate/apply/freshman.html",
        "is_analytical_not_required": "Null. The official university website for Northern Kentucky University, nku.edu, does not explicitly state that analytical writing is not required. There is also no explicit statement that analytical writing is a requirement. Searches for \"analytical writing\" within the university's course catalog, general education requirements, and admission guidelines do not yield a direct statement on this specific type of writing not being a requirement.",
        "is_analytical_optional": "null",
        "is_duolingo_required": "False\nEvidence: The Northern Kentucky University website's \"International Admissions and Enrollment\" page and the \"Undergraduate Instructions\" page list the accepted English proficiency exams for international students. These lists include TOEFL, IELTS, and PTE Academic, but do not mention the Duolingo English Test. Furthermore, the Leap Scholar page for Northern Kentucky University's admissions explicitly states \"Duolingo: N/A\" under English Language Requirements. While the official university website does not contain a direct statement explicitly rejecting the Duolingo test, the omission from their list of accepted examinations indicates that it is not a required or accepted test for demonstrating English proficiency.\n\nURL:\n*   https://inside.nku.edu/international/admissions/international-admissions-and-enrollment.html\n*   https://www.nku.edu/admissions/undergraduate/apply/instructions.html",
        "is_els_required": "null",
        "is_english_not_required": "False.\n\n**Evidence:** The Northern Kentucky University official website explicitly states that \"International students must meet a range of academic and English proficiency standards to be considered for admission to Northern Kentucky University.\" The website further details the minimum required scores for various English proficiency tests such as TOEFL, IELTS, and Pearson PTE for both undergraduate and graduate admissions. For instance, for full undergraduate admission without restrictions, a minimum TOEFL iBT score of 79 or an IELTS composite score of at least 6.5 is required. This information can be found on the \"Undergraduate Instructions\" page within the International Admissions section of nku.edu.",
        "is_english_optional": "False\nEvidence: The Northern Kentucky University website explicitly states that international students who are non-native English speakers are required to provide proof of English language fluency. The website lists minimum score requirements for various English proficiency tests, including TOEFL, IELTS, and Pearson PTE. An exemption is available for international students educated in countries where English is the primary spoken language.\n\nURL:\n*   **Undergraduate Admissions:** https://www.nku.edu/admissions/undergraduate/apply/international.html\n*   **English Language Proficiency Policy:** https://inside.nku.edu/content/dam/policies/policies-and-procedures/documents/AAPC-ENGLPROFICIENCY.pdf\n*   **International Admissions and Enrollment:** https://catalog.nku.edu/content.php?catoid=18&navoid=1653",
        "is_gmat_or_gre_required": "False.\n\n**Evidence:** The Northern Kentucky University 2024-2025 Graduate Catalog states, \"Although standardized tests such as the GRE and GMAT are not a university requirement, they are required by some NKU graduate programs. Applicants should check with the graduate program director for specifics.\" This indicates that while not mandatory for all graduate programs, specific programs within the university may still require GMAT or GRE scores for admission. For example, the M.S. in Computer Science program may ask for GRE or GMAT scores from applicants with a GPA below 3.0. Similarly, the Program in Health Informatics lists the MAT, GRE, or GMAT as an entrance requirement.",
        "is_gmat_required": "Null. I was unable to find any explicit information on the Northern Kentucky University website (nku.edu) that states whether the GMAT is a requirement for the university.",
        "is_gre_required": "Null",
        "is_ielts_required": "False\nEvidence: https://inside.nku.edu/admissions/international/apply/undergraduate-instructions.html",
        "is_lsat_required": "False. The Northern Kentucky University Chase College of Law website states that applicants must take either the Law School Admission Test (LSAT) or the Graduate Record Examinations (GRE). If an applicant takes both the LSAT and the GRE, they are required to report their LSAT score.\n\nEvidence is available on the Application Requirements page of the Northern Kentucky University Chase College of Law website: https://chaselaw.nku.edu/admissions/jd/requirements.html",
        "is_mat_required": "null",
        "is_mcat_required": "null",
        "is_pte_required": "True\n\n**Evidence:**\n\nThe Northern Kentucky University website explicitly states that the Pearson Test of English (PTE) is an accepted measure of English proficiency for international applicants. The required minimum score for undergraduate admission is 58, and for graduate admission, it is also 58. \n\nThis information is available on the \"English Language Proficiency Requirements\" page within the International Admissions section of the university's official website. \n\n**URL:** [https://inside.nku.edu/content/dam/international/docs/english-language-requirements.pdf](https://inside.nku.edu/content/dam/international/docs/english-language-requirements.pdf)",
        "is_sat_required": "False\n**Evidence:** Northern Kentucky University is test-optional for most students. According to the university's freshman admission requirements page, \"Standardized test scores (ACT or SAT) are not required for most applicants.\" This information is explicitly stated on the following page: [https://www.nku.edu/admissions/undergraduate/apply/freshman.html](https://www.nku.edu/admissions/undergraduate/apply/freshman.html)",
        "is_toefl_ib_required": "True\n**Evidence:** [https://www.nku.edu/admissions/international/admission-requirements/english-proficiency.html](https://www.nku.edu/admissions/international/admission-requirements/english-proficiency.html)",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": false
    }
}