[
    {
        "Concentration name": null,
        "description": "The accounting minor provides students with the foundational knowledge of accounting required to understand and interpret financial information. Students will gain an understanding of financial reporting, managerial accounting and auditing. This minor can complement a variety of majors in the School of Business and across the University.",
        "program website url": "https://catalog.qu.edu/undergraduate/schools-colleges/business/accounting/accounting-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Accounting",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Accounting is the language of business. The Bachelor of Science in Accounting degree program prepares students for professional careers in public accounting, corporate accounting, governmental accounting, and not-for-profit accounting. Accounting is one of the most in-demand business fields, and Quinnipiac’s BS in Accounting program positions graduates to succeed in the field. Students learn skills in financial accounting, managerial accounting, auditing, taxation, and accounting information systems. The curriculum emphasizes critical thinking, problem-solving, and analytical skills and prepares students for a career as a professional accountant and for the CPA exam. Our curriculum combines a strong foundation in accounting principles with an understanding of the broader business environment, including ethical considerations, global perspectives, and technological advancements. Students gain practical experience through internships, case studies, and real-world projects, enabling them to apply classroom knowledge to real-world scenarios. We prepare our students to become business leaders by providing them with the expertise to interpret and utilize financial information, make informed decisions, and contribute to the success of any organization.",
        "program website url": "https://catalog.qu.edu/undergraduate/business/accounting-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Accounting",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Advertising and Integrated Communications, BA, program provides students with the critical understanding, skills, and strategic perspective needed for careers in advertising, branding, public relations, and other related integrated communications fields. Advertising, public relations, social media, and other marketing communications are increasingly integrated, and this program recognizes this trend by preparing students to work within a variety of agency, corporate, and nonprofit settings. Students are exposed to critical perspectives in media studies as well as professional best practices. Students create portfolios of their work and graduate prepared to work for clients from across a variety of industries.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=30&poid=5573",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Advertising and Integrated Communications",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Advertising and Public Relations minor exposes students to key theories and practices in the creation, execution, and evaluation of communication campaigns. Students learn to research, strategize, and write for a variety of media while considering ethical concerns. They engage in the study of advertising and public relations within a broad liberal arts context, examining the impact of these fields on culture and society. Students gain foundational knowledge and skills for pursuing careers in advertising, public relations, social media, and related fields.",
        "program website url": "https://catalog.qu.edu/programs/advertising-public-relations-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Advertising and Public Relations",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Aging Studies minor provides students with the foundational knowledge and interdisciplinary skills to work with and advocate for older adults across varied settings. Students will explore the physical, psychological, social and cultural aspects of aging. The minor is a valuable complement to students pursuing degrees in a wide range of fields including, but not limited to, health sciences, nursing, physical therapy, occupational therapy, social work, psychology, sociology, political science, education, business, communications and law. The minor consists of 18 credits.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/health-sciences/aging-studies-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Aging Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The anthropology minor introduces students to the holistic study of humanity and human behavior across time and space. Anthropology uses a variety of methods and theories from the social and natural sciences and the humanities to study the human condition. Students will learn how to critically analyze and understand human societies and cultures and the biological and evolutionary basis of human behavior, using both quantitative and qualitative methods.",
        "program website url": "https://catalog.qu.edu/programs/arts-sciences/anthropology-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Anthropology",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The mission of the Bachelor of Science in Applied Business program is to provide students with a solid foundation in core business concepts and essential skills that are directly applicable to various professional settings. This program is designed for students who seek a comprehensive understanding of business operations, management, and strategy, emphasizing practical application and real-world problem-solving.\nUpon successful completion of the Bachelor of Science in Applied Business program, students will be able to:\n1.  Demonstrate a fundamental understanding of core business disciplines, including accounting, finance, marketing, management, and economics.\n2.  Analyze business problems and opportunities using critical thinking and analytical skills.\n3.  Formulate effective business strategies and make informed decisions based on relevant data and ethical considerations.\n4.  Communicate effectively in diverse business contexts, both orally and in writing.\n5.  Collaborate effectively in team settings to achieve common business goals.\n6.  Apply business principles and practices to address real-world challenges and adapt to dynamic business environments.",
        "program website url": "https://catalog.qu.edu/undergraduate/business/applied-business-bs/",
        "Accreditation status": "Accredited by AACSB International",
        "Program name": "Bachelor of Science in Applied Business",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Applied Statistics and Data Science provides students with an introduction to the interdisciplinary field of data science, preparing them for careers in data analytics. Students will develop essential skills in data collection, visualization, analysis, interpretation and communication using cutting-edge statistical software.",
        "program website url": "https://catalog.qu.edu/programs/artsandsciences/mathematics/applied-statistics-data-science-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Applied Statistics and Data Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Artificial Intelligence (AI) provides students with an understanding of AI theory and practice across various applications, including machine learning, computer vision, natural language processing, and robotics. The minor is a multidisciplinary program open to all students across the university. The minor will allow students to:\n* Develop an understanding of the fundamental theories and concepts of AI.\n* Explore the principles and methods of machine learning, deep learning, and data mining.\n* Gain hands-on experience in building, training, and evaluating AI models.\n* Apply AI techniques to solve real-world problems in various domains.\n* Analyze the ethical implications and societal impact of AI technologies.\n* Prepare for careers in AI-related fields or further graduate studies.",
        "program website url": "https://catalog.qu.edu/programs/artificial-intelligence-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Artificial Intelligence",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The interdisciplinary minor in Asian Studies is designed to provide students with a general knowledge of the history, societies, cultures, economies, and political systems of Asia. This minor is intended to supplement the student’s major field of study, providing a global perspective. The minor provides students with knowledge about a region that is critically important in the 21st century. Through an interdisciplinary approach, students gain a better understanding of the diversity and complexity of Asia.",
        "program website url": "https://catalog.qu.edu/arts-sciences/interdisciplinary-minors/asian-studies-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Asian Studies",
        "Program Page url": "https://catalog.qu.edu/arts-sciences/interdisciplinary-minors/asian-studies-minor/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://catalog.qu.edu/courses-undergraduate/at/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Athletic Training",
        "Program Page url": "https://catalog.qu.edu/courses-undergraduate/at/"
    },
    {
        "Concentration name": null,
        "description": "Behavioral Neuroscience majors explore the biological basis of behavior and cognition in humans and animals. This interdisciplinary field integrates concepts from biology, psychology, neuroscience, and pharmacology, offering a comprehensive understanding of how the brain influences behavior and vice versa. Our program emphasizes hands-on learning, research opportunities, and practical applications, preparing students for careers in research, healthcare, and advanced graduate studies.",
        "program website url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/behavioral-neuroscience/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Behavioral Neuroscience",
        "Program Page url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/behavioral-neuroscience/"
    },
    {
        "Concentration name": null,
        "description": "Biochemistry is the study of life at the molecular level and is a bridge between the biological sciences and chemistry. Our graduates are prepared for careers in research, biotechnology, medicine, dentistry, pharmacy, forensic science, toxicology, and other health sciences. Many graduates continue their studies in graduate school or professional school programs. The interdisciplinary nature of biochemistry integrates elements of chemistry, biology, molecular biology, genetics, and cell biology. Students will learn the molecular mechanisms underlying biochemical processes central to all forms of life and apply biochemistry principles to real-world issues in biotechnology, medicine, and pharmaceutical sciences. Our degree offers a traditional curriculum designed to prepare students for successful careers in biochemistry and for further studies in graduate or professional school. Students gain hands-on experience by working with state-of-the-art instrumentation including Fourier-transform infrared (FTIR) and ultraviolet-visible (UV-Vis) spectroscopy, nuclear magnetic resonance (NMR) spectroscopy, mass spectrometry (MS), atomic absorption (AA) spectroscopy, chromatography, and protein electrophoresis.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/chemistry-biochemistry-physics/biochemistry-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biochemistry",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology",
        "Program Page url": "https://catalog.qu.edu/arts-sciences/biological-sciences/biology-bs/biology-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Biomedical Marketing is designed to address the increasing demand for professionals with expertise in both marketing and the biomedical field. This interdisciplinary program prepares students for careers in the dynamic and rapidly evolving healthcare and biotechnology industries. Students will gain a strong foundation in marketing principles, business strategies, and an in-depth understanding of biomedical science, ethical considerations, and regulatory environments unique to the biomedical sector. The curriculum integrates core marketing concepts with specialized knowledge in areas such as pharmaceutical marketing, medical device sales, healthcare analytics, and biotechnology commercialization. Graduates will be equipped to develop and implement effective marketing strategies for biomedical products and services, bridging the gap between scientific innovation and market needs.",
        "program website url": "https://catalog.qu.edu/business/marketing/bs-biomedical-marketing/",
        "Accreditation status": null,
        "Level": "BS",
        "Program name": "Bachelor of Science in Biomedical Marketing",
        "Program Page url": "https://catalog.qu.edu/business/marketing/biomedical-marketing-bs/biomedical-marketing-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Biomedical Sciences program provides a broad-based education in the biomedical sciences, with a strong emphasis on foundational science and critical thinking skills. This program is designed to prepare students for careers in research, healthcare, and biotechnology, as well as for further graduate or professional studies. Students will develop a deep understanding of human biology, disease mechanisms, and therapeutic interventions, gaining hands-on experience through laboratory coursework and research opportunities.",
        "program website url": "https://catalog.qu.edu/programs/undergraduate/health-sciences/biomedical-sciences-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biomedical Sciences",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Biomedical Sciences Minor provides a pathway for students pursuing careers in healthcare who are interested in enhancing their science background and developing a deep understanding of human health and disease. Students complete coursework that provides a foundation in human anatomy and physiology, cell biology, genetics, immunology and pathophysiology. This minor complements a number of majors including biochemistry, biology, health science, microbiology and molecular genetics, nursing, physical therapy, and physician assistant.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/biology/biomedical-sciences-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Biomedical Sciences",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Business Analytics is an interdisciplinary program designed to prepare students for careers in the growing field of data analytics. This program combines strong foundational knowledge in business, mathematics, statistics, and computer science to develop students' analytical skills. Students will learn to collect, clean, analyze, and interpret large datasets to inform business decisions and solve complex problems. Through hands-on projects and case studies, students will gain proficiency in industry-standard software and techniques, including statistical modeling, machine learning, data visualization, and predictive analytics. Graduates will be equipped to pursue roles such as business intelligence analyst, data analyst, data scientist, and analytics consultant across various industries.",
        "program website url": "https://catalog.qu.edu/programs/business-analytics-bs/",
        "Accreditation status": "AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Program name": "Bachelor of Science in Business Analytics",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Business Analytics minor provides students with the critical skills and knowledge to solve business problems with data-driven insights using appropriate tools and techniques. The minor exposes students to key topics such as data management, statistical modeling, data visualization, predictive analytics and ethical considerations in data analysis. Through a combination of theoretical foundations and practical applications, students will learn to extract meaningful information from complex datasets, interpret results, and communicate findings effectively to various stakeholders. This interdisciplinary minor complements a wide range of majors by enhancing analytical and decision-making capabilities, preparing students for careers in diverse industries such where data-driven strategies are essential.",
        "program website url": "https://catalog.qu.edu/undergraduate/schools-colleges/business/business-analytics-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Business Analytics",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Chemistry degree prepares students for careers in industry or government, or for graduate work in chemistry. Students may also complete the American Chemical Society certified curriculum requirements by selecting appropriate electives. The curriculum provides a strong background in chemistry, with a focus on laboratory skills, problem solving and critical thinking. The curriculum has been designed to meet or exceed the requirements for certification by the American Chemical Society.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/chemistry-biochemistry/chemistry-bs/",
        "Accreditation status": "Certified by the American Chemical Society (ACS)",
        "Program name": "Bachelor of Science in Chemistry",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Students majoring in other fields may elect to complete a minor in Chemistry. This minor provides a foundation in the principles of chemistry and an exposure to the various areas of the field. Students completing a minor in chemistry will be well prepared to pursue careers in a variety of fields and to pursue graduate studies in chemistry or related fields.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/chemistry/chemistry-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Chemistry",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Civil engineering is the oldest and broadest branch of engineering. Civil engineers design, construct, supervise, operate and maintain infrastructure projects and systems in the public and private sectors, including roads, buildings, airports, tunnels, dams, bridges, and systems for water supply and sewage treatment. They also address problems related to environmental protection, natural disaster prevention and resource management. The BS in Civil Engineering program is designed to provide students with the knowledge and skills necessary to become successful civil engineers. The curriculum combines a strong foundation in mathematics, science and engineering fundamentals with hands-on experience in areas such as structural analysis, geotechnical engineering, transportation engineering, water resources engineering and environmental engineering. Students also develop critical thinking, problem-solving and communication skills, preparing them for a diverse range of career opportunities.",
        "program website url": "https://catalog.qu.edu/undergraduate/engineering/civil-engineering-bs/",
        "Accreditation status": "The Civil Engineering program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Civil Engineering",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Communications program provides students with a broad and deep understanding of the diverse fields within communications. Students gain hands-on experience in areas such as digital media production, journalism, public relations, and sports journalism. The program emphasizes critical thinking, ethical communication, and practical skills necessary for success in today’s rapidly evolving media landscape. Through a combination of theoretical coursework and experiential learning opportunities, students learn to analyze, create, and disseminate messages effectively across various platforms. Graduates are prepared for careers in media, public relations, corporate communications, and other communication-intensive fields, or for further graduate study.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/communication-media-arts/communications-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Communications",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Computer Information Systems program (CIS) is designed to provide students with the business and technical skills necessary to apply modern information technology to business problems. CIS prepares students for careers in the rapidly growing field of information technology, as well as for graduate study. This program focuses on both the technical and managerial aspects of information systems. Students gain expertise in areas such as programming, database management, network administration, cybersecurity, and project management, all within a business context. The curriculum emphasizes problem-solving, critical thinking, and communication skills, preparing graduates to be effective leaders and innovators in the digital economy.",
        "program website url": "https://catalog.qu.edu/programs/bachelorofscienceincomputerinformationsystems/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Computer Information Systems",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Computer Information Systems (CIS) minor is designed for non-School of Engineering students who are interested in learning fundamental concepts and practices in computing and information systems. The minor will provide students with a foundational understanding of computer programming, database systems, cybersecurity, and data analytics while providing flexibility in the choice of additional CIS courses to meet individual student interests. The CIS minor will equip students with the skills necessary to succeed in a technology-driven world regardless of their major.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=33&poid=6701&returnto=programs",
        "Accreditation status": null,
        "Program name": "Minor in Computer Information Systems",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Computer Information Systems and Accounting program prepares students for careers at the intersection of information systems and accounting. This program offers a unique blend of technical and business skills essential for today’s dynamic business environment. Students will gain expertise in areas such as financial accounting, managerial accounting, auditing, taxation, database management, systems analysis and design, cybersecurity, and data analytics. The curriculum is designed to provide a strong foundation in both disciplines, enabling graduates to work effectively with financial data, manage information systems, and contribute to strategic decision-making within organizations. The program emphasizes practical application, critical thinking, and problem-solving skills, preparing students for professional certifications like the CPA or relevant technology certifications, as well as for various roles in auditing, financial systems, data analysis, and IT consulting.",
        "program website url": "https://catalog.qu.edu/undergraduate/business/computer-information-systems-accounting-bs/",
        "Accreditation status": "The School of Business is accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Program name": "Bachelor of Science in Computer Information Systems and Accounting",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (BA) in Computer Science provides students with the opportunity to master the fundamental theories and applications of computer science as a liberal art. This program is for students with strong interests in other disciplines, such as the humanities or the natural sciences, who wish to combine those interests with a solid understanding of computer science. Students in this program will learn the fundamentals of computer science and apply them in various contexts, preparing them for careers where both quantitative and qualitative skills are vital. Graduates will be equipped to pursue entry-level positions in technology, computational fields, and related interdisciplinary areas, or to continue their education at the graduate level.",
        "program website url": "https://catalog.qu.edu/programs/artsandsciences/computer-science-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Computer Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Computer Science program at Quinnipiac provides students with a strong foundation in both the theoretical and practical aspects of computing. The curriculum emphasizes problem-solving, algorithm design, software development, data structures, and computer organization. Students gain expertise in programming languages, operating systems, networking, databases, and cybersecurity. The program prepares graduates for a wide range of careers in the technology industry, including software engineering, data analysis, cybersecurity, and web development. The curriculum also provides a solid foundation for graduate studies in computer science or related fields. Students will develop critical thinking skills, problem-solving abilities, and an understanding of ethical considerations in computing. A robust capstone experience allows students to apply their knowledge to real-world projects.",
        "program website url": "https://catalog.qu.edu/programs/computer-science-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Computer Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "A minor in computer science is an excellent way to broaden a student’s understanding of technology and computational thinking. It provides students with fundamental knowledge and skills in programming, data structures, algorithms, and other core areas of computer science. This minor complements a wide range of majors, allowing students to integrate computational skills into their primary field of study. By completing the minor, students enhance their problem-solving abilities, logical reasoning, and adaptability to new technologies, making them more competitive in today’s technology-driven world.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=37&poid=8297",
        "Accreditation status": null,
        "Program name": "Minor in Computer Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": "Criminal Justice and Law, Forensic Investigations",
        "description": "The Criminal Justice program introduces students to the nature and causes of crime, patterns of crime, the organization and administration of law enforcement agencies, the legal process, the correctional system and theories of criminal justice. The interdisciplinary nature of the curriculum provides students with a broad understanding of the field and its application to diverse issues, including policy formation, law enforcement, evidence, forensic science, the courts and correctional systems. Through the interdisciplinary curriculum, students acquire knowledge and skills in critical thinking, research, problem-solving and communication. Students are provided with the necessary skills to assess the needs of their communities, to develop effective programs and to implement and evaluate social policy. The program also provides excellent preparation for further study in graduate school or law school.\nStudents pursuing a Bachelor of Arts in Criminal Justice must select one of the following specializations: Criminal Justice and Law or Forensic Investigations.\nThrough internships, opportunities for engagement with the community, service learning and research, the criminal justice program connects students with their communities and provides them with real-world experiences. Students are challenged to use classroom knowledge and apply it to a wide range of social issues through problem solving, leadership and the use of technology.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/criminal-justice-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Criminal Justice",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Criminal Justice minor is for students interested in a career in criminal justice. The courses offered prepare students for employment with law enforcement agencies (local, state and federal), correctional facilities, probation and parole, and other public and private agencies in the criminal justice system. The minor also prepares students for graduate studies in criminal justice, law school and other related fields. Students will gain an understanding of criminal justice issues related to theory, policy and research. The Criminal Justice minor is open to all students, regardless of major. Students interested in the minor should contact the department chair or program coordinator to discuss their interests.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=37&poid=11075",
        "Accreditation status": null,
        "Program name": "Minor in Criminal Justice",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Data scientists are expert analytical practitioners who combine a strong background in mathematics and computer science with skills in statistics, visualization and communication to extract insights from data. Our bachelor of science in Data Science program prepares students for careers in this rapidly growing field. Students in the Data Science program acquire the mathematical and computational foundations necessary to work with data and develop expertise in data acquisition, management, modeling, analysis and visualization. The program also provides students with the critical thinking and communication skills necessary to formulate and articulate data-driven solutions to real-world problems. The BS in Data Science can also provide an excellent foundation for graduate study in Data Science, Statistics, Computer Science or related fields.",
        "program website url": "https://catalog.qu.edu/arts-sciences/mathematics/data-science-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Data Science",
        "Program Page url": "https://catalog.qu.edu/arts-sciences/mathematics/data-science-bs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Diagnostic Medical Sonography program prepares students for careers as diagnostic medical sonographers. The program consists of a three-year pre-professional phase followed by a 15-month professional phase during which students complete courses in the Diagnostic Medical Sonography major and extensive clinical practice. Upon completion of the program, graduates are eligible to take national board examinations offered by the American Registry for Diagnostic Medical Sonography (ARDMS). Graduates are prepared to work as entry-level sonographers in hospitals, clinics, or private offices and function as members of the health care team. The curriculum emphasizes patient care, professionalism, effective communication, critical thinking, problem solving, and skills necessary to obtain high quality diagnostic images and effectively evaluate images for clinical information. Students are provided with a foundation in the basic sciences as well as general education courses that broaden knowledge and enhance communication skills. The program provides students with the clinical education necessary for advanced professional practice through partnerships with diverse clinical sites.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=46&poid=13115",
        "Accreditation status": "The Diagnostic Medical Sonography program is accredited by the Commission on Accreditation of Allied Health Education Programs (CAAHEP) upon the recommendation of the Joint Review Committee on Education in Diagnostic Medical Sonography (JRCDMS).",
        "Program name": "Bachelor of Science in Diagnostic Medical Sonography",
        "Program Page url": "https://catalog.qu.edu/health-sciences/diagnostic-imaging/diagnostic-medical-sonography-bs/diagnostic-medical-sonography-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "Economics is the study of how societies manage their scarce resources. Economists use a variety of tools, including statistical analysis, mathematical modeling and historical research, to understand and address real-world problems. The BS in Economics provides students with a strong foundation in economic theory, quantitative methods and analytical skills. The curriculum is designed to prepare students for careers in finance, government, consulting and various other fields, as well as for graduate study in economics, law or business. The program’s rigorous approach to economic analysis and empirical research fosters critical thinking, problem-solving abilities and effective communication skills.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/economics/#bachelorstext",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Economics",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Department of Economics offers a minor in Economics. The study of economics provides an analytical understanding of how institutions operate to influence economic activity and welfare. The minor is a valuable complement to many majors in both the arts and sciences and business, providing students with analytical skills that can be applied to a wide range of career options and advanced study. Students who select the minor will take at least 18 credits in economics, including courses in microeconomics, macroeconomics, and statistics.",
        "program website url": "https://catalog.qu.edu/undergraduate/college-arts-sciences/economics/economics-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Economics",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Our Bachelor of Arts in English program equips students to think, read, speak and write with clarity, creativity and conviction. Through a wide variety of courses, you’ll develop the skills to analyze different modes of expression — literary, rhetorical and visual — from different historical periods and cultural contexts. You’ll investigate how language shapes and reflects the human experience, and you’ll learn how to express your own ideas effectively.\nOur curriculum is designed to help you strengthen your ability to read critically and write persuasively. You’ll be able to shape your education around your interests, choosing from courses in British, American, and global literature, as well as creative writing, rhetoric and linguistics. You’ll apply diverse theoretical frameworks to interpret literary texts and cultural artifacts, and you’ll conduct research using both traditional and digital tools. You’ll also learn to communicate effectively in a variety of contexts and for a variety of purposes.\nAn English degree from Quinnipiac has a strong track record of preparing graduates for a broad range of rewarding careers and graduate study. Our graduates possess highly marketable skills—strong writing, communication, and critical thinking—that employers seek across diverse industries, from publishing and journalism to law, education, and business.",
        "program website url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/english/",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in English",
        "Program Page url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/english/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in English",
        "Program Page url": "https://as.tufts.edu/english/academics/undergraduate-programs/minor-english"
    },
    {
        "Concentration name": null,
        "description": "Quinnipiac’s BS in Entrepreneurship and Small Business Management program helps students develop skills in innovation, creativity, opportunity recognition and evaluation, resource acquisition, and venture initiation. Students will learn how to identify opportunities, develop business plans, raise capital, and manage and grow a new venture. In addition, students will learn how to manage and grow a small business, including topics such as marketing, finance, operations, and human resources. This program prepares students for a variety of careers in entrepreneurship, including starting their own businesses, working for startups, or working in small businesses.",
        "program website url": "https://catalog.qu.edu/business/entrepreneurship-strategy/entrepreneurship-small-business-management-bs/entrepreneurship-small-business-management-bs.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Entrepreneurship and Innovation",
        "Program Page url": "https://catalog.qu.edu/business/entrepreneurship-strategy/entrepreneurship-small-business-management-bs/entrepreneurship-small-business-management-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Entrepreneurship and Innovation prepares students from any major to address challenges and pursue opportunities through innovative, entrepreneurial problem solving. Students learn skills to develop, launch, and manage new ventures within corporations (intrapreneurship), for non-profits (social entrepreneurship), or as an independent business. The minor provides an experiential learning approach where students move from idea generation to a launch of a new product, service, or business model through a lean startup process. Students will apply skills in design thinking, problem framing, market validation, business model development, financial forecasting, and pitch development. The minor provides students with the capability to create new value in their chosen career path by leveraging innovation and entrepreneurial thinking.",
        "program website url": "https://catalog.qu.edu/business/entrepreneurship-strategy/entrepreneurship-strategy.pdf",
        "Accreditation status": null,
        "Program name": "Minor in Entrepreneurship and Innovation",
        "Program Page url": "https://catalog.qu.edu/business/entrepreneurship-strategy/entrepreneurship-strategy.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Environmental Science provides students with the scientific knowledge and practical skills necessary to understand and address complex environmental problems. The curriculum integrates principles from biology, chemistry, geology, and physics with specialized courses in environmental policy, sustainability, and data analysis. Students develop critical thinking skills through hands-on laboratory work, field experiences, and research projects. The program prepares graduates for diverse careers in environmental consulting, natural resource management, conservation, environmental education, and government agencies, as well as for further graduate studies in environmental fields.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/environmental-science-bs/",
        "Accreditation status": null,
        "Level": "BS",
        "Program name": "Bachelor of Science in Environmental Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Environmental Studies is an interdisciplinary program that draws upon the natural sciences, social sciences and humanities. The goal of the program is to educate students in the scientific principles necessary to understand environmental systems, to provide a social, political and economic context in which to evaluate policy options, and to encourage critical thinking about the human place in the natural world. Students completing the BA in Environmental Studies should be able to:\n* Evaluate competing claims about environmental issues from diverse disciplinary perspectives.\n* Utilize the tools of scientific inquiry to analyze environmental problems.\n* Articulate the societal factors shaping human-environment interactions.\n* Formulate and defend solutions to environmental problems.\n* Communicate effectively about environmental issues.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/environmental-studies-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Environmental Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Exercise Science program provides students with the foundational knowledge and skills necessary for careers in various health, fitness, and sport performance settings, as well as for graduate studies in fields such as physical therapy, occupational therapy, physician assistant, chiropractic, exercise physiology, biomechanics, and strength and conditioning. The curriculum integrates theoretical knowledge with practical application through hands-on experiences, research opportunities, and clinical internships. Students learn about human anatomy and physiology, exercise physiology, biomechanics, motor learning, nutrition, and exercise testing and prescription. They develop critical thinking skills, evidence-based practice, and effective communication to assess, design, and implement exercise programs for diverse populations, including healthy individuals, athletes, and those with chronic diseases.",
        "program website url": "https://catalog.qu.edu/programs/health-sciences/exercise-science-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Exercise Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Film, Television and Media Arts is designed for students seeking careers as creators and producers of content for these dynamic media industries. The curriculum balances a strong theoretical and critical foundation with the development of practical and creative skills required for storytelling across a range of genres and platforms. Students learn to conceptualize, write, shoot, direct, edit and produce films, television shows and digital content, as well as critically analyze their forms, aesthetics, production and reception. Students explore topics such as film history, television studies, media theory, screenwriting, cinematography, directing, editing, sound design, producing, and new media production. The program emphasizes ethical and socially responsible practices, preparing graduates to be innovative and impactful storytellers in a rapidly evolving media landscape.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Film, Television and Media Arts",
        "Program Page url": "https://catalog.qu.edu/communications/communications.pdf"
    },
    {
        "Concentration name": "Production Track, Critical Studies Track",
        "description": "The minor in film and television offers students opportunities to develop skills in film and video production and/or critical studies of film and television. Students learn the basic technical and aesthetic principles of video production and editing in the production track, and acquire critical language and theory through the critical studies track. Students completing the minor will have a portfolio of written work, video projects, or both. The minor requires six courses. Students may choose to complete a production track or a critical studies track. Students may apply a maximum of three courses from the minor toward completion of another major or minor.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/film-television-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Film and Television",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Finance program offers students a comprehensive understanding of financial markets, institutions, and instruments. Students develop analytical and problem-solving skills essential for careers in corporate finance, investment management, banking, and financial planning. The curriculum provides a strong foundation in economic principles, quantitative methods, and financial theory. Graduates are prepared for a variety of roles in the financial industry, including financial analysts, portfolio managers, risk managers, and financial advisors, as well as for further graduate studies.",
        "program website url": "https://catalog.qu.edu/undergraduate/business/finance-bs/",
        "Accreditation status": "AACSB International—The Association to Advance Collegiate Schools of Business",
        "Program name": "Bachelor of Science in Finance",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The minor in finance is designed for business majors and nonbusiness majors who wish to develop skills in financial management and analytical decision-making. The program emphasizes an applied approach that will benefit students interested in careers in financial services, corporate finance or personal financial planning.",
        "program website url": "https://catalog.qu.edu/programs/business/finance-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Finance",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The minor in fine arts provides students from all disciplines the opportunity to develop their creative and critical skills through engagement with the principles and practices of the visual arts. Students will be encouraged to explore both traditional and new media and to develop proficiency in a broad range of materials and techniques. The goal of the minor is to foster students' aesthetic awareness and to cultivate their ability to create and interpret works of art.",
        "program website url": "https://catalog.qu.edu/programs/fine-arts-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Fine Arts",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The forensic science minor is intended for students who have an interest in combining a science major with a basic understanding of forensic applications of chemistry, biology and criminalistics. The goal of the minor is to provide students with the laboratory and theoretical skills and knowledge that are critical for scientific analysis in criminal and civil investigations. Students pursuing this minor will gain proficiency in a variety of scientific disciplines with an emphasis on forensic applications of basic scientific principles.",
        "program website url": "https://catalog.qu.edu/academics/college-arts-sciences/chemistry-physical-science/forensic-science-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Forensic Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Game Design and Development focuses on the skills and knowledge needed to design, develop, and produce video games across a variety of platforms and genres. The curriculum combines the theoretical foundations of game design with practical, hands-on experience in game development, including programming, art, animation, sound design, and project management. Students learn to critically analyze games, understand player psychology, and apply design principles to create engaging and innovative interactive experiences. Emphasizing creativity, collaboration, and problem-solving, the program prepares graduates for careers in the dynamic and evolving game industry, as well as for further study in related fields.",
        "program website url": "https://catalog.qu.edu/programs/game-design-development-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Game Design and Development",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The minor in game design and development is intended for students who wish to learn about and engage in the design, development and production of video games in an interdisciplinary setting. This minor will help students develop skills relevant to the current job market in game design and related industries. Students will develop foundational skills in game development across many areas including design, art, programming, production and sound design. This minor provides an opportunity to apply theoretical knowledge to practical projects as students learn to work in interdisciplinary teams. The minor will help students prepare for careers as game designers, game artists, game programmers, quality assurance testers, level designers, UI/UX designers or game producers.",
        "program website url": "https://catalog.qu.edu/programs/game-design-development-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Game Design and Development",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The General Business minor helps students from outside the School of Business develop valuable knowledge and skills that are essential in today’s complex business environment. This 18-credit minor provides students with a fundamental understanding of business principles and practices, preparing them for a wide range of career opportunities or for graduate studies.",
        "program website url": "https://catalog.qu.edu/programs/general-business-minor/",
        "Accreditation status": null,
        "Program name": "Minor in General Business",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Gerontology program at Quinnipiac University offers students an interdisciplinary education focused on the study of aging. This program integrates knowledge from various fields including sociology, psychology, biology, and public health to provide a comprehensive understanding of the physical, mental, and social aspects of aging. Graduates are prepared for a variety of careers in social work, healthcare administration, non-profit organizations, and public policy, working with older adults and their families. Students will develop skills in critical analysis, research, and program planning, equipping them to address the challenges and opportunities presented by an aging population.",
        "program website url": "https://catalog.qu.edu/arts-sciences/sociology-anthropology/gerontology-ba/gerontology-ba.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Gerontology",
        "Program Page url": "https://catalog.qu.edu/arts-sciences/sociology-anthropology/gerontology-ba/gerontology-ba.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Global Public Health minor will introduce students to the key concepts, theories and evidence related to public health problems and solutions at a global level. Students will develop an understanding of the determinants of health and disease, the historical and contemporary challenges in global health, the role of public health policies and programs, and the ethical considerations involved in addressing global health issues. The minor will provide students with an interdisciplinary perspective on global health, drawing on knowledge from various fields such as epidemiology, environmental health, social sciences, health policy and economics. Students will gain critical thinking skills, cultural competence and a global perspective to analyze complex health challenges and contribute to their solutions. The Global Public Health minor will prepare students for a range of career paths in public health, international development, research and policy, and will also complement a variety of majors by providing students with a valuable skill set and knowledge base for engaging with global health issues.",
        "program website url": "https://www.qu.edu/globalassets/global/media/qu/documents/university/catalogs/2019-2020-academic-catalog.pdf",
        "Accreditation status": null,
        "Program name": "Minor in Global Public Health",
        "Program Page url": "https://www.qu.edu/globalassets/global/media/qu/documents/university/catalogs/2019-2020-academic-catalog.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Graphic and Interactive Design is a STEM-designated program that prepares students for careers as designers, user experience (UX) and user interface (UI) professionals, and creative artists who seek to shape the world through visual communication and human-centered design. Students learn the foundational skills and theories necessary for visual design, digital media, typography, and interactive experience, as well as the broader context of design’s role in society. The curriculum emphasizes both creative practice and critical thinking, encouraging students to develop innovative solutions for real-world problems. Graduates will be equipped to work in a variety of industries, including advertising, marketing, web design, app development, game design, and more, as well as to pursue graduate studies in design or related fields.",
        "program website url": "https://www.qu.edu/schools/communications/undergraduate/graphic-and-interactive-design/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Graphic and Interactive Design",
        "Program Page url": "https://catalog.qu.edu/communications/communications.pdf"
    },
    {
        "Concentration name": null,
        "description": "Health care management is concerned with providing leadership and direction to organizations that deliver health care. This minor prepares students for careers in the rapidly growing and changing health care industry. It provides students with a foundational understanding of the complexities of the health care system and the skills necessary for effective management within it. Students will learn about health care policy, finance, economics, organizational behavior, marketing, and the legal and ethical issues facing health care managers. The curriculum emphasizes critical thinking, problem-solving, and decision-making skills relevant to health care organizations.",
        "program website url": "https://catalog.qu.edu/undergraduate/schools-colleges/business/healthcare-management-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Health Care Management",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Health Equity Minor is a 15-credit interdisciplinary program focused on understanding the social, economic, environmental, and political determinants of health; health inequities; and strategies to promote health equity among populations. The minor is a valuable complement to students’ major fields of study, preparing them for careers in health and human services, government, education, and other sectors that address population health and social justice. The minor provides a strong foundation for graduate studies in public health, health administration, social work, law, and related fields. The minor combines core courses in the areas of health equity and public health with elective courses that allow students to explore topics of particular interest or relevance to their major.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=36&poid=11528",
        "Accreditation status": null,
        "Program name": "Minor in Health Equity",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Quinnipiac's Bachelor of Arts in Health, Medicine and Society program is an interdisciplinary approach to studying the social, cultural and historical factors that shape health, medicine and illness. The program prepares students for a diverse range of careers in health-related fields, including public health, health policy, health advocacy, social work, medical ethics, and health communication, as well as for graduate study in social and behavioral sciences and health professions. Courses draw from disciplines in the humanities and social sciences to examine topics such as global health disparities, the social determinants of health, the cultural meanings of disease, and ethical issues in healthcare. The program aims to foster critical thinking, ethical reasoning, and cross-cultural understanding, equipping students with the knowledge and skills necessary to address complex health challenges in a rapidly changing world.",
        "program website url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/ba-in-health-medicine-and-society/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Health, Medicine, and Society",
        "Program Page url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/ba-in-health-medicine-and-society/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Health Science Studies degree offers students the opportunity to explore the various fields of health, disease, and the healthcare delivery system from a multidisciplinary perspective. This degree provides students with a foundational curriculum in biological, physical, behavioral, and social sciences as applied to health, disease, and the healthcare delivery system. This program also allows students to take electives and/or a minor in order to specialize within particular areas of health such as Public Health, Global Health, Exercise Science, Health Policy, etc. The Health Science Studies program will prepare students for graduate studies in a variety of health-related fields, including Public Health, Healthcare Management, Exercise Science, Global Health, Health Education, Physician Assistant, Physical Therapy, Occupational Therapy, Athletic Training, Chiropractic, Nursing and Medicine. The Health Science Studies program also prepares students for entry-level careers in public health, community health, allied health, and other non-clinical health-related fields.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=45&poid=15699",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Health Science Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Hispanic and Latin American Studies is a vibrant interdisciplinary program in the College of Arts and Sciences. Our students become global citizens through a deep and rich study of the Spanish language, and the diverse cultures, histories, literatures and contemporary issues of Spain, Latin America and U.S. Latinx communities. Students engage in discussions of pressing global issues as they relate to social justice, politics, human rights, economic development, arts and media, and the environment. Students are strongly encouraged to pursue study abroad opportunities in a Spanish-speaking country. Graduates are prepared for a wide range of careers in fields such as global business, communications, government, law, education, health sciences, social work, non-profit organizations, international relations and graduate studies.",
        "program website url": "https://catalog.qu.edu/programs/arts-sciences/modern-languages/hispanic-latin-american-studies-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Hispanic and Latin American Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Upon successful completion of the Minor in Hispanic and Latin American Studies, students will be able to: Communicate with proficiency in Spanish across a wide range of topics both orally and in writing. Employ linguistic and cultural knowledge to engage with Hispanic and Latin American communities and critically assess their own roles in a globalized world. Analyze and interpret the historical and cultural forces that shape Hispanic and Latin American societies and their diasporas.",
        "program website url": "https://catalog.qu.edu/arts-sciences/modern-languages/minor-hispanic-latinamerican-studies/",
        "Accreditation status": null,
        "Program name": "Minor in Hispanic and Latin American Studies",
        "Program Page url": "https://catalog.qu.edu/arts-sciences/modern-languages/minor-hispanic-latinamerican-studies/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in History is offered through the College of Arts and Sciences. Our students explore the complex processes of human interaction, social change and political activity through a detailed analysis of the past. The history major will develop a critical understanding of human experience through the lenses of political, social, economic, cultural, and intellectual history. They develop strong analytical, research, and communication skills which prepares them for careers in fields such as law, education, journalism, public service, and business.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/history/history-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in History",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The History minor provides students with the critical skills they need to analyze and interpret the past while helping them understand the present. They learn to evaluate historical evidence, construct arguments, and communicate their ideas effectively. The minor offers a broad foundation in historical knowledge and prepares students for a variety of careers or for further study.",
        "program website url": "https://catalog.qu.edu/arts-sciences/history/history-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in History",
        "Program Page url": "https://catalog.qu.edu/arts-sciences/history/history-minor/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in History and Philosophy of Science",
        "Program Page url": "https://www.admissions.caltech.edu/why-caltech/academics/majors-minors/history-and-philosophy-science"
    },
    {
        "Concentration name": null,
        "description": "The minor in Human Movement provides students with a foundational understanding of the anatomy and physiology of human movement. Coursework emphasizes the study of exercise science, including biomechanics, motor control, and exercise physiology. Students also gain hands-on experience through laboratory coursework focused on the assessment and analysis of human movement.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=48&poid=13744",
        "Accreditation status": null,
        "Program name": "Minor in Human Movement",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": "Human Resource Management",
        "description": null,
        "program website url": "https://catalog.qu.edu/programs/business-administration-bs/",
        "Accreditation status": "AACSB International - Accredited",
        "Program name": "Bachelor of Science in Human Resource Management",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Students who pursue an individualized major have the opportunity to design their own course of study with the help of a faculty advisor. An individualized major allows students to integrate courses from different departments or schools that are not offered within existing majors at the university. This option is available to students who have already declared a major, but who have discovered an area of interest that cannot be pursued within one of the existing majors offered at Quinnipiac. Individualized majors must be at least 36 credits and must be approved by the Individualized Major Committee. The mission of the individualized major is to facilitate the educational goals of highly motivated students who wish to pursue an interdisciplinary course of study that cannot be accomplished within existing major programs.",
        "program website url": "https://catalog.qu.edu/undergraduate/college-arts-sciences/individualized-major-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Individualized Major",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Individualized Major is a program for students who wish to design their own major or combine two or more existing majors. It allows students to pursue their unique interests while developing a coherent and rigorous academic plan. Students work closely with faculty advisors to create a curriculum tailored to their specific goals, which may include interdisciplinary studies, unique career paths, or preparation for advanced graduate study. The program emphasizes critical thinking, research skills, and effective communication, preparing students for diverse professional and academic opportunities.",
        "program website url": "https://catalog.qu.edu/academics/arts-sciences/individualized-major-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Individualized Major",
        "Program Page url": "https://catalog.qu.edu/academics/majors/"
    },
    {
        "Concentration name": null,
        "description": "An individualized minor is designed by a student in consultation with an adviser from each of the participating departments and approved by the dean of the student’s school and the dean of the school offering the individualized minor. Students are encouraged to pursue such a minor to enhance their major field of study, to provide breadth to their education, or to explore areas of interdisciplinary interest. Students proposing an individualized minor must: 1. Have completed at least 30 credits at Quinnipiac and have a cumulative GPA of at least 2.75. 2. Meet with a faculty adviser from each of the participating departments to develop a program of study consisting of a minimum of 18 credits with at least 12 credits at the 200-level or above. No more than six credits from the student’s major may count toward the individualized minor. 3. Submit a proposal for the individualized minor to the academic dean of their major school for review and approval no later than the completion of 75 credits. The proposal must include: A completed Individualized Minor Planning Form signed by the student, adviser(s) from the participating department(s), and the dean of the school offering the individualized minor. A current advising report. A statement written by the student explaining the academic purpose of the individualized minor and how it will enhance the student’s major or provide breadth to the student’s education. A list of proposed courses including course numbers, titles, and credit hours. An explanation of how the courses are connected to one another to create a cohesive academic experience. 4. Maintain a minimum GPA of 2.0 in the individualized minor.",
        "program website url": "https://catalog.qu.edu/undergraduate/academic-regulations/requirements/individualized-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Individualized Minor",
        "Program Page url": "https://catalog.nau.edu/Catalog/details?&plan=BUSIMN"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Industrial Engineering",
        "Program Page url": "https://www.youtube.com/watch?v=9MlM3-WpMdA"
    },
    {
        "Concentration name": null,
        "description": "Interdisciplinary Studies is a liberal arts degree offered through the College of Arts and Sciences. The BA in Interdisciplinary Studies allows students to develop a program of study that combines two or more traditional disciplines, areas of study, or pre-professional programs offered at the University. Working with faculty advisors, students develop a unique, personalized course of study tailored to their individual interests and career goals. This program is for students who want to develop a broad knowledge base that incorporates multiple areas of study and apply critical thinking skills to complex problems. Graduates of the program are prepared for diverse careers in a variety of fields and for advanced study.",
        "program website url": "https://catalog.qu.edu/undergraduate/college-arts-sciences/interdisciplinary-studies-ba/",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in Interdisciplinary Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Interdisciplinary Studies is a flexible degree completion program designed for adult learners who wish to complete a bachelor's degree at Quinnipiac University. Students work with an advisor to craft a unique course of study around an individualized theme, which allows them to combine credits from previous coursework and learning experiences with new courses taken at Quinnipiac. Students may also complete a minor. The program enables students to pursue their academic interests in a flexible, accessible, and supportive environment. This degree is designed to help adult learners achieve their personal and professional goals through a self-designed course of study, allowing them to draw connections across multiple disciplines.",
        "program website url": "https://catalog.qu.edu/programs/interdisciplinary-studies-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Interdisciplinary Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "International business continues to grow as the world becomes more interconnected and companies seek global opportunities. The International Business program provides students with the critical skills and knowledge needed to succeed in global careers. The curriculum is interdisciplinary, blending business core courses with international studies, economics, culture and language courses. Students develop a global perspective, cross-cultural understanding, and the ability to navigate complex international business environments. The program prepares graduates for a variety of roles in multinational corporations, international organizations, government agencies, and entrepreneurial ventures with a global focus.",
        "program website url": "https://catalog.qu.edu/undergraduate/business/international-business-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in International Business",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in International Business is designed for students who want to develop an understanding of the global business environment. This interdisciplinary minor prepares students to analyze and navigate the complexities of international trade, finance, and cultural differences. Students will gain insights into global markets, international management strategies, and the impact of geopolitics on business decisions, enhancing their career prospects in an increasingly interconnected world.",
        "program website url": "https://catalog.qu.edu/business/entrepreneurship-strategy/international-business-minor/",
        "Accreditation status": null,
        "Program name": "Minor in International Business",
        "Program Page url": "https://catalog.qu.edu/business/entrepreneurship-strategy/international-business-minor/"
    },
    {
        "Concentration name": null,
        "description": "The minor in International Studies requires 18 credits in International Studies courses or approved courses outside the International Studies program. The minor helps students develop an understanding of the interconnected nature of the global economy, politics, and culture. The minor requires a minimum of three credits at the 300-level or above. Students must consult with the International Studies program coordinator before registering for courses in the minor.",
        "program website url": "https://catalog.qu.edu/programs/arts-sciences/international-studies-minor/",
        "Accreditation status": null,
        "Program name": "Minor in International Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Journalism program prepares students for careers as journalists in a variety of media, including print, broadcast, and online. Students learn to research, report, write, edit, and produce journalistic content with a strong emphasis on ethical practices and critical thinking. The curriculum combines foundational courses in journalism principles with hands-on experience in multimedia storytelling, data journalism, investigative reporting, and convergent media production. Graduates are equipped with the skills necessary to adapt to the evolving media landscape and to contribute to informed public discourse.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/journalism/ba-journalism/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Journalism",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Justice and Community Engagement, BA is an interdisciplinary program designed to prepare students to understand the causes and consequences of injustice, explore pathways for positive social change and develop skills for community engagement. The curriculum emphasizes critical inquiry, ethical reasoning, and practical application, providing students with the knowledge and tools necessary to address complex social issues.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=47&poid=12952",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Justice and Community Engagement",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Law in Society explores the various ways that law shapes and is shaped by our society. Students will engage with historical, political, philosophical, ethical, and sociological questions related to the law. The Law in Society program is designed for students interested in law school, graduate school, or careers in law-related fields such as paralegal, policy analyst, criminal justice, or government.",
        "program website url": "https://catalog.qu.edu/arts-sciences/justice-law/law-society-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Law in Society",
        "Program Page url": "https://catalog.qu.edu/arts-sciences/justice-law/law-society-ba/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Management provides students with an understanding of basic management concepts and practices to prepare them for leadership roles in any organization. Students will explore topics such as ethical decision-making, global management, human resource management, organizational behavior, and strategic management, and will learn how to apply these concepts in a variety of business and organizational settings. The minor is a valuable addition to any major, providing a foundation in management that complements a wide range of academic interests and career goals.",
        "program website url": "https://catalog.qu.edu/undergraduate/schools-colleges/business/management-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Management",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in marketing provides students with a strong foundation in contemporary marketing theory and practice, preparing them for a variety of careers in business, nonprofit organizations, and government. Students learn how to analyze markets and consumers, develop effective marketing strategies, and implement integrated marketing communication campaigns. The curriculum emphasizes both quantitative and qualitative approaches to marketing, equipping students with the analytical skills needed to make data-driven decisions and the creative skills to develop innovative marketing solutions. The program also offers opportunities for students to gain practical experience through internships, case studies, and real-world projects, fostering a hands-on learning environment.",
        "program website url": "https://catalog.qu.edu/undergraduate/business/marketing-bs/",
        "Accreditation status": "AACSB-accredited (The Association to Advance Collegiate Schools of Business)",
        "Program name": "Bachelor of Science in Marketing",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "A marketing minor allows students majoring in another field to augment their primary area of study with a focus on understanding customers and markets and developing products, services and communications to meet market needs. Students explore the creation of value through customer relationships, pricing strategies, digital marketing, professional selling and market research. The minor introduces students to the core concepts and principles of marketing, and offers elective courses that allow students to further develop their understanding of marketing to help them advance their career goals.",
        "program website url": "https://catalog.qu.edu/undergraduate/business/marketing/marketing-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Marketing",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Mathematics is a challenging and rewarding field of study that provides a foundation for a wide range of careers and graduate programs. The BA program in Mathematics offers students the flexibility to explore the breadth of mathematical disciplines, including pure mathematics, applied mathematics, statistics, and computer science. Students in the program develop critical thinking, problem-solving, and analytical skills that are highly valued in today’s data-driven world. The curriculum provides a strong theoretical background while also emphasizing the practical applications of mathematics. Graduates are well-prepared for careers in fields such as data science, finance, actuarial science, education, and various technology sectors, as well as for further study in mathematics or related fields.",
        "program website url": "https://catalog.qu.edu/programs/college-arts-sciences/mathematics-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Mathematics",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The minor in mathematics provides a strong foundation in a field that is critical in many areas of endeavor, ranging from actuarial and data science to engineering and mathematical finance, from economics and education to medicine and business. Students with a strong aptitude for mathematics or those who plan to pursue graduate work in fields requiring a strong background in quantitative reasoning should consider a minor in mathematics. Students minoring in mathematics develop logical and analytical skills and gain a deeper understanding of mathematical principles through coursework in areas such as calculus, discrete mathematics, linear algebra, and statistics.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/mathematics/mathematics-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Mathematics",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Mechanical Engineering program provides students with a broad and rigorous education across a wide range of engineering topics, while cultivating creativity, critical thinking, problem-solving skills and a sense of professionalism and ethics. Graduates are well-prepared to enter the profession and contribute immediately to engineering design, analysis, and development in a diverse set of fields including manufacturing, aerospace, biomedical, energy, transportation and materials. The program also serves as excellent preparation for graduate study in a variety of fields including engineering, business, law and medicine.\nStudents completing the program will be able to:\n*   Identify, formulate, and solve complex engineering problems by applying principles of engineering, science, and mathematics.\n*   Apply engineering design to produce solutions that meet specified needs with consideration of public health, safety, and welfare, as well as global, cultural, social, environmental, and economic factors.\n*   Communicate effectively with a range of audiences.\n*   Recognize ethical and professional responsibilities in engineering situations and make informed judgments, which must consider the impact of engineering solutions in global, economic, environmental, and societal contexts.\n*   Function effectively on a team whose members together provide leadership, create a collaborative and inclusive environment, establish goals, plan tasks, and meet objectives.\n*   Develop and conduct appropriate experimentation, analyze and interpret data, and use engineering judgment to draw conclusions.\n*   Acquire and apply new knowledge as needed, using appropriate learning strategies.",
        "program website url": "https://catalog.qu.edu/undergraduate/engineering/mechanical-engineering-bs/",
        "Accreditation status": "The Bachelor of Science in Mechanical Engineering program is accredited by the Engineering Accreditation Commission of ABET, www.abet.org.",
        "Program name": "Bachelor of Science in Mechanical Engineering",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Through our minor in military science, you can gain an understanding of Army leadership, national security, military history and ethics. Offered in collaboration with the Army Reserve Officers Training Corps (ROTC) at the University of New Haven, this 20-credit program will prepare you to serve as a commissioned officer in the US Army, US Army Reserve or Army National Guard.",
        "program website url": "https://www.qu.edu/info-for/veterans-military/",
        "Accreditation status": null,
        "Program name": "Minor in Military Science",
        "Program Page url": "https://www.qu.edu/info-for/veterans-military/"
    },
    {
        "Concentration name": null,
        "description": "The minor in music provides a foundation in music theory, history, and performance for students who want to continue their study of music without pursuing it as a primary course of study. The minor requires completion of 18 credits in music courses.",
        "program website url": "https://catalog.qu.edu/undergraduate/college-arts-sciences/music-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Music",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Nursing (BSN) program at Quinnipiac University prepares graduates for entry-level professional nursing practice in a variety of healthcare settings. The program is designed to provide students with the knowledge, skills, and values essential for providing safe, high-quality, patient-centered care. Graduates are prepared to function as members of interprofessional healthcare teams, assume leadership roles, and engage in lifelong learning to promote health and improve healthcare outcomes for diverse populations. The curriculum integrates concepts from the arts, sciences, and humanities with nursing theory and practice. Students develop critical thinking, clinical judgment, communication, and technical skills through a combination of classroom instruction, laboratory simulations, and supervised clinical experiences in various healthcare settings. The program emphasizes evidence-based practice, patient safety, quality improvement, informatics, and healthcare policy. Upon successful completion of the program, graduates are eligible to take the National Council Licensure Examination for Registered Nurses (NCLEX-RN) and pursue licensure as a registered nurse.",
        "program website url": "https://catalog.qu.edu/undergraduate/health-sciences/nursing-school/nursing-bs/",
        "Accreditation status": "The baccalaureate degree program in nursing at Quinnipiac University is accredited by the Commission on Collegiate Nursing Education (CCNE), 655 K Street NW, Suite 750, Washington, DC 20001, 202-887-6791.",
        "Program name": "Bachelor of Science in Nursing",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Occupational Therapy (3+2)",
        "Program Page url": "https://bulletin.wustl.edu/undergrad/artsci/additional/degrees-in-the-professional-schools/degrees-in-the-professional-schools.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Philosophy degree is the ideal choice for those students who want to develop essential abilities for success in any endeavor, whether that means going directly into the workforce, going on to law school or graduate study, or pursuing a career in philosophy, teaching, or ministry. As a philosophy major, you’ll develop skills in critical thinking, logical reasoning, and effective written and oral communication. You’ll become adept at tackling the world’s most challenging problems by drawing from a rich tradition of philosophical concepts and arguments, and by learning how to apply ethical principles to issues in contemporary life. You will learn to articulate and defend your ideas, to engage in constructive disagreement, and to work collaboratively. You will also become a more articulate and persuasive advocate for yourself and for those around you. The BA in Philosophy provides an excellent preparation for any path you choose.",
        "program website url": "https://catalog.qu.edu/programs/philosophy-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Philosophy",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The minor in philosophy provides students with training in the critical and argumentative skills central to philosophy. Students completing the minor will have an appreciation for the historical development of philosophy as well as contemporary issues in philosophy, broadly construed. The minor requires six courses in philosophy, distributed as follows:",
        "program website url": "https://catalog.qu.edu/undergraduate/college-arts-sciences/philosophy/philosophy-minor/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Philosophy",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Doctor of Physical Therapy (DPT) program at Quinnipiac University is a full-time, entry-level DPT program for students seeking a professional degree that prepares them for careers as physical therapists. It offers a variety of academic paths toward a DPT degree, including the accelerated Bachelor of Science in Health Science Studies (BSHSS) or Bachelor of Science in Physical Therapy (BSPT)/DPT (3+3) pathway and the post-baccalaureate DPT (4+3) pathway. This comprehensive program provides students with a strong foundation in human anatomy, physiology, biomechanics, neuroanatomy, pharmacology, and exercise science. Students gain hands-on experience through clinical rotations in diverse settings, preparing them to provide evidence-based, patient-centered care. The program emphasizes critical thinking, problem-solving, and professional development, ensuring graduates are well-equipped to meet the evolving demands of the physical therapy profession. Upon graduation, students are eligible to sit for the National Physical Therapy Examination (NPTE) to become licensed physical therapists. Our graduates are highly sought after by employers and are prepared to excel in various clinical settings.",
        "program website url": "https://www.qu.edu/academics/colleges-schools-and-departments/school-of-health-sciences/physical-therapy/doctor-of-physical-therapy-entry-level/",
        "Accreditation status": "The Doctor of Physical Therapy Program at Quinnipiac University is accredited by the Commission on Accreditation in Physical Therapy Education (CAPTE), 3030 Potomac Ave., Suite 100, Alexandria, Virginia 22305-3085; telephone: 703-706-3245; email: accreditation@apta.org; website: http://www.capteonline.org. If needing to contact the program/institution directly, please call 203-582-8240 or email pt@qu.edu.",
        "Program name": "Bachelor of Science in Physical Therapy (3+3)",
        "Program Page url": "https://ptcasdirectory.apta.org/471/Quinnipiac-University?id=471&tab=coursePrerequisites"
    },
    {
        "Concentration name": null,
        "description": "The Master of Health Science (MHS) in Physician Assistant program is designed for qualified candidates who hold a bachelor’s degree prior to matriculation. The program prepares students for a demanding and rewarding career as a Physician Assistant in primary care and specialty medical practices. Upon successful completion of the academic and clinical phases of the program, graduates are eligible to take the national certifying examination (PANCE) administered by the National Commission on Certification of Physician Assistants (NCCPA). After passing the PANCE, the graduate is eligible to apply for licensure in all 50 states and the District of Columbia. The curriculum emphasizes critical thinking, problem-solving, cultural competency, health literacy, and evidence-based medicine, while fostering professionalism and ethical values. The didactic and clinical phases promote interdisciplinary collaboration and a comprehensive understanding of patient care, preparing Physician Assistants to thrive in diverse healthcare settings. The program is committed to preparing graduates to be compassionate, knowledgeable and skilled healthcare providers to meet the needs of diverse patient populations. This commitment to patient care is exemplified through rigorous coursework, hands-on clinical experiences and a dedication to lifelong learning. The Physician Assistant program aims to provide students with the knowledge and skills necessary to contribute to the healthcare team, improve patient outcomes and adapt to the evolving landscape of healthcare. With a focus on comprehensive training, ethical practice, and a patient-centered approach, the Quinnipiac University Physician Assistant program is dedicated to shaping the next generation of Physician Assistants who will make a lasting impact on healthcare and the communities they serve.",
        "program website url": "https://catalog.qu.edu/graduate-studies/health-sciences/physician-assistant-mhs/physician-assistant-mhs.pdf",
        "Accreditation status": "The Quinnipiac University Physician Assistant Program is accredited by the Accreditation Review Commission on Education for the Physician Assistant, Inc. (ARC-PA). The program maintains an active accreditation status.",
        "Program name": "Bachelor of Science in Physician Assistant (3+2)",
        "Program Page url": "https://catalog.qu.edu/graduate-studies/health-sciences/physician-assistant-mhs/physician-assistant-mhs.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Political Science is for students interested in understanding government, elections, and public policy, as well as the behavior of political actors within the United States and across the globe. Our program provides students with the critical thinking, communication, analytical and research skills necessary for success as they navigate complex political, social and economic issues. Our dynamic curriculum delves into all facets of political inquiry. From political theory to international relations, you’ll explore the underlying principles and practical applications of political systems. Gain the knowledge and skills needed for a career in law, government, public service, journalism and more.",
        "program website url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/political-science/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Political Science",
        "Program Page url": "https://www.qu.edu/schools/arts-and-sciences/programs/bachelors-degree/political-science/"
    },
    {
        "Concentration name": null,
        "description": "The minor in political science offers students an opportunity to learn about governments, public policies, political processes and political behavior. It is designed to provide students with a deeper understanding of political issues through the study of American government, political theory, international relations and comparative government. Students who minor in political science learn to critically analyze political behavior, institutions and public policy. They will improve their written and oral communication skills and develop an understanding of the relationship between policy and democratic processes. The minor provides a strong academic complement to majors across the university, including those in the natural sciences, business, communication and health sciences.",
        "program website url": "https://catalog.qu.edu/programs/political-science-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Political Science",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Quinipiac's Bachelor of Arts in Professional Studies program is an online degree completion program that combines classroom, prior learning, and real-world experience, allowing adult learners to complete a bachelor's degree. Students in the Professional Studies Program are able to earn academic credit for knowledge and skills acquired through life experience, prior work, training, military service, and volunteer experience. The program provides adult learners with the opportunity to earn a bachelor's degree and enhance their professional skills with a flexible course schedule that allows students to continue working while they learn.",
        "program website url": "https://catalog.qu.edu/programs/college-arts-sciences/professional-studies-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Professional Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Professional Studies",
        "Program Page url": "https://www.goodwin.edu/majors/professional-studies/bs-degree-program-outcomes"
    },
    {
        "Concentration name": null,
        "description": "Public relations is the strategic communication process that builds mutually beneficial relationships between organizations and their publics. Our hands-on Public Relations program focuses on teaching you the skills necessary to become a highly effective and successful public relations practitioner, able to think strategically, solve problems, create compelling content, and tell a brand’s story across various media channels. As a PR major, you’ll be prepared to work as a public relations specialist, media relations specialist, social media manager, content creator, brand manager, event planner and more.\nThe bachelor’s degree in public relations combines practical, hands-on learning experiences with theoretical knowledge. You’ll develop a strong understanding of ethics, media relations, digital media, social media, content creation, client relations, analytics and the strategic processes of public relations. Through engaging coursework, internships, and student-run agencies, you'll gain valuable real-world experience and build a portfolio of work to showcase your talents.",
        "program website url": "https://www.qu.edu/schools/communications/programs/bachelors-degree/public-relations/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Public Relations",
        "Program Page url": "https://www.qu.edu/schools/communications/programs/bachelors-degree/public-relations/"
    },
    {
        "Concentration name": null,
        "description": "The Religious Studies minor helps students understand religion as an academic discipline. Students will explore the history, texts, beliefs, practices and social and political organizations of religious traditions from diverse global perspectives. These traditions, ancient and modern, include Judaism, Christianity, Islam, Hinduism, Buddhism, Indigenous traditions and newer religious movements. This interdisciplinary minor helps students understand the role of religion in human society by examining its impact on art, literature, philosophy, ethics, politics and science. The minor is offered by the College of Arts and Sciences.",
        "program website url": "https://catalog.qu.edu/programs/religious-studies-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Religious Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The social media minor provides students with the critical skills and knowledge required to develop and implement effective social media strategies for various organizations, ranging from corporations to government agencies to nonprofits. Students learn to create engaging content, analyze social media data, manage online communities, understand the ethical and legal implications of social media, and develop comprehensive social media campaigns. The minor covers a wide range of social media platforms, tools and techniques, preparing students to excel in a rapidly evolving digital landscape. Whether students are pursuing careers in marketing, public relations, journalism, communications, business or other fields, the social media minor offers valuable expertise to help them succeed in today’s interconnected world.",
        "program website url": "https://catalog.qu.edu/preview_program.php?catoid=41&poid=15697",
        "Accreditation status": null,
        "Program name": "Minor in Social Media",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Upon completion of the Bachelor of Arts degree in Sociology, students will be able to:\n* Identify and describe major sociological theories and concepts.\n* Analyze social issues and problems from a sociological perspective.\n* Critically evaluate empirical evidence and research methods in sociology.\n* Communicate sociological ideas effectively in written and oral formats.\n* Apply sociological knowledge and skills to address real-world problems and promote social change.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/sociology-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Sociology",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "Sociology is the scientific study of human society and social interaction. Sociologists study the social rules and processes that connect and separate people, not only as individuals, but as members of associations, groups and institutions. The sociology minor provides students with the opportunity to pursue the study of society and culture. The minor is appropriate for students seeking to expand their liberal arts education, especially those majoring in the health sciences, education, criminal justice, business, communications and liberal arts.",
        "program website url": "https://catalog.qu.edu/undergraduate/college-arts-sciences/liberal-arts/sociology-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Sociology",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Software Engineering program prepares students to apply computer science theory and engineering principles to the development of software solutions across various industries. Students gain a deep understanding of the software development life cycle, including requirements gathering, design, implementation, testing, deployment, and maintenance. The curriculum emphasizes object-oriented design, data structures, algorithms, operating systems, networking, and databases, with a strong focus on practical application through project-based learning. Graduates are equipped with the technical skills and problem-solving abilities necessary for careers in software development, quality assurance, system analysis, and other related fields.",
        "program website url": "https://catalog.qu.edu/undergraduate/engineering/software-engineering-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Software Engineering",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Spanish minor allows students to develop an intermediate level of proficiency in Spanish and a deeper understanding of Spanish-speaking cultures. Students in all disciplines can benefit from the acquisition of skills in a language that is vital to the economy and culture of the United States. Many career paths in the United States and abroad require the ability to communicate in Spanish, and students who have earned a Spanish minor find their career opportunities greatly enhanced. The Spanish minor consists of 18 credits above SP 102.",
        "program website url": "https://catalog.qu.edu/programs/arts-sciences/liberal-arts/spanish-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Spanish",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Sports Communications degree program at Quinnipiac University prepares students for a dynamic career in the evolving sports media landscape. Quinnipiac offers a unique program that integrates communication, media arts, and business principles directly related to the sports industry. Students will engage in hands-on learning, develop essential skills in broadcasting, journalism, digital media, and public relations, and gain a comprehensive understanding of sports management and marketing. Our curriculum emphasizes practical experience through internships, campus media organizations, and real-world projects, ensuring graduates are well-equipped to excel in various roles such as sports journalists, broadcasters, social media managers, public relations specialists, and marketing professionals within the collegiate, professional, and corporate sports sectors. With a strong focus on ethical communication and innovative storytelling, the program fosters critical thinking and professional development, preparing students to be leaders and innovators in the sports communications field.",
        "program website url": "https://catalog.qu.edu/programs/arts-sciences/media-arts/sports-communications-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Sports Communications",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Applied Statistics and Data Science minor offers students from a wide range of majors the opportunity to cultivate their skills in statistical analysis, programming, and data management. Data science is a rapidly growing field with an increasing demand for skilled professionals who can interpret and analyze large datasets. Students will develop a strong foundation in statistical concepts and methodologies, including descriptive statistics, inferential statistics, regression analysis, and machine learning techniques. Students will also learn to use statistical software (e.g., R, Python) and develop skills in data visualization, data manipulation, and database management. Through hands-on projects and real-world case studies, students will apply their knowledge to solve complex problems and make data-driven decisions. The minor will prepare students for careers in diverse industries such as finance, healthcare, marketing, and technology, as well as for further graduate studies in data science or related fields.",
        "program website url": "https://www.qu.edu/schools/arts-and-sciences/programs/minor/applied-statistics-and-data-science/",
        "Accreditation status": null,
        "Program name": "Minor in Statistics",
        "Program Page url": "https://www.qu.edu/schools/arts-and-sciences/programs/minor/applied-statistics-and-data-science/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (BA) in Sustainability and Environmental Policy focuses on interdisciplinary study in social, political, economic and scientific issues related to sustainability. Graduates will be prepared to address the challenges of sustainable development through policy-making, strategic planning and public engagement. This program promotes critical thinking about environmental issues, as well as the design and implementation of solutions for a sustainable future. The curriculum combines fundamental scientific principles, social science perspectives and policy analysis to develop a comprehensive understanding of sustainability challenges and solutions. Students develop a comprehensive understanding of current and historic environmental problems, their root causes and potential solutions. The curriculum includes a core of sustainability and environmental policy courses, along with a selection of electives from various disciplines, including natural sciences, social sciences, humanities and business, allowing students to tailor their studies to their specific interests within the broad field of sustainability. Experiential learning opportunities, such as internships, research projects and community engagement initiatives, provide hands-on experience and prepare students for careers in government agencies, non-profit organizations, businesses and international bodies dedicated to sustainability.",
        "program website url": "https://catalog.qu.edu/undergraduate/arts-sciences/sustainability-environmental-policy-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Sustainability and Environmental Policy",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Supply Chain Management will introduce students to the key concepts and techniques necessary to understand the complex interrelationships of the integrated logistics and supply chain management functions. The minor will expose students to all the major components of supply chain management, including logistics and distribution, procurement, inventory management, production and operations management, and technology in the supply chain.",
        "program website url": "https://catalog.qu.edu/programs/business/supplychainmanagementminor/",
        "Accreditation status": null,
        "Program name": "Minor in Supply Chain Management",
        "Program Page url": "https://catalog.qu.edu/programs/"
    },
    {
        "Concentration name": null,
        "description": "A Minor in Visual Arts offers students the opportunity to learn about the history and theory of art and develop fundamental skills in art-making in different media. This Minor in Visual Arts provides students with a broad understanding of the artistic process—from creating the art piece to understanding the cultural and historical contexts of the art. Through hands-on studio work and art history courses, students learn how to analyze visual works of art and how to utilize different artistic methods and materials to create their own works. The minor prepares students with strong research, critical thinking and analysis skills which are highly valued in any profession. Many Visual Arts minor graduates pursue careers in fields that include graphic design, photography, museum curatorship, arts administration, art therapy, fine art, illustration, and publishing, among others. Students who minor in Visual Arts are also well-prepared for graduate study in art history, fine art, graphic design, art therapy and more.",
        "program website url": "https://www.qu.edu/schools/arts-and-sciences/programs/minor/fine-arts/",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Minor in Visual Arts",
        "Program Page url": "https://www.qu.edu/schools/arts-and-sciences/programs/minor/fine-arts/"
    },
    {
        "Concentration name": null,
        "description": "The Women’s and Gender Studies Minor invites students to critically examine gender, race, class, sexuality, age, nation, and ability. Drawing on the humanities, social sciences, and natural sciences, the minor provides students with the critical tools necessary to understand the diverse experiences of women and other marginalized groups, as well as the structures of gender and power in various social, historical, cultural, and political contexts. Students will also be introduced to feminist thought and activism through an intersectional lens and will develop skills in critical thinking, writing, and analysis. Students minoring in Women’s and Gender Studies will be better prepared to understand and address issues related to social justice and equality in their academic, professional, and personal lives.",
        "program website url": "https://catalog.qu.edu/undergraduate/college-arts-sciences/womens-gender-studies/womens-gender-studies-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Women's and Gender Studies",
        "Program Page url": "https://catalog.qu.edu/programs/"
    }
]