[
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Business Administration (BSBA) program prepares students for various business-related occupations. It provides a strong foundation in essential business functions, including management, marketing, finance, accounting, and economics. The program focuses on developing critical thinking, problem-solving, and communication skills necessary for success in today’s dynamic business environment. Students will also gain an understanding of global business practices, ethical considerations, and the impact of technology on business operations. The curriculum emphasizes both theoretical knowledge and practical application, preparing graduates for entry-level positions or further graduate studies in business or related fields.",
        "program website url": "https://www.wust.edu/academics/undergraduate-programs/bachelor-of-science-in-business-administration/",
        "Accreditation status": "Washington University of Science and Technology is accredited by the Accrediting Commission of Career Schools and Colleges (ACCSC).",
        "Program name": "Bachelor of Science in Business Administration",
        "Program Page url": "https://www.wust.edu/"
    },
    {
        "Concentration name": "Leadership & Management",
        "description": "The Bachelor of Science in Business Administration (BSBA) degree program is designed to provide students with a strong foundational knowledge of business principles and practices, preparing them for a variety of careers in the dynamic business world. The curriculum integrates theoretical knowledge with practical applications, fostering critical thinking, problem-solving, and decision-making skills essential for success in today’s global economy. Through a comprehensive study of key business functions such as accounting, finance, marketing, management, and economics, students develop a holistic understanding of how organizations operate. The program emphasizes ethical leadership, innovation, and sustainability, encouraging students to become responsible and effective business professionals. Graduates are equipped to pursue entry-level positions in various industries, entrepreneurship, or further their education in graduate programs. The Leadership & Management concentration focuses on developing students' abilities to lead teams, manage projects, and make strategic decisions in diverse organizational settings. Students will explore leadership theories, organizational behavior, human resource management, and strategic planning, preparing them for managerial and leadership roles.",
        "program website url": "https://www.wust.edu/academics/undergraduate/bachelor-of-science-in-business-administration-bsba",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Business Administration with a concentration in Leadership and Management",
        "Program Page url": "https://www.wust.edu/undergraduate"
    },
    {
        "Concentration name": null,
        "description": "At Questrom, you’ll master the fundamentals of business, then choose one of eight areas of study in which to specialize. You’ll develop analytical skills, learn to lead teams, and gain an understanding of how to achieve impact in a global society. Questrom is known for its experience-based approach to education, so you’ll solve real business problems in the classroom, apply what you learn on practicums, and engage with our extensive alumni network throughout your time as a student. After graduation, you’ll be prepared for careers ranging from finance to product management, and from healthcare to entertainment. Every BSBA student takes a core curriculum designed to provide an understanding of business fundamentals, including economics, accounting, finance, marketing, and operations. You’ll also take courses in topics such as organizational behavior, strategy, and business analytics. In addition, you’ll select one of eight areas of study—including accounting, finance, and marketing—that will serve as your concentration.",
        "program website url": "https://www.bu.edu/academics/questrom/programs/undergrad/bsba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Business Administration with a concentration in Accounting & Finance",
        "Program Page url": "https://www.bu.edu/academics/questrom/programs/undergrad/bsba/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Business Administration (BSBA) degree program at Washington University of Science and Technology (WUST) is designed to provide students with a comprehensive understanding of business principles and practices. The BSBA program covers a wide range of business functions, including management, marketing, finance, accounting, and human resources. Students will learn to analyze business problems, develop strategic solutions, and effectively communicate their ideas in a professional setting. Upon graduation, students will be well-prepared for entry-level positions in various industries or for further graduate studies in business.",
        "program website url": "https://www.wust.edu/undergraduate",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Business Administration with a concentration in Human Resources Management",
        "Program Page url": "https://www.wust.edu/undergraduate"
    },
    {
        "Concentration name": "Project Management",
        "description": "The Bachelor of Science in Business Administration (BSBA) program provides students with a broad and comprehensive understanding of business principles and practices. The curriculum is designed to develop critical thinking, problem-solving, and leadership skills essential for success in various business environments. Students will gain expertise in areas such as management, marketing, finance, accounting, and operations. The program emphasizes practical application through case studies, projects, and internships, preparing graduates for entry-level positions or further graduate studies in business.\n\nThe BSBA program at Washington University of Science and Technology offers several concentrations, allowing students to specialize in a particular area of business. These concentrations provide in-depth knowledge and skills tailored to specific career paths, enhancing students' marketability and career prospects.",
        "program website url": "https://www.wust.edu/academics/undergraduate-programs/bachelor-of-science-in-business-administration-bsba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Business Administration with a concentration in Project Management",
        "Program Page url": "https://www.wust.edu/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Information Technology (BSIT) program offers a comprehensive curriculum designed to equip students with the knowledge and skills necessary to thrive in the dynamic field of information technology. This program emphasizes both theoretical foundations and practical applications, preparing graduates for a wide range of IT roles. Students will gain expertise in areas such as programming, database management, network administration, cybersecurity, and web development. The curriculum is regularly updated to reflect the latest industry trends and technologies, ensuring that graduates are well-prepared to meet the demands of the modern workforce. Through hands-on projects, labs, and internships, students will develop critical thinking, problem-solving, and teamwork skills essential for success in the IT industry.",
        "program website url": "https://www.wust.edu/undergraduate",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Information Technology",
        "Program Page url": "https://www.wust.edu/undergraduate"
    },
    {
        "Concentration name": "Cybersecurity",
        "description": "Introduction: The Bachelor of Science in Information Technology (BSIT) program is designed to provide students with a comprehensive understanding of various IT domains. This program is structured to prepare students for diverse roles in the rapidly evolving technology landscape, focusing on both theoretical knowledge and practical skills. The BSIT curriculum covers core areas such as programming, database management, network administration, cybersecurity, and project management. Students will develop problem-solving abilities, critical thinking, and technical competencies essential for success in the IT industry. The program emphasizes hands-on experience through labs, projects, and internships, ensuring graduates are well-equipped to meet the demands of the modern workforce. Whether students aim to become software developers, network engineers, cybersecurity analysts, or IT consultants, the BSIT program offers a flexible and rigorous pathway to achieve their career goals.\nProgram Learning Outcomes: Upon successful completion of the Bachelor of Science in Information Technology program, students will be able to:\n1. Apply fundamental IT concepts and principles to solve real-world problems.\n2. Analyze, design, and implement secure and efficient information systems.\n3. Demonstrate proficiency in various programming languages and software development methodologies.\n4. Manage and maintain databases, networks, and IT infrastructure.\n5. Evaluate and recommend appropriate technological solutions for organizational needs.\n6. Communicate effectively, both orally and in writing, on technical and professional topics.\n7. Collaborate effectively in team environments, adhering to ethical and professional standards in the IT field.\n8. Specialize in one of the following concentrations: Data Analytics, Cybersecurity, Networking & Cloud Computing, or Software Development.",
        "program website url": "https://wust.edu/academics/bachelor-of-science-in-information-technology/",
        "Accreditation status": "Washington University of Science and Technology (WUST) is accredited by the Accrediting Commission of Career Schools and Colleges (ACCSC). ACCSC is a recognized accrediting agency by the U.S. Department of Education.",
        "Program name": "Bachelor of Science in Information Technology with a concentration in Cybersecurity",
        "Program Page url": "https://wust.edu/uploads/extra_file/17628979515961WUST%20Catalog%20Nov.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Information Technology provides a curriculum to develop a broad background in information technology while providing depth in areas related to software development, data management, networking, and cybersecurity. The program provides the knowledge and skills necessary to design, implement, and administer secure and effective information technology systems. Students develop knowledge in the application of mathematical principles, current programming languages, database systems, web systems, operating systems, and computer networks. The program prepares students for a wide range of positions, including information systems manager, database administrator, network administrator, cybersecurity analyst, and software developer. Graduates are prepared for careers in industry or government and for further academic study.",
        "program website url": "https://catalog.ku.edu/professional-studies/information-technology-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Information Technology with a concentration in Enterprise Information Management",
        "Program Page url": "https://catalog.ku.edu/professional-studies/information-technology-bs/"
    },
    {
        "Concentration name": "Software Engineering",
        "description": "The Bachelor of Science (BS) in Information Technology degree prepares graduates for a wide range of careers in the information technology field. Students completing this program will have the necessary knowledge and skills to assist organizations in meeting their needs for developing, implementing, supporting, and managing information systems and infrastructure. The program focuses on the technical aspects of information technology with concentrations that allow students to specialize in areas such as cloud computing, computer forensics, cybersecurity, game design, IT management, networking, and software engineering. Graduates are prepared for careers such as network administrator, systems analyst, software developer, cybersecurity analyst, database administrator, web developer, and IT project manager.",
        "program website url": "https://www.una.edu/business/undergraduate/bachelor-of-science-information-tech/index.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Information Technology with a concentration in Software Engineering",
        "Program Page url": "https://www.una.edu/business/undergraduate/bachelor-of-science-information-tech/index.html"
    }
]