{
    "new_fields_data": {
        "womens_college": "no\nEvidence: On its \"History & Traditions\" page, the official Midway University website states, \"On May 12, 2016, the Midway University Board of Trustees voted to become fully coeducational in all of its undergraduate programs by fall 2016.\" Prior to this, the daytime undergraduate programs were for women only. A press release on the university's website also confirms that the Board of Trustees voted to \"transition the University to a fully coeducational institution and begin admitting men into its daytime undergraduate programs.\"",
        "cost_of_living_min": "null",
        "cost_of_living_max": "null",
        "orientation_available": "Yes.\n\nEvidence: Midway University offers a \"SOAR\" (Student Orientation, Advising, and Registration) program for new students. Information about SOAR can be found on the university's website on the \"Admitted Students\" page: https://www.midway.edu/admitted-students/.",
        "college_tour_after_admissions": "null"
    },
    "university_data": {
        "university_name": "Midway University\nEvidence: The official university website, www.midway.edu, explicitly states the name \"Midway University\". The name is also confirmed on the university's official athletics website and its Wikipedia page.",
        "college_setting": "Null. The official university website for Midway University, www.midway.edu, does not explicitly state the college setting as urban, suburban, or rural.",
        "type_of_institution": "Private, non-profit coeducational institution.\n\nEvidence: The \"At a Glance\" page on the official Midway University website explicitly states, \"Midway University is a private, non-profit coeducational institution founded in 1847 as the Kentucky Female Orphan School.\"",
        "student_faculty": "15:1",
        "number_of_campuses": "null\n\nEvidence: The official Midway University website and other reliable sources consistently refer to a single campus located in Midway, Kentucky. However, none of the web pages explicitly state that the university has \"one campus.\" For example, the university's Wikipedia page describes the school as being \"located on a 200-acre (0.81 km2) working farm in the heart of the Kentucky Bluegrass region. The campus overlooks Midway, a small town in central Kentucky.\" A virtual tour of the university also showcases a single campus. Despite all information pointing to a single campus, the number of campuses is not explicitly stated.",
        "total_faculty_available": "null",
        "total_programs_available": "null",
        "total_students_enrolled": "2,025\nEvidence: https://www.midway.edu/at-a-glance/",
        "total_graduate_programs": "6",
        "total_international_students": "null",
        "total_students": "2,025\nEvidence: https://www.midway.edu/at-a-glance/",
        "total_undergrad_majors": "null",
        "countries_represented": "26\nEvidence:\nURL: https://www.midway.edu/admissions/international-students/"
    },
    "address_data": {
        "street1": "512 East Stephens Street\n\nEvidence: https://www.midway.edu/contact-us/",
        "street2": null,
        "county": "Woodford County\n\nEvidence:\n\n*   URL: https://www.midway.edu/about-us/at-a-glance/\n*   URL: https://www.midway.edu/about-us/our-story-history/",
        "city": "Midway\n\nEvidence: https://www.midway.edu/maps-directions/",
        "state": "Kentucky\nEvidence: Located in Midway in Woodford County, Kentucky (USA)",
        "country": "United States",
        "zip_code": "40347\n\nEvidence:\n\nThe zip code is explicitly stated on the \"Contact Us\" page of the official Midway University website (www.midway.edu). The campus mailing address is listed as:\n\n512 East Stephens Street\nMidway, Kentucky 40347\n\nAdditionally, the mailing address for residential students is provided as:\n\nStudent's Name\nUPO Box # ____\nMidway University\n512 E. Stephens Street\nMidway, KY 40347-1112"
    },
    "application_data": {
        "application_requirements": "### First-Time Student Application Requirements:\n\nTo apply for admission to Midway University as a first-time student, applicants must complete the online application and submit official high school transcripts. Transcripts can be mailed directly from the high school or sent electronically through a secure service. Additionally, official SAT or ACT scores are required, and can be sent from the respective testing organizations. The university's SAT code is 1467, and the ACT code is 1528.\n\nThe recommended minimum academic criteria for admission are a GPA of 2.5 or a GED score of 660, with at least a 165 on each test section. A minimum ACT score of 18 or an equivalent SAT score is also recommended. For students majoring in nursing or science, chemistry is an expected high school course, while trigonometry or pre-calculus is recommended for those pursuing science, math, or accounting majors.\n\n### International Student Application Requirements:\n\nInternational applicants must complete the online application and pay a nonrefundable $30 application fee, along with a $50 international processing and mailing fee. Official high school transcripts, marksheets, or academic records are required. Proof of English proficiency is also necessary for non-native English speakers, with acceptable tests including TOEFL, IELTS, Duolingo, or PTE. Specific minimum scores are a TOEFL score of 500 (written), 173 (computer-based), or 61 (internet-based); an IELTS score of 6.0; a Duolingo score of 85; or a PTE score of 44. Native English speakers are required to submit ACT or SAT scores. Furthermore, all international applicants must provide a financial guarantee demonstrating their ability to fund their first year of education.",
        "application_fees": "null",
        "test_policy": "Null",
        "courses_and_grades": "### Academic Requirements for Admission to Midway University\n\nCourse Requirements:\n\nTo be considered for admission, applicants should have completed the following high school coursework:\n\n*   English: 4 years\n*   Algebra: 3 years\n*   Science: 2 years (Chemistry is recommended for those intending to major in nursing or other sciences)\n*   Social Sciences: 2 years\n*   Trigonometry or Pre-Calculus: Recommended for students planning to major in science, math, or accounting.\n\nGrade and Standardized Test Score Recommendations:\n\nMidway University recommends the following minimum academic standards for incoming students:\n\n*   GPA: A cumulative high school GPA of 2.5.\n*   GED: A score of 660, with at least 165 on each of the four test subjects.\n*   ACT: A composite score of 18.\n*   SAT: An equivalent score to the ACT requirement.\n\nIt is important to note that these are recommended minimums, and meeting them does not guarantee admission. The university encourages prospective students to make contact to have their individual educational history evaluated in relation to the admission standards.\n\nEvidence for these requirements can be found on the Midway University \"First-Time Students\" admissions webpage: https://www.midway.edu/admissions-aid/undergraduate-admissions/first-time-students/",
        "recommendations": "Null",
        "personal_essay": "Not Required.\n\nEvidence: The Midway University page on the Common App website explicitly states, \"No personal essay required - First Year\". The official Midway University website's page on undergraduate admissions for first-time students also lists the required application materials, and a personal essay is not included in that list.",
        "writing_sample": "Not Required.\n\nEvidence: The Common App page for Midway University explicitly states \"No personal essay required - First Year.\" The university's admissions page for first-time students lists the application, high school transcript, and SAT or ACT scores as the primary requirements, with no mention of a writing sample. Additionally, CollegeVine, a college application resource, also indicates that Midway University does not require essays.",
        "additional_information": "Null.",
        "additional_deadlines": "### Key Dates for Financial Aid and Scholarships at Midway University\n\nMidway University has established several important deadlines for students seeking financial aid and scholarships. These dates are crucial for prospective and current students to ensure they are considered for various funding opportunities.\n\nScholarship Deadlines:\n\n*   Campus Visit Scholarship: Students who officially visit the campus through the Admissions Office before January 1 of their intended entry year are eligible for this scholarship. The application for this scholarship must be submitted by January 15 of the same year.\n*   Scholarship Day: Typically held in the first week of February, this event is for eligible students who must RSVP to attend. Continuing to update academic documents prior to the Scholarship Day deadline is encouraged for eligibility.\n\nFinancial Aid Deadlines:\n\n*   FAFSA Priority for Freshmen: For the fall semester, high school students are encouraged to file the Free Application for Federal Student Aid (FAFSA) as soon as possible after October 1.\n*   General FAFSA Recommendation: To be considered for need-based aid, the university advises all students to complete and file the FAFSA as soon as possible after October 1 each year.",
        "tuition_fees": "null"
    },
    "contact_data": {
        "contact_information": "Campus Mailing Address & Switchboard\n512 East Stephens Street\nMidway, Kentucky 40347\nPhone - 800.952.4122 or 859.846.5788\nWebsite: www.midway.edu\n\nAdmissions Office\nEmail: admissions@midway.edu\nPhone: 800.952.4122\nFax: 859.846.5787\n\nFinancial Aid Office\nPhone: 859.846.5410\nFax: 859.846.5751\nEmail: faid@midway.edu\n\nRegistrar's Office\nEmail: registrar@midway.edu\nPhone: 859.846.5728\nFax: 859.846.5774\n\nEvidence for the contact information is available on the \"Contact Us\" and directory pages of the official Midway University website (www.midway.edu) as well as other university-related pages.",
        "logo_path": "null.",
        "phone": "800.952.4122 or 859.846.5788\n\nEvidence:\n\nThe phone numbers are explicitly stated on the \"Contact Us\" page of the official Midway University website.\n\nURL: https://www.midway.edu/contact-us/",
        "email": "admissions@midway.edu\nEvidence:\n- Admissions FAQs page: The Midway University Admissions Frequently Asked Questions page explicitly states, \"Call us at 1-800-952-4122 or email admissions@midway.edu.\"\n- Admissions Office Directory: The Faculty & Staff Directory for the Admissions Office lists the email as admissions@midway.edu.\n- KHEAA Profile: The Kentucky Higher Education Assistance Authority (KHEAA) profile for Midway University lists the admissions email as admissions@midway.edu.\n- Coconote Admissions Overview: The Midway University Admissions Overview on Coconote provides admissions@midway.edu as the contact email.",
        "secondary_email": "null",
        "website_url": "https://www.midway.edu",
        "admission_office_url": "https://www.midway.edu/admissions/",
        "virtual_tour_url": "https://www.midway.edu/experience/",
        "financial_aid_url": "https://www.midway.edu/admissions-aid/financial-aid/\n\nEvidence: The URL is explicitly provided on the Midway University website's \"Tuition & Financial Aid\" page. The \"Financial Aid\" menu item in the \"Admissions & Aid\" section links directly to this URL."
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/MidwayUniv\n\nEvidence: The Facebook URL is explicitly stated on Midway University's official \"Social Media\" webpage (https://www.midway.edu/social-media/).",
        "instagram": "https://www.instagram.com/midwayuniversity/",
        "twitter": "https://twitter.com/MidwayUniv\n\nEvidence: https://www.midway.edu/social-media/",
        "youtube": "https://www.youtube.com/user/MidwayUniversity\nEvidence: [Midway University - YouTube](https://www.youtube.com/user/MidwayUniversity)",
        "tiktok": "null\nEvidence: https://www.midway.edu/social-media/",
        "linkedin": "https://www.linkedin.com/school/midway-university/\n\nEvidence:\n\nThe LinkedIn URL is explicitly available on the Midway University website on their \"Social Media\" page: www.midway.edu/social-media/. The page lists the university's official social media accounts, including a link to their LinkedIn profile. Additionally, the footer of the university's website, www.midway.edu, contains a \"LinkedIn Logo Icon\" which links to the same LinkedIn page."
    },
    "student_statistics_data": {
        "grad_avg_tuition": "null",
        "grad_international_students": "null\nwww.midway.edu",
        "grad_scholarship_high": "null",
        "grad_scholarship_low": "$3,000\n\nEvidence: https://catalog.midway.edu/content.php?catoid=21&navoid=834",
        "grad_total_students": "229",
        "ug_avg_tuition": "",
        "ug_international_students": "null",
        "ug_scholarship_high": "Full-tuition.\n\nEvidence:\n\n*   URL: https://www.midway.edu/academics/academic-catalog/\n*   Supporting Text: \"Qualified candidates will have the opportunity at the end of their sophomore year to apply for a scholarship that will cover full tuition.\"\n*   URL: https://www.midway.edu/admissions/pinkerton-scholars/\n*   Supporting Text: \"This prestigious award provides up to two full-tuition scholarships annually and offers recipients access to a vibrant community of high-achieving scholars.\"",
        "ug_scholarship_low": "$500 per year.\n\nEvidence: The \"Online Access Scholarship\" is listed with a value of \"$500 per year\" on the Scholarships page of the Midway University Academic Catalog.",
        "ug_total_students": "1284\nEvidence: https://www.midway.edu/at-a-glance/"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "null",
        "is_act_required": "False.\n\nEvidence: A news article on the official Midway University website, dated August 10, 2022, explicitly states that the university is \"test optional.\" The article clarifies that \"students need not take a standardized test, such as the ACT or SAT, to be considered for admission to the University.\" This policy was extended through the 2023-2024 academic year. While the general admissions page lists the submission of scores as a process step, the official announcement clarifies this is not a mandatory requirement for general admission.",
        "is_analytical_not_required": "True\nEvidence:\n\nThe official Midway University website, on its \"Undergraduate Admissions - First-Time Students\" page, outlines the admissions process. The required application components are listed as:\n\n*   Complete the application – Apply Online.\n*   Submit high school transcript.\n*   Submit Official SAT or ACT scores.\n\nThis list does not include an application essay, personal statement, or any other form of analytical writing. The absence of such a requirement in the detailed admissions process on the university's official website serves as explicit evidence that it is not required.\n\nURL:\nhttps://www.midway.edu/admissions/undergraduate-admissions/first-time-students/",
        "is_analytical_optional": "null",
        "is_duolingo_required": "null",
        "is_els_required": "null",
        "is_english_not_required": "null",
        "is_english_optional": "False\nEvidence: https://www.midway.edu/admissions/international-admissions/international-undergraduate-admissions/",
        "is_gmat_or_gre_required": "False\nEvidence: A review of Midway University's graduate program admission requirements does not explicitly state that the GMAT or GRE is a required component for application. The admissions pages for the Master of Business Administration (MBA), Master of Science in Nursing (MSN), and Master of Education (M.Ed.) detail other necessary qualifications such as a completed application, official transcripts, letters of recommendation, and specific GPA requirements, but do not mention the GMAT or GRE. For instance, the MBA program requirements can be found on the university's website, which outlines the application process without mandating standardized test scores. Similarly, the admission criteria for the MSN and M.Ed. programs are detailed on their respective pages, and neither lists the GMAT or GRE as a prerequisite. Interested applicants can find the specific requirements for each program by navigating to the admissions section of the official Midway University website at www.midway.edu.",
        "is_gmat_required": "null",
        "is_gre_required": "Null\n\nEvidence: After a thorough review of the Midway University website (www.midway.edu) through multiple targeted searches, no explicit statement was found requiring a GRE score for all graduate programs for international students. The search results did not provide a definitive university-wide policy on this matter. Information regarding specific program requirements, including any standardized test scores, would likely be found on the individual program pages, but a general requirement for all international graduate students is not explicitly stated.",
        "is_ielts_required": "null",
        "is_lsat_required": "Null",
        "is_mat_required": "Null",
        "is_mcat_required": "Null",
        "is_pte_required": "True.\n\nEvidence:\n\n*   URL: [https://www.midway.edu/admissions-aid/international-admissions/international-undergraduate-admissions/](https://www.midway.edu/admissions-aid/international-admissions/international-undergraduate-admissions/)\n    *   Quote from page: \"Submit Official Proof of English proficiency – TOEFL, IELTS, Duolingo or PTE results are required if applicant is an non-native English speaker...a...PTE score of 44 are generally required minimum scores for admission.\"\n*   URL: [https://www.midway.edu/admissions-aid/international-admissions/international-graduate-degree-seeking-students/](https://www.midway.edu/admissions-aid/international-admissions/international-graduate-degree-seeking-students/)\n    *   Quote from page: \"TOEFL, IELTS, DUOLINGO or PTE - results are required if applicant is a non-native English speaker...a...PTE score of 53 are generally required minimum scores for admission.\"",
        "is_sat_required": "True\n\nEvidence:\n\nThe official Midway University website, on its \"Undergraduate Admissions - First-Time Students\" page, explicitly states that applicants should \"Submit Official SAT or ACT scores.\" Furthermore, under the \"Recommended Minimum Criteria\" for admission, it lists an \"18 ACT or equivalent SAT score.\" This indicates that while there might be recommendations, the submission of scores is a required part of the application process.\n\nURL: [https://www.midway.edu/admissions/undergraduate-admissions/first-time-students/](https://www.midway.edu/admissions/undergraduate-admissions/first-time-students/)",
        "is_toefl_ib_required": "True\nEvidence:\n\nThe official Midway University website, on its \"International Undergraduate Admissions\" page, explicitly states the requirement for English proficiency test scores for non-native English speakers. The page lists the following as required minimum scores for admission: \"TOEFL of 500 written, 173 (computer version), 61 (internet based), a score of 6.0 bands on the IELTS, a DUOLINGO score of 85 or PTE score of 44 are generally required minimum scores for admission.\" This information can be found at the following URL: [https://www.midway.edu/admissions/international-admissions/international-undergraduate-admissions/](https://www.midway.edu/admissions/international-admissions/international-undergraduate-admissions/)",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": 0
    }
}