{
    "new_fields_data": {
        "womens_college": "no\n\nEvidence: The \"Clarkson at a Glance\" page on the official university website explicitly mentions athletics teams for both men and women, stating, \"2 Division I sports teams (men's and women's ice hockey)\".",
        "cost_of_living_min": "$13,753\n\nEvidence: https://www.clarkson.edu/student-affairs/housing-residential-services/room-meal-plan-rates",
        "cost_of_living_max": "The official website for Clarkson University does not explicitly state a single maximum cost of living for students. However, the maximum cost can be calculated by combining the highest-cost options for housing, meals, and other estimated expenses provided on the university's website.\n\nBased on the university's published rates for the 2025-2026 academic year, the most expensive housing option is a single residence hall room at a cost of $5,675 per semester. For a full academic year, this amounts to $11,350. The full meal plan for all residential students is listed at $4,139 per semester, totaling $8,278 for the academic year.\n\nThe university's estimated costs for other living expenses for the 2026-2027 academic year include $1,560 for books, course materials, supplies, and equipment, $900 for personal expenses, and $1,596 for transportation.\n\nBy combining the highest-cost housing and meal plans with the other estimated expenses, the maximum cost of living for a student at Clarkson University can be calculated as follows:\n\n*   Housing: $11,350\n*   Meals: $8,278\n*   Books and Supplies: $1,560\n*   Personal Expenses: $900\n*   Transportation: $1,596\n\nTotal Maximum Estimated Cost of Living: $23,684",
        "orientation_available": "null",
        "college_tour_after_admissions": "yes.\n\nEvidence: https://www.clarkson.edu/admissions/undergraduate/accepted-student-events"
    },
    "university_data": {
        "university_name": "Clarkson University\n\nEvidence:\n\nThe name \"Clarkson University\" is explicitly stated on the university's official website, www.clarkson.edu. Specifically, the \"About\" page identifies the institution as \"Clarkson University\". The \"History\" page also refers to the institution as \"Clarkson University\". Furthermore, the main homepage consistently uses the name \"Clarkson University\".",
        "college_setting": "## Remote Town Setting Defines Clarkson University's Campus\n\nClarkson University is situated in a remote town or village setting. Its main campus is located in Potsdam, New York, a place described as a \"quintessential college town.\" The university itself refers to its location as the \"Village of Potsdam,\" where the 640-acre wooded and waterfront campus is nestled.\n\nThis characterization is supported by external sources, with one explicitly defining the campus setting as a \"remote town.\" Student perspectives align with this description, often referring to the area as a \"rural setting\" appreciated for its natural beauty and tranquility, while also noting the limited off-campus entertainment options.\n\nThe university's proximity to the expansive Adirondack Park is a key feature of its location, offering students abundant opportunities for outdoor activities and recreation. This connection to the natural environment further solidifies its identity as a campus integrated with its non-urban surroundings.",
        "type_of_institution": "Private, national research university.\n\nEvidence: https://www.clarkson.edu/about",
        "student_faculty": "13:1\n\nEvidence: https://www.clarkson.edu/about/clarkson-glance",
        "number_of_campuses": "2\nEvidence:\n*   Campus Locations: Main Campus - Potsdam, NY; Capital Region Campus - Latham, NY; online master's, PhD and certificate programs.\n    *   URL: https://www.clarkson.edu/about/clarkson-glance",
        "total_faculty_available": "313.",
        "total_programs_available": "Null",
        "total_students_enrolled": "4,000+\n\nEvidence:\nURL: https://www.clarkson.edu/about/clarkson-glance",
        "total_graduate_programs": "null",
        "total_international_students": "null",
        "total_students": "null\nEvidence: I was unable to find the total number of students explicitly stated on the official Clarkson University website (www.clarkson.edu) after performing multiple searches for terms including \"total student enrollment,\" \"enrollment statistics,\" \"facts and figures,\" \"about us,\" \"institutional research,\" and \"fact book.\"",
        "total_undergrad_majors": "null",
        "countries_represented": "null"
    },
    "address_data": {
        "street1": "8 Clarkson Ave.\n\nEvidence: https://www.clarkson.edu/admissions/visit-clarkson/directions-and-maps-potsdam-campus",
        "street2": null,
        "county": "St. Lawrence County\nEvidence: https://www.clarkson.edu/potsdam-campus",
        "city": "Potsdam\n\nEvidence: [https://www.clarkson.edu/](https://www.clarkson.edu/)",
        "state": "New York\nEvidence: https://www.clarkson.edu/",
        "country": "United States\n\nEvidence:\nThe \"Contact\" page on the official Clarkson University website explicitly lists the university's address as:\n\nPotsdam Campus\n8 Clarkson Ave • Potsdam, NY 13699.\n\nThe abbreviation \"NY\" stands for New York, a state within the United States.",
        "zip_code": "13699\nEvidence:\n- URL: https://www.clarkson.edu/contact\n- URL: https://www.clarkson.edu/potsdam-campus"
    },
    "application_data": {
        "application_requirements": "### Undergraduate Application Requirements:\n\nRequired Materials:\n*   Official high school transcript.\n*   A letter of recommendation from a school counselor, principal, or headmaster.\n*   A second letter of recommendation from a core subject teacher.\n*   A personal statement or essay (250-650 words).\n\nOptional Materials:\n*   SAT/ACT scores: Clarkson is test-optional. If submitted, the scores will be considered during the admissions process. Clarkson also accepts self-reported test scores.\n*   A résumé, portfolio, links to projects, or your YouTube channel.\n*   Additional letters of recommendation from employers, coaches, etc.\n\nFor International Undergraduate Students:\n*   Official secondary school transcript, mark sheets, or national exam scores.\n*   Two letters of recommendation.\n*   Official English proficiency test scores (TOEFL, IELTS, Duolingo English Test, PTE, or Manchester Exam), unless applying from a country with an English testing waiver.\n\n### Graduate Application Requirements:\n\nRequired Materials:\n*   All post-secondary transcripts.\n*   Résumé or CV (Curriculum Vitae).\n*   A 250-500 word personal statement explaining your interest in Clarkson University and your chosen program.\n*   Contact information for two or three references who will provide letters of recommendation.\n\nPotentially Required Materials:\n*   GMAT/GRE test scores (not required for all programs).\n*   English proficiency test scores (if applicable).\n\nFor International Graduate Students:\n*   In addition to the above, international applicants will need to provide proof of financial support to obtain an I-20.\n\nEvidence:\nThe application requirements are explicitly stated on the following pages of the official Clarkson University website:\n*   Undergraduate Admission Requirements: https://www.clarkson.edu/admissions/undergraduate/application-process-and-requirements/undergraduate-admission-requirements\n*   International Admissions Requirements: https://www.clarkson.edu/admissions/undergraduate/application-process-and-requirements/international-admissions-requirements\n*   Graduate Admission Requirements: https://www.clarkson.edu/admissions/graduate/application-process-requirements/graduate-admission-requirements\n*   Graduate Application Instructions: https://www.clarkson.edu/admissions/graduate/application-process-requirements/application-instructions",
        "application_fees": "For domestic applicants, there is no application fee for first-year entry when using the Clarkson or Common App. The application fee for graduate programs is waived for both domestic and international applicants.\n\nEvidence:\n\n*   Domestic Undergraduate Applicants: On the \"Apply\" page of the Clarkson University website (https://www.clarkson.edu/apply), it states, \"Students who are applying for first-year entry will not be charged an application fee if you apply using the Clarkson or Common App.\"\n*   Graduate Applicants (Domestic and International): The \"Graduate Admission Requirements\" page (https://www.clarkson.edu/graduate-admission-requirements) and the \"Application Instructions\" page for graduate admissions both indicate that the application fee is currently waived for all graduate program applicants.",
        "test_policy": "Undergraduate: Clarkson continues to be test optional.\n\nGraduate: GRE or GMAT Test Scores (not required for all programs).\n\nEvidence:\n\n*   Undergraduate Test Policy: The policy is explicitly stated on the \"Undergraduate Admissions FAQs\" page on the official Clarkson University website: [https://www.clarkson.edu/undergraduate-admissions/admissions/undergraduate-admissions-faqs](https://www.clarkson.edu/undergraduate-admissions/admissions/undergraduate-admissions-faqs)\n*   Graduate Test Policy: The policy is explicitly stated on the \"Application Instructions - Graduate Admissions & Aid\" page on the official Clarkson University website: [https://www.clarkson.edu/graduate-admissions-aid/application-instructions](https://www.clarkson.edu/graduate-admissions-aid/application-instructions)",
        "courses_and_grades": "While Clarkson University's official website, www.clarkson.edu, does not specify a minimum GPA or a prescribed list of high school courses for admission, a holistic review of each applicant's academic background is conducted.\n\nThe university's undergraduate admission requirements page indicates that a student's entire record and potential are taken into consideration. While there are no mandated high school courses, a strong college preparatory program is recommended to demonstrate readiness for the university's curriculum.\n\nProspective students are required to submit an official high school transcript as part of their application. Although a minimum GPA is not listed, third-party sources suggest that the average GPA of admitted students is competitive. It is also noted that the rigor of the high school curriculum, including honors and Advanced Placement (AP) courses, is considered in the evaluation process.\n\nFor further details on the application process and required documents, please refer to the Undergraduate Admission Requirements page on the Clarkson University website: https://www.clarkson.edu/undergraduate-admissions/admission-requirements.",
        "recommendations": "Undergraduate Programs:\n\nTwo letters of recommendation are required. Specifically, one letter must be from a school counselor, principal, or headmaster, and the other from a core subject teacher.\n\nEvidence:\n*   `https://www.clarkson.edu/undergraduate-admissions/admissions/undergraduate-admissions-faqs`\n*   `https://www.clarkson.edu/admissions/undergraduate-admissions/how-apply`\n*   `https://www.clarkson.edu/admissions/international-admissions`\n\nGraduate Programs:\n\nTwo or three letters of recommendation are required from a faculty member or professional reference. The exact number varies depending on the specific program.\n\nEvidence:\n*   `https://www.clarkson.edu/graduate-admissions/admissions/application-instructions`\n*   `https://www.clarkson.edu/graduate-admissions/admissions/graduate-admission-requirements`",
        "personal_essay": "Required.\n\nEvidence: The Clarkson University \"Undergraduate Admission Requirements\" page lists \"Personal statement or essay (250-650 words)\" as a required supporting material for the application. The URL for this page is: https://www.clarkson.edu/undergraduate-admissions/how-apply",
        "writing_sample": "Required.\n\nEvidence:\n\n*   Undergraduate Admissions: The Clarkson University website lists \"Personal statement or essay (250-650 words)\" as a required supporting material for undergraduate applications.\n*   Graduate Admissions: The graduate admission requirements explicitly state the need for \"A 250-500 word personal statement telling us why you want to attend Clarkson University and why you think you are a good fit for your program of interest.\"\n*   The Clarkson School: Applicants to The Clarkson School are required to submit an \"Essay\" of approximately 250-300 words.",
        "additional_information": "Null",
        "additional_deadlines": "After a thorough search of the Clarkson University website (www.clarkson.edu), no explicit deadlines for scholarships or financial aid, apart from general application timelines, could be located. While the website provides information on the types of aid available and the application process, specific dates for scholarship applications or financial aid submissions are not clearly listed in a consolidated format. Therefore, based on the available information on the official university website, a list of additional deadlines cannot be provided.",
        "tuition_fees": "null"
    },
    "contact_data": {
        "contact_information": "Potsdam Campus\n8 Clarkson Ave\nPotsdam, NY 13699\nPhone: 315-268-6400\n\nCapital Region Campus\n40 British American Boulevard\nLatham, NY 12110\nPhone: 518-631-9831\n\nAdmissions\n*   Undergraduate Admissions: admissions@clarkson.edu, 800-527-6577\n*   Transfer Admissions: tradmission@clarkson.edu, 800-527-6577\n*   Graduate Admissions: graduate@clarkson.edu, 518-631-9831\n\nKey Services\n*   Alumni Relations: alumni@clarkson.edu, 315-268-6467\n*   Career Center: career@clarkson.edu, 315-268-6477\n*   Dean of Students: deanofstudents@clarkson.edu, 315-268-6620\n*   Human Resources: clarksonhr@clarkson.edu, 315-268-6497\n*   Office of Information Technology: helpdesk@clarkson.edu, 315-268-HELP\n*   Student Administrative Services: sas@clarkson.edu, 315-268-6451\n\nCampus Safety & Security\n*   Potsdam: 315-268-6666\n\nEvidence:\nThe contact information is explicitly stated on the following page of the official Clarkson University website: https://www.clarkson.edu/request-information and https://www.clarkson.edu/contact.",
        "logo_path": "https://www.clarkson.edu/sites/default/files/2020-09/Clarkson-Primary-Logo-Green-RGB.png\nEvidence: https://www.clarkson.edu/brand",
        "phone": "315-268-6400\nEvidence:\nURL: [https://www.clarkson.edu/](https://www.clarkson.edu/)\nPage Content: The phone number is explicitly stated on the homepage of the official university website, under the \"Main Campus\" contact information, which reads: \"Phone: 315-268-6400\".",
        "email": "admission@clarkson.edu\nEvidence: https://www.clarkson.edu/graduate-admissions/contact-us",
        "secondary_email": "null",
        "website_url": "https://www.clarkson.edu",
        "admission_office_url": "https://www.clarkson.edu/admissions-financial-aid\n\nEvidence:\n\nThe URL is explicitly stated on the \"Admissions & Financial Aid\" page of the official Clarkson University website. This page serves as the main hub for all admissions-related information, including undergraduate, graduate, transfer, and international admissions.",
        "virtual_tour_url": "https://www.clarkson.edu/admissions/visits-events-tours",
        "financial_aid_url": "https://www.clarkson.edu/financial-aid\n\nEvidence:\n\nThe URL https://www.clarkson.edu/financial-aid is explicitly stated as the main \"Financial Aid\" page on the official Clarkson University website. The content on this page provides comprehensive information about financial aid for undergraduate, transfer, graduate, and international students, including details on scholarships, grants, loans, and work-study programs."
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/clarksonuniversity/\n\nEvidence: The official Clarkson University YouTube channel, in the description of the video \"Welcome to the International Center at Clarkson University!\", provides the following link: \"Like Clarkson U on FACEBOOK: https://bit.ly/39MelsI\". This URL redirects to https://www.facebook.com/clarksonuniversity/.",
        "instagram": "https://www.instagram.com/clarksonuniv/\nEvidence:\nhttps://www.clarkson.edu/annual-university-events\nhttps://www.clarkson.edu/university-newsletters",
        "twitter": "https://twitter.com/ClarksonUniv\n\nEvidence:\n\nWhile the Twitter URL is not explicitly stated on the main homepage of `www.clarkson.edu`, it is explicitly linked on the Clarkson University Athletics website, a subsidiary of the official university website. The athletics website, `clarksonathletics.com`, features a Twitter icon in its footer that directs to https://twitter.com/ClarksonUniv. Additionally, a giving day page on the main `clarkson.edu` website includes a \"Share via Twitter\" option, which also links to the same Twitter handle.",
        "youtube": "Null.\n\nThe YouTube URL for Clarkson University is not explicitly stated on the official university website, www.clarkson.edu. A thorough review of the website and site-specific searches did not yield a direct link to an official YouTube channel.",
        "tiktok": "null",
        "linkedin": "https://www.linkedin.com/school/clarkson-university/\n\nEvidence: The LinkedIn URL is explicitly available on the official Clarkson University website, www.clarkson.edu, and can be found by navigating to the website's footer, where a LinkedIn icon is present and links to the provided URL."
    },
    "student_statistics_data": {
        "grad_avg_tuition": "null",
        "grad_international_students": "null",
        "grad_scholarship_high": "null",
        "grad_scholarship_low": "null",
        "grad_total_students": "null",
        "ug_avg_tuition": "null",
        "ug_international_students": "225\nEvidence: [Clarkson University Common Data Set 2023-2024](https://www.clarkson.edu/sites/default/files/2024-01/Clarkson%20CDS%202023-24.pdf) (Page 3, Section B2: Enrollment by Racial/Ethnic Category, under the \"Nonresident alien\" category for degree-seeking undergraduates)",
        "ug_scholarship_high": "The highest undergraduate scholarship at Clarkson University is the Ignite Presidential Fellowship, which covers all tuition costs.\n\nEvidence:\nThe Clarkson University website states, \"The Ignite Presidential Fellowship is a merit-based scholarship covering all tuition costs for 10 first-time students entering Clarkson for four years (eight semesters) of undergraduate study.\" This information can be found on the \"Scholarships, Grants, and Loans\" and \"Admissions & Financial Aid\" pages of the university's website.",
        "ug_scholarship_low": "$500\n\nEvidence:\n\nThe lowest undergraduate scholarship explicitly stated on the Clarkson University website is the Alumni Connection Award, with a value of $500 per year. According to the university's \"Scholarships, Grants, and Loans\" page, students who indicate on their application that a sibling, parent, aunt, uncle, or cousin attended Clarkson may qualify for this scholarship. The page specifies that only one such award will be granted regardless of the number of alumni family members.\n\nAdditionally, the \"Achievement and Investment in Merit Scholarship\" is listed with an annual award of $500 for eligible New York high school graduates.",
        "ug_total_students": "null"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "I have searched the official website of Clarkson University (www.clarkson.edu) and its associated pages to determine if a student can apply to multiple programs. My search included the undergraduate and graduate admissions sections, as well as frequently asked questions.\n\nBased on the information available on the university's website, I could not find an explicit statement that either allows or prohibits students from applying to multiple programs. The website does not provide a clear \"True\" or \"False\" answer to this question.\n\nTherefore, I am unable to provide a definitive answer and the corresponding evidence from the Clarkson University website.",
        "is_act_required": "False\nEvidence: https://www.clarkson.edu/student-administrative-services-sas/undergraduate-admissions-faqs",
        "is_analytical_not_required": "null",
        "is_analytical_optional": "null",
        "is_duolingo_required": "Null\nI am unable to provide an answer. The information is not explicitly stated on the Clarkson University website.",
        "is_els_required": "null",
        "is_english_not_required": "False\nEvidence:\nThe official Clarkson University website explicitly states that international applicants must demonstrate English proficiency. The \"International Admissions Requirements\" page lists the accepted tests and minimum scores: TOEFL (80), IELTS (6.5), Duolingo English Test (115), PTE (56), and others. While there are exemptions for students from specific English-speaking countries or those who meet certain academic criteria, the general requirement for English proficiency is clearly established.\n\nURL:\n*   International Admissions Requirements: https://www.clarkson.edu/admissions/international-admissions/international-admissions-requirements\n*   International students English Proficiency Exemptions: https://www.clarkson.edu/international-center/new-students-and-visitors/international-students-english-proficiency-exemptions",
        "is_english_optional": "Null",
        "is_gmat_or_gre_required": "Null",
        "is_gmat_required": "null\nEvidence:\n- Admissions Requirements - Graduate Business Programs - Clarkson University: https://www.clarkson.edu/graduate-business-programs/admissions-requirements states \"Submission of a GMAT or GRE exam.\" but also mentions \"There are specific instances where the submission of theses exams may be substituted or waived\".\n- Application Instructions - Graduate Admissions & Aid - Clarkson University: https://www.clarkson.edu/graduate/admissions-aid/application-instructions lists \"GRE or GMAT Test Scores (not required for all programs)\".\n- Postgraduate Courses Offered by Clarkson University | QSChina: https://www.qschina.cn/universities/clarkson-university/postgraduate states \"Business programs will require GMAT scores, while most other courses will require GRE scores. Engineering programs based at the university's Capital Region Campus don't require GRE or GMAT testing.\"",
        "is_gre_required": "null",
        "is_ielts_required": "False\n\nEvidence:\nThe Clarkson University \"International Admissions Requirements\" page explicitly states that English proficiency test scores are required, *unless* the applicant is from a country with an English testing waiver or meets other specific criteria for a waiver. Since there are stated exceptions, an IELTS score is not required for all international students for any program. This information can be found at the following URL:\nhttps://www.clarkson.edu/admissions/undergraduate/international-admissions/international-admissions-requirements",
        "is_lsat_required": "null",
        "is_mat_required": "False\n\nEvidence: The Clarkson University \"Graduate Admission Process\" webpage lists all the required components for an application. This list includes items such as the application form, statement of purpose, resume, letters of recommendation, and transcripts. Under the \"Standardized Test Scores\" section, it explicitly discusses the requirements for the GRE and GMAT, noting they are not required for most programs. The Miller Analogies Test (MAT) is not mentioned anywhere on this page as a requirement or an option. The absence of the MAT from this comprehensive list of requirements explicitly indicates that it is not required for admission.\n\nURL: https://www.clarkson.edu/graduate-admissions/graduate-admission-process",
        "is_mcat_required": "False. \n\nEvidence: While an MCAT score may be submitted as a substitute for the GMAT/GRE for some graduate business programs, it is not a requirement for admission to Clarkson University's healthcare programs like Physician Assistant studies, Occupational Therapy, or Physical Therapy. Several pages on the university website outlining admission requirements for its direct-entry and graduate healthcare programs do not list the MCAT as a required test.",
        "is_pte_required": "False\nEvidence:\nThe Clarkson University website, on its \"International Admissions Requirements\" page, lists several acceptable English proficiency tests for international applicants. These include TOEFL, IELTS, Duolingo English Test, and PTE. The page specifies a minimum score of 56 for the PTE Academic test. Since PTE is one of multiple accepted tests, it is not a mandatory requirement for all international applicants. The \"Graduate Admission Requirements\" page also lists PTE as an accepted test with a minimum score of 56.\n\nURL:\n*   https://www.clarkson.edu/international-admissions-requirements\n*   https://www.clarkson.edu/graduate-admission-requirements\n*   https://www.clarkson.edu/admissions-requirements-graduate-business-programs",
        "is_sat_required": "False\nEvidence: https://www.clarkson.edu/admissions/undergraduate/undergraduate-admissions-faqs",
        "is_toefl_ib_required": "True\nEvidence: The Clarkson University \"International Admissions Requirements\" page explicitly states, \"Official English proficiency test scores, unless you are applying from a country with English testing waivers. Acceptable tests and minimum scores are: TOEFL: 80.\" This information is also reiterated on the \"Graduate Admission Requirements\" page, which lists \"English proficiency test scores, if applicable. Accepted tests with minimum acceptable scores are: TOEFL (80)...\". The university's website for Graduate Business Programs also confirms this requirement for non-native English-speaking applicants.",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": 0
    }
}