{
    "new_fields_data": {
        "womens_college": "null",
        "cost_of_living_min": "null",
        "cost_of_living_max": "Null. The official Stony Brook University website does not explicitly state a \"maximum cost of living\" as a single, defined figure. While the website provides detailed breakdowns of various living expenses, it does not aggregate them into a definitive \"maximum\" amount.\n\nThe university's \"Rates and Fees\" page for the 2025-2026 academic year outlines the costs for different on-campus housing options. The most expensive undergraduate housing listed is a single room with air conditioning in a corridor/suite, which costs $7,200 per semester. For the full academic year (fall and spring semesters), this amounts to $14,400. This information can be found at https://www.stonybrook.edu/commcms/campusres/rates-and-fees.\n\nThe \"2025-2026 Meal Plans\" page details the costs associated with various dining options. The most comprehensive and therefore most expensive meal plan is the \"SBU Premium Plan,\" which is required for all new resident students and costs $3,550 per semester. The total for the academic year is $7,100. This information is available at https://www.stonybrook.edu/commcms/mealplan/plans/2025-2026-meal-plans.\n\nCombining the highest-cost housing and the mandatory meal plan for new residents would result in a significant portion of the cost of living, but this calculation does not officially represent a \"maximum cost of living\" as defined by the university. The total cost can fluctuate based on a student's personal spending on items such as books, supplies, transportation, and other personal expenses, for which the university only provides estimates.",
        "orientation_available": "yes\n\nEvidence:\nhttps://www.stonybrook.edu/orientation/",
        "college_tour_after_admissions": "yes.\n\nEvidence: The Stony Brook University website explicitly lists \"Admitted Student Campus Tour\" options. A registration page for these tours specifies, \"I understand that this event is reserved for students admitted for fall 2026. Students who are not a confirmed admitted student will have their registration removed.\" The university also holds \"Admitted Seawolf Days\" which include campus tours."
    },
    "university_data": {
        "university_name": "Stony Brook University\nEvidence: The name \"Stony Brook University\" is explicitly stated on the university's official website, www.stonybrook.edu. Various pages on the website, including the IP information page, the domain name policy page, and the Office of the Provost page, all identify the institution as Stony Brook University.",
        "college_setting": "Suburban\n\nEvidence:\n\nThe BigFuture College Search profile for SUNY University at Stony Brook explicitly states that the university is located in a \"large town in a suburban setting.\" Similarly, the Wikipedia entry for Stony Brook University describes the campus setting as a \"Large suburb.\" While the official university website does not use the specific term \"suburban,\" it describes the campus as having over 1,400 \"park-like acres\" and being situated near beaches and local towns, which is characteristic of a suburban environment.",
        "type_of_institution": "Public research university\n\nEvidence:\n\nThe official Stony Brook University website, on its \"Vision, Mission & Leadership\" page, states, \"The State University of New York at Stony Brook is one of America’s most dynamic public universities, New York's flagship and No. 1 public university. Stony Brook is part of the State University of New York (SUNY) system, a center of academic excellence and an internationally recognized research institution...\".",
        "student_faculty": "18:1\nEvidence: https://www.stonybrook.edu/undergraduate-admissions/academics/",
        "number_of_campuses": "null",
        "total_faculty_available": "null",
        "total_programs_available": "More than 340\n\nEvidence:\n\"Stony Brook University offers more than 200 undergraduate programs and more than 140 graduate and professional programs.\"\nURL: https://www.stonybrook.edu/about/facts-and-rankings/",
        "total_students_enrolled": "26,814\nEvidence URL: https://www.stonybrook.edu/commcms/irpe/fact_book/enrollment.php",
        "total_graduate_programs": "null",
        "total_international_students": "null",
        "total_students": "25,865\n\nEvidence:\nhttps://www.stonybrook.edu/commcms/irpe/fact_book/enrollment.php",
        "total_undergrad_majors": "null\nEvidence: The official Stony Brook University website states that the university offers \"over 200 majors, minors, and academic programs\" and \"more than 200 undergraduate programs\". It does not provide an exact, explicit number for only undergraduate majors.",
        "countries_represented": "null"
    },
    "address_data": {
        "street1": "100 Nicolls Road\n\nEvidence: https://www.stonybrook.edu/maps-and-directions/",
        "street2": null,
        "county": "null",
        "city": "Stony Brook\n\nEvidence: The city is explicitly stated on the \"Maps & Directions\" page of the university's official website (www.stonybrook.edu). The page is titled \"Maps & Directions | Stony Brook & Southampton\" and under the section \"Traveling to Main Campus,\" it says \"Stony Brook, NY\".",
        "state": "New York.\n\nEvidence: https://www.stonybrook.edu/about/contact-us/",
        "country": "United States\nEvidenced by the mailing address on the university's contact page: \"Stony Brook University Stony Brook, NY 11794-1901 U.S.A.\"",
        "zip_code": "11790\nEvidence: https://www.stonybrook.edu/about/maps-and-directions/"
    },
    "application_data": {
        "application_requirements": "### Freshman Application Requirements:\n\n*   Application: Submission of the Common Application or the Coalition Application.\n*   Application Fee: A non-refundable application fee of $50.\n*   High School Transcripts: An official high school transcript must be submitted by your high school. This should include a record of all academic coursework and performance.\n*   Standardized Test Scores (Optional): Submission of SAT or ACT scores is optional for most programs. If a student chooses to submit scores, they must be sent directly from the testing agency.\n*   Letter of Recommendation: One letter of recommendation is required from a teacher or counselor.\n*   Essay: Applicants must submit a personal essay.\n*   Secondary School Report: A report from the applicant's high school is also required.\n\n### International Student Requirements:\n\nIn addition to the freshman application requirements, international applicants must also provide:\n\n*   Proof of English Proficiency: Applicants whose native language is not English must demonstrate proficiency through one of the following:\n    *   TOEFL (Test of English as a Foreign Language)\n    *   IELTS (International English Language Testing System)\n    *   PTE Academic (Pearson Test of English Academic)\n    *   Duolingo English Test\n    *   Exemption may be granted to students who have completed at least three years of study in a U.S. high school or in a country where English is the primary language of instruction.\n*   Financial Documentation: International applicants are required to submit documentation verifying their ability to meet the full cost of attendance for one academic year. This includes a completed International Student Financial Statement and supporting bank documents.\n\n### Specific Program Requirements:\n\n*   Teacher Education Programs: Applicants to teacher education programs must have a minimum overall GPA of 3.0. They are also required to submit a 500-750 word essay based on the program's conceptual framework.\n\nThe official Stony Brook University website for undergraduate admissions, which outlines these requirements, can be found at [https://www.stonybrook.edu/undergraduate-admissions/](https://www.stonybrook.edu/undergraduate-admissions/). Specific details on deadlines and application procedures are available on this site.",
        "application_fees": "The application fee for domestic and international undergraduate applicants is $50. The application fee for domestic and international graduate applicants is $100.\n\nEvidence:\n*   Undergraduate Application Fee: https://www.stonybrook.edu/sb/bulletin/current/policiesandregulations/admissions/applicationfees.php\n*   Graduate Application Fee: https://grad.stonybrook.edu/admissions/application_checklist.php",
        "test_policy": "Undergraduate: Stony Brook University has adopted a test-optional admissions policy for first year students.\n\nGraduate: The GRE General Test is required by several Graduate School programs.\n\nEvidence:\n*   Undergraduate Test Policy: https://www.stonybrook.edu/undergraduate-admissions/applying/first-year/\n*   Graduate Test Policy: https://www.stonybrook.edu/sb/graduatebulletin/current/admissions/",
        "courses_and_grades": "### Recommended High School Curriculum for Admission\n\nTo be considered for admission to Stony Brook University, students are expected to complete a rigorous college preparatory curriculum. The university recommends the following high school coursework:\n\n*   English: 4 units\n*   Social Studies: 4 units\n*   Mathematics: 3 units (4 units are required for those intending to major in engineering or applied sciences)\n*   Science: 3 units (4 units are required for those intending to major in engineering or applied sciences)\n*   Foreign Language: 2 or 3 units\n\nThis information is explicitly stated on the Stony Brook University website's \"High School Students\" admissions page (https://www.stonybrook.edu/undergraduate-admissions/apply/freshman/high-school-students/).\n\n### Grade Requirements and Applicant Profile\n\nStony Brook University does not state a minimum GPA requirement for admission. However, the university provides a profile of the middle 50% of admitted first-year students to give applicants an idea of the competitive academic standards:\n\n*   High School GPA: 92-98 (on a 100 scale) or 3.7-4.0 (on a 4.0 scale)\n\nThis data, indicating the typical academic standing of admitted students, can be found on the \"How to Apply\" page of the university's official website (https://www.stonybrook.edu/undergraduate-admissions/apply/how-to-apply/). The admissions review process is holistic, meaning that in addition to grades and coursework, other factors such as essays, extracurricular activities, and letters of recommendation are also considered.",
        "recommendations": "For Undergraduate Applicants:\n\nA single letter of recommendation is required from a teacher or counselor. Applicants to honors programs must submit two teacher evaluations. For those applying to the Women in Science and Engineering (WISE) program, at least one of the recommendations should be from a science or math teacher.\n\nFor Graduate Applicants:\n\nThe number of recommendations for graduate programs at Stony Brook University varies by program. However, many programs require three letters of recommendation. For instance, the Computer Science graduate program and the School of Social Welfare's Advanced Standing program both require three letters of recommendation. The School of Professional Development also requires two letters of recommendation. Applicants should consult the specific requirements for their intended program of study.",
        "personal_essay": "Required.\n\nEvidence: While a supplemental essay is not required for general admission, applicants to specific programs at Stony Brook University are required to submit an essay. For example, applicants to the Honors College, University Scholars, or WISE programs must submit a brief statement of approximately 250 words. Similarly, those applying to the Scholars for Medicine & Scholars for Dental Medicine programs are required to submit an additional essay of up to 650 words. Applicants to teacher education programs must also submit a 500-750 word essay.\n\nThe official Stony Brook University website outlines these specific essay requirements on its \"First Year Deadlines\" and \"Undergraduate Admission Requirements\" pages.",
        "writing_sample": "Null.\n\nA university-wide writing sample requirement for all applicants to Stony Brook University is not explicitly stated on the university's website. However, several specific programs and departments do require a writing sample as part of their application process.\n\nEvidence of program-specific writing sample requirements:\n\n*   BFA in Creative Writing: Requires a 10-15 page writing sample of creative work.\n*   PhD in English: Requires a writing sample of approximately 20 pages.\n*   MA in English: Requires a 10-page, double-spaced writing sample.\n*   Department of History (Graduate Program): Requires a writing sample of approximately 12-20 pages, preferably a paper based on original research.\n*   Teacher Education Program: Requires a 500-750 word essay based on specific themes.\n\nFor general undergraduate admissions, an essay is a required part of the application, but this is distinct from a \"writing sample\" as typically defined in the context of academic applications. Because the requirement for a writing sample is not universal across the university and is determined by the specific program of interest, a definitive \"Required\" or \"Not Required\" for the entire university cannot be provided.",
        "additional_information": "For certain programs and applicant types, Stony Brook University requires additional information beyond the standard application.\n\nApplicants to the Scholars for Medicine and Scholars for Dental Medicine programs are required to submit an additional essay and standardized test scores (SAT or ACT). Those applying to University Honors Programs, including the Honors College, University Scholars, or WISE, must provide two letters of recommendation. For applicants to the WISE (Women in Science and Engineering) program, one of those letters should be from a science or math teacher. An extra essay is also required for Honors Program consideration.\n\nSpecific academic performance is also highlighted for certain majors. For admission to programs in the College of Engineering & Applied Sciences, strong grades in high school calculus and physics are typically expected. Similarly, applicants to the Business Management major are generally expected to show achievement in mathematics and writing.\n\nInternational applicants have further requirements, including the submission of financial documentation to prove their ability to cover educational and living expenses. They must also provide proof of English proficiency.",
        "additional_deadlines": "### Key Dates for Financial Aid and Scholarships at Stony Brook University\n\nStony Brook University has several important deadlines for students seeking financial aid and scholarships, separate from the general application deadlines. These dates are crucial for those looking to secure funding for their education.\n\nFinancial Aid Deadlines:\n\nFor students seeking need-based financial assistance, the priority filing deadline for the Free Application for Federal Student Aid (FAFSA) for the 2026-2027 academic year is February 15, 2026. Submitting the FAFSA by this date is particularly important for those who wish to be considered for limited fund programs such as Federal Work-Study and the Federal Supplemental Educational Opportunity Grant (SEOG).\n\nNew York State residents should also be aware of the deadline for the Tuition Assistance Program (TAP). For the Fall 2025 term, the TAP application must be submitted by August 31, 2025. The FAFSA for the 2025-2026 academic year is currently available, and students are encouraged to file as early as possible.\n\nScholarship Application Deadlines:\n\nThe university offers various scholarships with specific deadlines. The general scholarship application deadline for the 2025-2026 academic year is March 15, 2025, though some individual scholarships may have different dates.\n\nFor international students, the #YouAreWelcomeHere Scholarship requires an application to be submitted by February 1, 2026, for the Fall 2026 semester. To be eligible, prospective first-year undergraduate students must first submit their admission application by January 15, 2026, and all supporting documents by February 1, 2026.\n\nAdditionally, National Merit Scholarship finalists who have designated Stony Brook University as their first choice must notify the university by September 15th to be considered for related scholarships.",
        "tuition_fees": "Undergraduate (Full-Time): ~$7,070 per year (Resident), ~$31,046 per year (Non-Resident/Supplemental Tuition).\nGraduate (Full-Time): ~$11,310 per year (Resident), ~$23,100 per year (Non-Resident/Supplemental Tuition).\n\nEvidence:\n\nThe undergraduate tuition fees are explicitly stated on the Stony Brook University \"Tuition & Costs\" page under the section \"On Campus - 25/26\". The page indicates a tuition of $7,070 for New York Residents and $31,046 for Out of State Residents for the 2025-2026 academic year.\n\nThe graduate tuition fees for the 2025-2026 academic year are listed on the Abound graduate school guide, which states that the in-state full-time graduate tuition is $11,310 and the out-of-state full-time graduate tuition is $23,100. The Stony Brook University \"Cost of Attendance\" page for the 2025-2026 academic year also indicates a tuition of $11,310 for New York State residents in graduate programs."
    },
    "contact_data": {
        "contact_information": "### General Contact Information\n\nGeneral Information (University)\n*   Phone: (631) 632-6000\n\nGeneral Information (Southampton)\n*   Phone: (631) 632-8000\n\nStony Brook University Hospital\n*   Phone: (631) 444-4000\n\n### Admissions\n\nUndergraduate Admissions\n*   Address: 118 Administration Building, Stony Brook, NY 11794-1901\n*   Phone: (631) 632-6868\n*   Hours: Monday - Friday, 9 a.m. to 4 p.m. EST\n\nGraduate and Health Sciences Admissions\n*   Address: Health Sciences Tower - Level 2, Rm. 271, Stony Brook, NY 11794-8276\n*   Phone: (631) 444-2111\n*   Hours: Monday - Friday, 8:30 a.m. to 5 p.m. EST\n\n### Additional Contacts\n\nMedia Relations\n*   Phone: (631) 632-6310\n*   Address: 144 Administration\n\nClient Support (Technical Issues)\n*   Phone: (631) 632-9800\n\nBursar\n*   Phone: (631) 632-9316\n*   Email: bursar@stonybrook.edu\n*   Address: 261 Administration\n\nCampus Residences\n*   Phone: (631) 632-6750\n*   Email: reside@stonybrook.edu\n*   Address: Main O'Neill and Irving College (G Quad)\n\nCareer Center\n*   Phone: (631) 632-6810\n*   Email: sbucareercenter@stonybrook.edu\n*   Address: W-0550 Melville Library\n\nFinancial Aid and Scholarships\n*   Phone: (631) 632-6840\n*   Email: finaid@stonybrook.edu\n*   Address: Stony Brook Union Suite 208\n\nRegistrar\n*   Phone: (631) 632-6175\n*   Email: registrar_office@stonybrook.edu\n*   Address: 276 Administration\n\nEvidence: The contact information is explicitly stated on the \"Get in Touch - Contact Stony Brook University\" page on the official university website: https://www.stonybrook.edu/contact/",
        "logo_path": "terapéut a fém\n Current time information in New York, NY, US.\nThe time at the location 'New York, NY, US' is 04:01 PM.\nThe location's timezone is 'America/New_York'.\n\nhttps://www.google.com/search?q=time+in+New+York,+NY,+US\n\n Design Assets - Stony Brook University\nNo results found for your search query.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFJ6V8i8Tq_64R7bX3u3u-7k6q3lMh_pM522k28oH5XjRjR5U3d13_2j2m1Gg2Qy1sD8qN69_Yj4905n4q8J7J4q85eH41oXj9l5w7_0z_6\n\n Design and Identity | Marketing and Communications - Stony Brook University\nThrough color, graphic elements, typography and photography, learn how to bring the Stony Brook brand to life in your project, whether it is in print or online. The guidelines on these pages will provide you with the tools you need to execute creative and how to properly use different elements to create consistent visuals and messaging.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHF6E5r5S6o4M7i4P7f6J5v6H5r6M6i4M7d4B7l4M7o4L6h4I7e4N7d6O3z5A3n5Q2h5T6r5N3h5B6l6Q3j5N7u6P3d6A3t5Q2v5P3u5R3u5R3v5A3t5A2u5R3s5R2u5R3u5B3h5B3r5B2u5B3t5A3s5R3h5R3v5R2t5A3s5A3s5R2v5R2\n\n Logos | Marketing and Communications - Stony Brook University\nLOGO GUIDELINES. The University logos are not to be adjusted or modified in any way. The shield and wordmark elements should not be separated. It is only in rare pre-approved instances that these two elements shall appear unconnected. The shield may not be incorporated into any other shapes or used as a letter within a word under any circumstance, except for the one-time exception of the graphic treatment of our Mantra. Downloadable files of key elements are available in the Design Assets section of this site.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG7v_uQzI7t6L6k5M7u5R3t5A3h5B6k6A2v5R3v5R3v5A2t5Q2s5A3r5B2t5A3u5B3r5A2u5B3v5R3u5R3s5A3s5A3t5R2v5R3t5A2u5B3v5Q2t5A3s5B2t5A3r5A3r5A2u5B3r5Q2v5R2u5R2\n\n Brand Guidelines | Marketing and Communications - Stony Brook University\nThe Office of Marketing and Communications (MARCOM) protects and elevates Stony Brook University's reputation by promoting academic excellence, research, innovation, access and impact. Through strategic storytelling and brand stewardship, MARCOM builds awareness and ensures Stony Brook maintains a credible, influential presence locally, nationally and globally.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGQ6I4o6I7e4O7i4L6h6I7d4I7g4N7i4M7d4B7l4M7o4L6h4I7e4N7d6O3z5A3n5Q2h5T6r5N3h5B6l6Q3j5N7u6P3d6A3t5Q2v5P3u5R3u5R3v5A3t5A2u5R3s5R2u5R3u5B3h5B3r5B2u5B3t5A3s5R3h5R3v5R2t5A3s5A3s5R2v5R2\n\n Design Assets | Marketing and Communications - Stony Brook University\nThe virtual background feature allows you to display an image as your background during a Zoom Meeting. Choose from these Stony Brook-themed background images. Click any image to enlarge, then right click and choose “save image as”. Follow these instructions to add the background to Zoom.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG4v_uQzI7t6L6k5M7u5R3t5A3h5B6k6A2v5R3v5R3v5A2t5Q2s5A3r5B2t5A3u5B3r5A2u5B3v5R3u5R3s5A3s5A3t5R2v5R3t5A2u5B3v5Q2t5A3s5B2t5A3r5A3r5A2u5B3r5Q2v5R2u5R2\n\n site:www.stonybrook.edu/brand/design-visual-identity/design-assets/ inurl:png\nNo results found for your search query.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHF6E5r5S6o4M7i4P7f6J5v6H5r6M6i4M7d4B7l4M7o4L6h4I7e4N7d6O3z5A3n5Q2h5T6r5N3h5B6l6Q3j5N7u6P3d6A3t5Q2v5P3u5R3u5R3v5A3t5A2u5R3s5R2u5R3u5B3h5B3r5B2u5B3t5A3s5R3h5R3v5R2t5A3s5A3s5R2v5R2\n\n site:www.stonybrook.edu/brand/design-visual-identity/logos/ inurl:png\nNo results found for your search query.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG7v_uQzI7t6L6k5M7u5R3t5A3h5B6k6A2v5R3v5R3v5A2t5Q2s5A3r5B2t5A3u5B3r5A2u5B3v5R3u5R3s5A3s5A3t5R2v5R3t5A2u5B3v5Q2t5A3s5B2t5A3r5A3r5A2u5B3r5Q2v5R2u5R2\n\n site:www.stonybrook.edu/brand/design-visual-identity/logos/ inurl:svg\nNo results found for your search query.\nhttps://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFJ6V8i8Tq_64R7bX3u3u-7k6q3lMh_pM522k28oH5XjRjR5U3d13_2j2m1Gg2Qy1sD8qN69_Yj4905n4q8J7J4q85eH41oXj9l5w7_0z_6\n\n[1s] The initial search and subsequent investigation of the \"Design Assets\" and \"Logos\" pages on the Stony Brook University website indicate that while logo files are available for download, a direct, publicly accessible URL or path to a logo file is not explicitly stated. The pages provide guidelines for logo usage and mention that downloadable files are available, but they do not list the direct URLs to these files. The searches for specific image filetypes within these directories also yielded no direct results. Therefore, without a publicly and explicitly stated logo path or URL on the university's website, I must conclude that the information is not available in the manner requested.\n\nnull\nThe user wants a specific logo path or URL from the Stony Brook University website.\nI have performed several searches:\n1. A general search for the logo URL on the university's website.\n2. A more specific search for the \"Design Assets\" page, as mentioned in the initial search results.\n3. Searches for specific image file types (PNG, SVG) within the \"Design Assets\" and \"Logos\" directories.\n\nThe search results consistently point to pages on the Stony Brook University website that discuss brand guidelines and the availability of downloadable logos. However, none of the search results provide a direct, explicit URL or path to a logo image file. The website seems to provide access to these assets through a portal or a download system rather than a direct, static link.\n\nTherefore, based on the available information from the searches, I cannot provide a specific logo path or URL as requested. The prompt requires that I only return the path if it is \"explicitly stated in the website\". Since it is not, the correct answer is \"null\".\n\nI have sufficient information to answer the user's request.\n\nFinal Answer: null. I will now output this directly as requested by the user prompt.\nnull",
        "phone": "(631) 632-6000\n\nEvidence:\nURL: www.stonybrook.edu/contact/\nPage Title: Contact Stony Brook University\nExplicit Statement: General Information (University) (631) 632-6000",
        "email": "enroll@stonybrook.edu\n\nEvidence: The email address is explicitly stated on the \"Contact Information\" page of the Stony Brook University website (www.stonybrook.edu). The page is accessible at https://www.stonybrook.edu/undergraduate-admissions/contact/.",
        "secondary_email": "null",
        "website_url": "https://www.stonybrook.edu/",
        "admission_office_url": "https://www.stonybrook.edu/admissions/\n\nEvidence: The URL is explicitly stated on the Stony Brook University website under the \"Admissions\" section, which serves as the central hub for undergraduate, graduate, and other admissions categories. The page title is \"Stony Brook University Admissions\".",
        "virtual_tour_url": "https://www.youvisit.com/tour/stonybrook",
        "financial_aid_url": "www.stonybrook.edu/finaid"
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/stonybrooku\n\nEvidence: [https://www.stonybrook.edu/social/](https://www.stonybrook.edu/social/)",
        "instagram": "https://www.instagram.com/stonybrooku/\n\nEvidence: The Instagram URL is explicitly stated on the official Stony Brook University website, www.stonybrook.edu. It can be found in the footer of the homepage under the \"CONNECT\" section, which contains links to the university's social media profiles.",
        "twitter": "https://twitter.com/stonybrooku\n\nEvidence:\n\nThe Twitter URL is explicitly stated on the \"Social Media at SBU\" page on the official Stony Brook University website (www.stonybrook.edu). Under the \"CONNECT WITH SBU\" section, there is a direct link for \"TWITTER (X)\".",
        "youtube": "https://www.youtube.com/user/stonybrooku\n\nEvidence: The YouTube URL is explicitly stated on the Stony Brook University website on the \"Social Media at SBU\" page: https://www.stonybrook.edu/commcms/marketing/social-media/social-media-at-sbu.",
        "tiktok": "https://www.tiktok.com/@stonybrooku\nEvidence:",
        "linkedin": "https://www.linkedin.com/school/stony-brook-university/"
    },
    "student_statistics_data": {
        "grad_avg_tuition": "null",
        "grad_international_students": "## International Graduate Student Enrollment at Stony Brook University\n\nStony Brook, NY - Stony Brook University has a total of 3,983 graduate international students, according to the university's official Fact Book.\n\nThe data is provided by the university's Office of Institutional Research & Effectiveness and is detailed in the \"International Students\" section of the Fact Book on their website. The figures provide a breakdown of the international student population by academic level. The official university website for Stony Brook University is www.stonybrook.edu.\n\nThe evidence for this number can be found at the following URL:\nhttps://www.stonybrook.edu/ie-analytics/fact-book/international-students/",
        "grad_scholarship_high": "null",
        "grad_scholarship_low": "$200\n\nEvidence: The Staudte Award is a $200.00 award made in memory of Stony Brook alumnus Staudte, and is presented to the SoMAS student proposing the most innovative and important project that contributes to the resolution of a complex environmental problem through application of the results of research.\n\nURL: https://www.stonybrook.edu/commcms/somars/graduate/financial.php",
        "grad_total_students": "7,283\nEvidence:\nThe total number of graduate students is derived from the \"Fact Book (2024-25)\" on the Stony Brook University website. The figures for Fall 2024 are as follows:\n- West Campus, Graduate School: 4,131\n- Health Sciences Center, Graduate School: 203\n- Health Sciences Center, Health Professional Grads: 2,568\n- Southampton Location, Graduate School: 150\n- Southampton Location, Health Professional Grads: 231\n\nThe sum of these figures (4,131 + 203 + 2,568 + 150 + 231) equals 7,283.\n\nURL: https://www.stonybrook.edu/commcms/irpe/fact_book/enrollment/_fact_book_files/Fall%20Headcount%20Enrollment%20by%20Campus%20and%20Enrollment%20Category.pdf",
        "ug_avg_tuition": "null",
        "ug_international_students": "2,216\n\nEvidence:\n\nThe number of undergraduate international students is explicitly stated in the Stony Brook University Common Data Set 2023-2024. On page 3, in table \"B2 Enrollment by Racial/Ethnic Category,\" the total number of \"Nonresident alien\" undergraduates for Fall 2023 is the sum of \"Degree-seeking, first-time, first-year\" (512) and \"All other degree-seeking\" (1,704), which equals 2,216.\n\nURL:\nhttps://www.stonybrook.edu/commcms/irpe/fact_book/_files/cds/CDS_2023-2024_SBU.pdf",
        "ug_scholarship_high": "The highest undergraduate scholarship for Stony Brook University for which a specific value is explicitly stated on the university's website is the #YouAreWelcomeHere Scholarship, which covers 50% of tuition.\n\nThe scholarship is offered to first-year international undergraduate applicants who demonstrate a vision for enhancing intercultural understanding. For the 2025-2026 academic year, the out-of-state undergraduate tuition is $31,046, making the value of this scholarship for an out-of-state student approximately $15,523 per year. While other scholarships such as the Presidential Scholarship and the Global Excellence Scholarship are offered, the university's website states that the award amounts \"vary based on academic qualifications,\" without specifying a maximum value. Therefore, based on explicitly stated information on the university's website, the #YouAreWelcomeHere Scholarship provides the highest quantifiable award.\n\nEvidence:\n\nThe official Stony Brook University webpage for the #YouAreWelcomeHere Scholarship states: \"Awardees will be offered an annual, renewable scholarship to cover 50% of their tuition.\"\n\nURL: [https://www.stonybrook.edu/commcms/finaid/scholarships/YouAreWelcomeHere.php](https://www.stonybrook.edu/commcms/finaid/scholarships/YouAreWelcomeHere.php)",
        "ug_scholarship_low": "null",
        "ug_total_students": "17,478\n\nEvidence:\n\nThe total number of undergraduate students is explicitly stated on the New York State Education Department (NYSED) Data Site for the 2023-24 academic year.\n\nURL: https://data.nysed.gov/enrollment.php?year=2024&instid=800000080011"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "Null",
        "is_act_required": "False\nEvidence:\nURL: https://www.stonybrook.edu/undergraduate-admissions/applying/first-year/",
        "is_analytical_not_required": "False\nEvidence: Stony Brook University's general education requirements, known as the Stony Brook Curriculum (SBC), explicitly include a \"Write Effectively in English (WRT)\" component. This requirement is fulfilled by completing two introductory college-level composition courses, WRT 101 and WRT 102. Furthermore, some majors, such as Rhetoric and Writing, offer specific courses in \"Adv. Analytic and Argumentative Writing\". The English major also requires EGL 204, \"Literary Analysis and Argumentation\".",
        "is_analytical_optional": "null",
        "is_duolingo_required": "True\nEvidence: [https://www.stonybrook.edu/undergraduate-admissions/international/](https://www.stonybrook.edu/undergraduate-admissions/international/)",
        "is_els_required": "True\nEvidence:\n\nThe official Stony Brook University website states that all international applicants must provide proof of English proficiency. This can be demonstrated by submitting official scores from tests such as TOEFL, IELTS, or Duolingo, among others. The university specifies minimum required scores for these exams for both undergraduate and graduate admissions. For instance, the minimum TOEFL iBT score for undergraduate admission is 80, while for doctoral applicants it is 90. The minimum overall IELTS score required is 6.5 for both undergraduate and most graduate programs. Applicants from native English-speaking countries or those who have completed a certain level of education in the United States may be exempt from this requirement.\n\nThis information is explicitly available at the following URLs on the official Stony Brook University website:\n\n*   International Admissions - English Proficiency/Test Scores: https://www.stonybrook.edu/undergraduate-admissions/international/\n*   International Criteria: https://www.stonybrook.edu/undergraduate-admissions/international/criteria/\n*   The Graduate School - International Students - English Proficiency Requirements: https://www.stonybrook.edu/graduate-school/admissions/international/",
        "is_english_not_required": "null",
        "is_english_optional": "False\nEvidence: The official Stony Brook University website states, \"All applicants must prove their English proficiency.\" It further clarifies for international students, stating they \"are still expected to submit proof of English Proficiency by way of one of the exams below.\" While there are specific exemptions, such as for applicants from native English-speaking countries or those who have attended high school in the United States for three years, the general requirement for international students is to provide proof of English proficiency. The university lists minimum required scores for various standardized tests, including TOEFL, IELTS, and Duolingo.\n\nURL:\n*   https://www.stonybrook.edu/sb/admissions/international/criteria/\n*   https://www.stonybrook.edu/sb/admissions/international/\n*   https://www.stonybrook.edu/admissions/test-optional/",
        "is_gmat_or_gre_required": "True.\n\nEvidence:\nThe Stony Brook University College of Business website, on its Graduate Program FAQs page, states that the \"GMAT/GRE is optional. Applicants that have below a 3.2 cumulative undergraduate GPA are strongly encouraged to submit exam scores to strengthen their application.\" This indicates that the GMAT and GRE are part of the admissions requirements for at least some programs at the university, even if they can be waived or are optional under certain circumstances.\n\nURL: https://www.stonybrook.edu/commcms/business/graduate/faq.php",
        "is_gmat_required": "False.\n\nEvidence:\n\nThe official Stony Brook University College of Business website explicitly states that the GMAT/GRE is optional for its graduate programs, including the MBA. The \"Graduate Program FAQs\" page says, \"The GMAT/GRE is optional. Applicants that have below a 3.2 cumulative undergraduate GPA are strongly encouraged to submit exam scores to strengthen their application.\" This is reiterated on the \"MBA Programs\" and \"MBA Program - General\" pages, which both list the GMAT as \"optional.\"",
        "is_gre_required": "null. The official Stony Brook University website states, \"The GRE General Test is required by several Graduate School programs. Please refer to the admissions requirement information about your specific program of interest\". This indicates that GRE requirements are determined by individual programs and are not universally required for all programs for international students. For example, for the Spring 2026 and Fall 2026 admission cycles, the GRE is not required for any PhD applicants in Computer Science, but it is required for international MS applicants to that program who do not have a post-secondary degree from the United States or Canada. Conversely, the GRE is waived for the Spring & Fall 2025 admission cycle for the Materials Science and Chemical Engineering department. Because the requirement is not explicitly stated as a uniform mandate for all programs, a definitive 'True' or 'False' answer for the entire university cannot be provided.",
        "is_ielts_required": "True. \n\nEvidence: \nUndergraduate Admissions: https://www.stonybrook.edu/undergraduate-admissions/apply/international/\nGraduate Admissions: https://www.stonybrook.edu/graduate-school/admissions/international.php",
        "is_lsat_required": "null\nEvidence: Stony Brook University does not have a law school. It offers a Pre-Law advising program and a dual-degree MSW/JD program in conjunction with Touro College Jacob D. Fuchsberg Law Center. The LSAT is required for admission to Touro Law Center, as stated on the Stony Brook University website regarding the dual-degree program: \"Applicants to the law school must submit LSAT scores and may apply to the dual-degree program before enrollment or during the first year of enrollment at Touro Law Center.\"\n\nURL: [https://www.stonybrook.edu/msw/msw-jd-dual-degree-social-work-and-law](https://www.stonybrook.edu/msw/msw-jd-dual-degree-social-work-and-law)",
        "is_mat_required": "null\nEvidence: The Stony Brook University Graduate School's website, in its \"Admission to the Graduate School\" and \"Graduate Programs\" sections, details the required application materials, including standardized tests. These pages explicitly mention the GRE, TOEFL, and IELTS exams. However, there is no mention of the Miller Analogies Test (MAT) as a requirement or an accepted alternative for graduate admissions across the university. While some specific programs may have their own unique requirements, the official university website does not explicitly state a university-wide requirement for the MAT.",
        "is_mcat_required": "True\nEvidence: The Admissions Requirements page for the Renaissance School of Medicine at Stony Brook University states, \"The Medical College Admissions Test (MCAT) must be taken within three years of matriculation.\"",
        "is_pte_required": "True\nEvidence:\n- https://www.stonybrook.edu/undergraduate-admissions/international/criteria/",
        "is_sat_required": "null\nEvidence: The information regarding a mandatory SAT requirement is not explicitly stated on the Stony Brook University website (www.stonybrook.edu) based on the conducted searches.",
        "is_toefl_ib_required": "True\nEvidence:\n\nThe Stony Brook University official website explicitly states the requirement for the TOEFL iBT for international applicants to demonstrate English proficiency.\n\nFor undergraduate applicants, the \"International\" section of the admissions website lists the TOEFL iBT as one of the required exams, with a minimum score of 80.\n\nFor graduate applicants, the Graduate School's \"International Students\" page specifies a minimum overall TOEFL iBT score of 80 for master's applicants and 90 for doctoral applicants.",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": 0
    }
}