[
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants for the M.Ed. in Professional Counseling (both Clinical Mental Health Counseling and School Counseling concentrations) must meet the admission requirements of the College of Graduate Studies and additional program requirements. To be considered for admission, applicants must have a bachelor’s degree from an accredited institution and submit a graduate school application, the application fee, and all transcripts. Applicants must submit the following directly to the program: Three letters of recommendation from individuals who can speak to the applicant’s potential for graduate education and work as a professional counselor. A resume. A statement of purpose (no more than three pages, double-spaced) addressing the applicant’s interest in the counseling profession, personal characteristics that will contribute to being an effective counselor, and any relevant experience. Official scores on the Graduate Record Examination (GRE) (verbal, quantitative, and analytical writing). Applicants with at least a 3.00 undergraduate GPA or a master’s degree may request a GRE waiver from the program coordinator.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in School Counseling",
        "Program Page url": "https://edu-leadership.mtsu.edu/professional_counseling-about/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Arts in Liberal Arts (M.A.L.A.) program is determined by the candidate’s overall academic record, letters of recommendation, and a writing sample submitted to the program director. Applicants must have a bachelor’s degree from an accredited institution. For unconditional admission, a student must have a minimum 2.75 undergraduate GPA. Students with a GPA below 2.75 may be admitted conditionally. For admission, a student must also submit to the director of the M.A.L.A. program a writing sample that demonstrates the applicant’s ability to do graduate-level work and arrange to have two letters of recommendation from former professors sent directly to the program director. Applicants must also submit a one-page statement describing their academic interests and reasons for wanting to pursue the M.A.L.A. degree.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in Liberal Arts",
        "Program Page url": "https://mtsu.test-imodules.com/s/601092/17/interior.aspx?sid=601092&gid=1&pgid=1452"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the Master of Business Administration program is based on a combination of GMAT/GRE scores and undergraduate GPA. The minimum requirements are one of the following:\n\n1. GMAT score of 500 or higher (or equivalent GRE score) and a minimum undergraduate GPA of 2.75.\n2. Admission Index of 1050 or higher (Index = GPA X 200 + GMAT).\n\nApplicants may be admitted with deficiencies. See director for details.\n\nA GMAT waiver may be considered for candidates who meet the following criteria:\n\n1. an advanced degree (e.g., master’s or doctoral degree) from a regionally accredited institution, or\n2. five years of significant, progressive, and professional work experience; an undergraduate GPA of 3.0 or higher from a regionally accredited institution; and successful completion of a business statistics course with a grade of C or better from a regionally accredited institution, or\n3. a bachelor’s degree in business from an AACSB-accredited institution with an undergraduate GPA of 3.25 or higher, or\n4. an undergraduate GPA of 3.5 or higher from a regionally accredited institution.\n\nStudents seeking admission to the Concrete Industry Management concentration must present two years of industry work experience.\n\nIn some cases, applicants who do not meet these criteria may be recommended for conditional admission.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration in Concrete Industry Management",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants should apply through the College of Graduate Studies. Additional admission requirements, in addition to the University requirements for graduate school, are as follows:\n1. an undergraduate GPA of 3.0 or higher;\n2. statement of purpose;\n3. three letters of recommendation;\n4. resume; and\n5. interview.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Health Care Informatics",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants should submit the following directly to the College of Graduate Studies:\n1. an application for admission,\n2. official transcripts of all previous college course work,\n3. an official score on the Graduate Record Examination (GRE),\n4. a statement of purpose outlining their career goals and how a master's degree in International Affairs will help attain them,\n5. three letters of recommendation from individuals familiar with the student's academic background and potential for graduate studies,\n6. a resume, and\n7. a writing sample, preferably a research paper written for an upper-division undergraduate course.\n\nIn addition to the above, applicants must have an undergraduate degree from an accredited university or college with a minimum 2.75 GPA. Students who do not have at least 18 hours of undergraduate credit in one of the following areas—political science, history, geography, economics, or world languages—may be required to complete at least 12 hours of leveling course work determined by the graduate coordinator. The College of Graduate Studies requires a minimum GRE score of 146 on the verbal portion, 140 on the quantitative portion, and 3.5 on the analytical writing portion. These minimums are required for unconditional admission to the program. The International Affairs M.A. program requires all three components of the GRE exam (Verbal, Quantitative, and Analytical Writing). Applicants must complete the entire exam. Test scores more than five years old will not be accepted.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in International Affairs",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "All application materials must be submitted to the College of Graduate Studies. Applicants should refer to the graduate catalog for details of the admission process. In addition to the application materials required by the College of Graduate Studies, applicants for the M.A. in International Affairs must also submit the following documents: a statement of purpose outlining interest in the program and career goals (1-2 pages, double-spaced); a resume; three letters of recommendation from individuals familiar with applicant's academic and/or professional abilities; and a writing sample (10 pages maximum) that demonstrates applicant's academic writing and research abilities.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in International Security and Peace",
        "Program Page url": "https://pga.mtsu.edu/maia/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants should have a bachelor's degree from an accredited institution. To be considered for admission, applicants must have an undergraduate grade point average of 3.00 on a 4.00 scale or have received a master's degree. Applicants who do not have a 3.00 GPA must submit a GRE score of 150 verbal and 144 quantitative. In addition, all applicants must submit a 500-word statement of purpose. Three letters of recommendation should be sent directly to the Graduate School. Recommendation forms are available upon request.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in International Development and Globalization",
        "Program Page url": "https://www.mtsu.edu/program/international-affairs-m-a/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": "Admission to the M.S. in Actuarial Science is based on a holistic review of each applicant’s file. The graduate program director will evaluate each applicant’s likelihood of success in the program. Applicants should have a bachelor’s degree from an accredited college or university. Preference will be given to those with a sufficient background in mathematics, statistics, or a related field with a GPA of 3.0 or better.\n\nSuccessful completion of two professional actuarial exams from the Society of Actuaries is expected for admission. Admission may be granted with the completion of only one exam. In this case, the student may be required to successfully complete an approved exam prep course or self-study course and pass the corresponding professional exam as part of their degree program. A student who has not passed any professional actuarial exams may be admitted under certain circumstances but would be required to complete two approved exam prep courses and pass the corresponding exams as part of their degree program. In all cases, two exams must be passed before graduating from the program.\n\nInternational applicants must satisfy the English proficiency requirements.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Actuarial Science",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Doctor of Education (Ed.D.) in Assessment, Learning, and Student Success is selective and based upon a holistic review of all application materials. Applicants seeking admission to the Ed.D. program in Assessment, Learning, and Student Success must submit the following to the College of Graduate Studies:\n\n1. An application for admission.\n2. Official transcripts of all previous college work. Applicants must possess either\n    a master’s degree from an accredited institution with a minimum GPA of 3.25 for all graduate work undertaken or\n    an undergraduate degree from an accredited institution with a minimum GPA of 3.25 and a minimum combined GRE score of 297 (150 verbal and 147 quantitative) or MAT score of 400.\n3. A curriculum vitae or resume.\n4. Three letters of recommendation addressing academic qualifications for doctoral study.\n5. A statement of purpose (1000-1500 words) describing the applicant's research interests, professional goals, and how the program will advance those goals.\n6. A writing sample demonstrating the applicant’s academic writing skills (e.g., master's thesis, course paper, or professional publication).",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Doctor of Education in Assessment, Learning, and Student Success",
        "Program Page url": "https://mtsunews.com/doctoral-education-program-10th-anniversary/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "To apply for the M.A. in Economics program, a prospective student must have the following:\n1. A bachelor's degree from an accredited institution. We welcome applicants with various undergraduate backgrounds.\n2. An official Graduate Record Examination (GRE) score. There is no minimum score requirement; however, a quantitative score of 151 or above is recommended. To request a GRE waiver, please contact the graduate program director. The GMAT will also be accepted.\n3. Two letters of recommendation.\n4. For international students, an official TOEFL or IELTS score is required if the bachelor's degree was not from a US institution.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in Economics",
        "Program Page url": "https://econfin.mtsu.edu/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "In addition to the general requirements for admission to the College of Graduate Studies, applicants must have a bachelor's degree in geosciences or an equivalent degree that includes at least 30 semester hours in the geosciences (geology, geography, environmental science) or related sciences with at least a 2.75 GPA. Applicants with fewer than 30 semester hours of undergraduate coursework in geosciences may be required to complete additional undergraduate coursework, which will not count toward the M.S. degree.\n\nApplicants must also submit to the Department of Geosciences\n\n1. three letters of recommendation;\n2. a statement of purpose (300-500 words) that describes their interests in the geosciences and their professional goals; and\n3. a current resume.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Geosciences",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be considered for admission to the M.A. program, all applicants must submit the following materials: A completed online application form to the College of Graduate Studies; Official transcripts for all previous undergraduate and graduate work; Three letters of recommendation from former professors that speak to your academic potential; A statement of purpose (approximately 500 words) that discusses why you want to pursue a graduate degree in History, what you hope to do with that degree, and in what fields of history you are most interested; A sample of your academic writing (at least five pages), preferably a research paper based on primary sources that you have written for a history course; A resume or curriculum vitae; Official scores for the Graduate Record Exam (GRE), unless you have already earned a graduate degree from an accredited university or college.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in History",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Arts in History program is competitive. Meeting minimum requirements for admission to the College of Graduate Studies does not guarantee admission into the M.A. in History program. Applicants seeking admission to the Master of Arts in History program must submit the following to the College of Graduate Studies: an application for admission; official transcripts of all previous college course work; three letters of recommendation from individuals in a position to evaluate the applicant's potential for graduate work; a statement of purpose (approximately 500 words) indicating why the applicant wants to pursue graduate study in history at MTSU, his/her primary fields of interest, and his/her career goals; a writing sample (10-20 pages), preferably a research paper from an upper-division history course.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Public History",
        "Program Page url": "https://icpn.museum.state.il.us/content/middle-tennessee-state-university"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be considered for admission to the Master of Science in Professional Science (MSPS) program, you must meet the admission requirements for the College of Graduate Studies and be accepted by the MSPS program. MSPS Program Admission Requirements include: An earned baccalaureate degree from an accredited university or college; Official transcripts of all previous college work; An acceptable grade point average (GPA) in the last 60 hours of undergraduate coursework (Unconditional admission requires a 3.0 GPA. Conditional admission requires a 2.75 GPA); Three letters of recommendation; A statement of purpose explaining your career goals and reasons for pursuing the MSPS degree; An up-to-date resume or curriculum vitae; Admission to the College of Graduate Studies; Acceptance by the MSPS Program. Graduate Record Examination (GRE) is not required for MSPS applicants.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Professional Science",
        "Program Page url": "https://msps.mtsu.edu/contact/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Science in Professional Science program requires\n\n1.  an earned bachelor's degree from an accredited university or college;\n2.  an acceptable grade point average in all college-level course work.\n\nApplicants should also submit\n\n1.  an official transcript from each college or university attended;\n2.  three letters of recommendation;\n3.  a resume;\n4.  a statement of purpose.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Professional Science - Actuarial Sciences",
        "Program Page url": "https://academiccatalog.umd.edu/graduate/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission requirements for the Master of Science in Professional Science are the same as those for other master’s programs at MTSU. See Graduate Admissions. GRE scores are not required. Applicants must have an undergraduate major in a science, mathematics, or business field that is deemed appropriate by the M.S.P.S. Graduate Committee. Students with deficiencies may be required to take additional undergraduate coursework. Students select a concentration when they apply for admission. The program can be completed entirely online.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Professional Science - Biotechnology",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "The College of Graduate Studies at MTSU requires that all students submit: An application and a non-refundable application fee. Official transcripts for all colleges and universities attended. The Master of Science in Professional Science also requires that students submit the following additional materials with their applications: Two letters of recommendation. A statement of purpose (approximately 300-500 words). A curriculum vitae (CV) or professional resume. Minimum undergraduate GPA of 3.0. GRE General Test with a minimum Verbal score of 146 and a minimum Quantitative score of 144. In some cases, students may qualify for a GRE waiver.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Professional Science - Engineering Management",
        "Program Page url": "https://msps.mtsu.edu/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Arts degree program in Psychology is granted by the Dean of the College of Graduate Studies upon the recommendation of the department's master's admissions committee. In addition to the university graduate admission requirements, the following departmental requirements must be met: a minimum GPA of 3.00 is generally required for admission to the M.A. programs, and applicants must have completed a minimum of 18 hours of undergraduate psychology coursework, including General Psychology, Statistics, and Research Methods. Applicants seeking admission to the Clinical, Experimental, or I/O Psychology M.A. program must submit the following directly to the Graduate School: Graduate application and application fee, Official transcripts, Three letters of recommendation, Statement of purpose (approximately 500 words), A résumé or curriculum vitae (CV). The GRE is not required for admission.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in Psychology",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": "Required",
        "Requirements": "The Quantitative Psychology concentration will admit students for Fall only. Deadline for applications is January 15. In addition to the admission requirements for the College of Graduate Studies, the M.A. program in Psychology requires an official transcript showing a bachelor’s degree from an accredited college or university with a major in psychology or a minimum of 18 semester hours of psychology course work; an undergraduate GPA of 3.00; Graduate Record Exam (GRE) scores; three letters of recommendation from individuals in a position to make a sound judgment of the applicant’s academic potential; and a one- to two-page statement of purpose.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Psychology - Quantitative",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants for the M.A. in Psychology with a concentration in Industrial/Organizational Psychology should submit the following to the College of Graduate Studies:\n\nAn application for admission.\nOfficial transcripts of all previous college work.\nOfficial scores on the Graduate Record Examination (GRE). A waiver of the GRE requirement is available for select applicants. For more information, please visit the Psychology department’s admissions page.\nThree letters of recommendation from individuals in a position to make an academic appraisal.\nA current resume or vitae.\nA statement of purpose of approximately 500 words describing the applicant’s interest in I/O psychology and career aspirations.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Psychology - Industrial/Organizational",
        "Program Page url": "https://www.mtsu.edu/program/psychology-industrial-organizational-concentration-m-a/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Ph.D. in Public History is competitive. Meeting the minimum requirements does not guarantee admission. Applicants must meet the admission requirements of the College of Graduate Studies. In addition, applicants must hold a Master of Arts degree in history, public history, historic preservation, museum studies, or a closely related discipline from an accredited institution. Applicants must submit official transcripts from all colleges and universities attended. Applicants must have a minimum cumulative grade point average (GPA) of 3.5 on a 4.0 scale on all graduate coursework attempted. In addition to the documents required by the College of Graduate Studies, applicants must submit the following directly to the History Department: three letters of recommendation from individuals able to assess the applicant's academic abilities and potential for success in a doctoral program; a curriculum vitae (CV); a statement of purpose that describes why the applicant is interested in MTSU's doctoral program, future career goals, and the public history fields in which he or she is interested; a writing sample that demonstrates the ability to conduct historical research and analysis.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Doctor of Philosophy in Public History",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants must have a baccalaureate degree from an accredited institution. Applicants must have an undergraduate GPA of 3.0 or higher. Applicants must submit three letters of recommendation. Applicants must submit a statement of purpose detailing their career goals and reasons for pursuing the M.F.A. degree. Applicants must submit a portfolio demonstrating significant creative work. Applicants must submit a résumé detailing their professional and educational experience. Applicants must participate in an interview with the M.F.A. faculty.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Fine Arts in Recording Arts and Technologies",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": "Applicants must meet the admission requirements of the College of Graduate Studies. Applicants must also have a bachelor’s degree from an accredited college or university. In addition, admission will be granted based on one of the following two options:\n\nOption 1: An undergraduate grade point average (GPA) of 3.0 or higher\n\nOption 2: An undergraduate GPA of 2.75 to 2.99 and a satisfactory score on the Miller Analogies Test (MAT) or the Graduate Record Examination (GRE).",
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Aeronautical Science",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Science in Aviation requires:\n1. An undergraduate degree from an accredited institution.\n2. A minimum GPA of 2.75 in the last 60 hours of undergraduate coursework.\n3. A score on the Graduate Record Examination (GRE) general test of at least 143 Verbal, 144 Quantitative, and 3.5 Analytical. NOTE: the GRE requirement is currently waived through Fall 2026.\n4. Two letters of recommendation.\n5. Statement of Purpose outlining the applicant's background and goals for the program.\n6. Curriculum vitae (CV) or resume.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Aviation Education",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Applicants to the Master of Science in Aviation program must satisfy the admission requirements of the College of Graduate Studies as well as the specific program requirements.\n\nAdmission Requirements\n\nApplicants must have a minimum cumulative undergraduate GPA of 2.75 on a 4.0 scale to be unconditionally admitted. In addition, an applicant must satisfy at least one of the following criteria to be unconditionally admitted:\n\n1. A GRE score of at least 146 on the verbal portion, 144 on the quantitative portion, and a 3.5 on the analytical writing portion of the test, OR\n2. A GMAT total score of at least 450, OR\n3. Possess an undergraduate degree from MTSU's Department of Aerospace, OR\n4. Possess a commercial pilot certificate with an instrument rating or an FAA aircraft dispatcher certificate, OR\n5. Have a total of at least three years of professional aviation industry experience.\n\nApplicants not meeting the GPA and the additional requirements for unconditional admission may be conditionally admitted. The conditional student must earn a B (3.0) or better in the first nine (9) semester hours to become a degree-seeking student. In addition, an applicant must satisfy at least one of the following criteria to be conditionally admitted:\n\n1. A GRE score of at least 143 on the verbal portion, 140 on the quantitative portion, and a 3.0 on the analytical writing portion of the test, OR\n2. A GMAT total score of at least 400.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Aviation Management",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": "Applicants must meet the admission requirements of the College of Graduate Studies. Applicants must have an undergraduate degree from an accredited institution. Applicants must have a minimum cumulative undergraduate GPA of 2.75 on a 4.0 scale. Applicants must submit an official score on the Graduate Record Examination (GRE) general test (or an acceptable substitute like the Miller Analogies Test (MAT) or the Graduate Management Admissions Test (GMAT). GRE: 291 (verbal + quantitative); new test format effective August 2011; GRE: verbal, 143; quantitative, 141; MAT: 380; GMAT: 450; The GRE requirement will be waived for applicants with five or more years of relevant, professional aviation experience. The GRE analytical writing is not considered for admission purposes. Applicants must submit official transcripts from all colleges and universities attended. International applicants must demonstrate English proficiency.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Aviation Safety and Security Management",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": "Admission to the M.S. in Horse Science requires a bachelor’s degree from an accredited institution. Applicants must meet the admission standards of the College of Graduate Studies. Applicants who do not hold a bachelor’s degree in an animal or horse science discipline must have completed a minimum of 18 undergraduate hours of coursework in this area. Prerequisite coursework must include introductory animal/horse science, anatomy and physiology, nutrition, and reproduction. Other courses may be required at the discretion of the program graduate coordinator. Applicants who do not meet this standard may be admitted conditionally and will be required to complete these courses prior to full admission.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Horse Science",
        "Program Page url": "https://www.equinescience.org/Resources/Job-Center/Job-Details/jobID/70"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants for the M.S. in Horse Science must submit an application and supporting documents to the College of Graduate Studies. Admission to the M.S. in Horse Science is competitive. Applicants will be judged on the following criteria:\n\nUndergraduate GPA of 3.0 or higher\nGraduate Record Exam (GRE) scores (The GRE is waived for applicants with a 3.25 undergraduate GPA or higher.)\nA 500-word statement of purpose outlining career goals\nThree letters of recommendation\nA résumé",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Horse Science - Industry Management",
        "Program Page url": "https://www.mtsu.edu/program/horse-science-industry-management-concentration-m-s/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants seeking admission to the Professional Counseling Program should follow the admission procedures outlined in the Graduate Catalog. In addition, applicants must:\n\n- submit an online application for admission to the College of Graduate Studies.\n- have an undergraduate grade point average (GPA) of 3.0 on a 4.0 scale.\n- have completed the following prerequisite undergraduate courses: Abnormal Psychology, Theories of Personality, and Developmental Psychology (lifespan).\n- submit a resume.\n- submit a two- to three-page, double-spaced personal statement addressing: (a) reasons for choosing the counseling profession; (b) personal strengths and weaknesses; (c) characteristics that will contribute to being an effective counselor; (d) experiences that have directed them to the counseling profession; and (e) other information the applicant deems relevant to the admission decision.\n- submit a writing sample from one of the prerequisite courses, preferably from Abnormal Psychology or Theories of Personality.\n- submit three letters of recommendation from individuals who can speak to the applicant's academic and professional potential (e.g., professor, work supervisor). At least one letter should be from a professor.\n- participate in a personal interview with the Professional Counseling Program Admissions Committee.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Professional Counseling",
        "Program Page url": "https://edu-leadership.mtsu.edu/professional_counseling-about/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the M.A. program in Clinical Psychology is a two-step process. In order to be considered for regular admission to the M.A. in Clinical Psychology, applicants must first be granted admission to the College of Graduate Studies. Admission to the College of Graduate Studies requires:\n1. An official transcript for the bachelor's degree from an accredited institution.\n2. An undergraduate GPA of at least 2.75 on a 4.0 scale for regular admission and 2.5 for conditional admission.\n\nProgram Specific Admission Requirements\n1. An undergraduate major in psychology OR a minimum of 18 semester hours in psychology, including the following five courses: General Psychology, Statistics, Research Methods, Abnormal Psychology, and Personality Psychology.\n2. An undergraduate GPA of 3.0 on a 4.0 scale.\n3. Three letters of recommendation from individuals in a position to judge the applicant's academic potential. At least two of the three letters must be from faculty members.\n4. A statement of purpose of about 500 words describing the applicant's research interests, career goals, and the reasons for wishing to enter the Clinical Psychology M.A. program at MTSU.\n5. A resume or curriculum vitae.\n\nThe Graduate Record Examination (GRE) is NOT required for admission.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in Psychology (Clinical Psychology)",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the M.A. program in Experimental Psychology is competitive. Applicants are selected on the basis of several factors, including letters of recommendation, statement of purpose, academic background and performance, research experience, and GRE scores. To be considered for admission, applicants must have: an undergraduate degree from an accredited university or college; an undergraduate background which includes at least 15 semester hours in psychology including a course in statistics and a course in research methods/experimental psychology; a minimum overall undergraduate GPA of 3.00. a curriculum vitae or resume; three letters of recommendation from individuals familiar with applicant's academic and/or research potential. Letters should be sent directly by the recommenders. Instructions are provided with the online application. a statement of purpose indicating the applicant's research interests, career goals, and the faculty with whom the student is interested in working. The statement of purpose should not exceed two double-spaced pages. Note: Due to challenges associated with the COVID-19 pandemic, the GRE will not be required for Fall 2024 admissions.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in Psychology (Experimental)",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "In addition to the general requirements of the College of Graduate Studies, specific requirements for admission to the Master of Arts degree program in Psychology are as follows:\n\n*   an undergraduate major in psychology (or 18 semester hours of specified psychology coursework);\n*   a minimum overall undergraduate grade point average of 3.00;\n*   submission of an official score on the Graduate Record Examination (GRE);\n*   three letters of recommendation from individuals in a position to make a professional and academic assessment of the applicant;\n*   a professional goals statement\n\nNOTE: The GRE requirement is currently waived through Fall 2026.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in Psychology (Pre-Specialist in Education - School Psychology Concentration)",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the M.A. in Psychology is competitive and based on a combination of factors, including GPA (overall and in psychology), GRE scores, letters of recommendation, and a personal statement.\n\nAdmission requirements for the College of Graduate Studies are met in addition to the following:\n\n1. An official transcript showing a bachelor's degree from an accredited college or university. Preference is given to applicants with a minimum GPA of 3.00.\n2. Official Graduate Record Examination (GRE) scores. GRE is currently being waived for applicants. Please check back regularly for updates. If an applicant has taken the GRE and would like for their scores to be considered as part of their application, please contact the program coordinator. Preference is given to students with scores above the 50th percentile on the verbal and quantitative sections.\n3. Three letters of recommendation from individuals in a position to evaluate the applicant's potential for success in a graduate program.\n4. A one- to two-page statement of purpose that describes academic and professional goals and how they can be met through our program. For the quantitative psychology concentration, please describe your statistical and programming experience and background in the personal statement.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Arts in Psychology (Quantitative Psychology)",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "In addition to the university’s minimum requirements, applicants for admission to the Master of Accountancy program must meet one of the following criteria:\n\n- An undergraduate degree in accounting from an AACSB-accredited institution with a GPA of 3.000 or greater.\n- An undergraduate degree from an AACSB-accredited business school with a GPA of 3.250 or greater and completion of the six accounting courses from an AACSB school that are prerequisite to the graduate accounting courses at MTSU (see below).\n- An undergraduate degree from a regionally accredited university with a GPA of 3.250 or greater, a GMAT score of 500 or greater, and completion of the six accounting courses from an AACSB school that are prerequisite to the graduate accounting courses at MTSU (see below).\n- Completion of 18 hours of graduate coursework at a regionally accredited university with a GPA of 3.500 or greater and completion of the six accounting courses from an AACSB school that are prerequisite to the graduate accounting courses at MTSU (see below).\n\nThe six prerequisite courses are Intermediate I, Intermediate II, Cost, Tax, Auditing, and Accounting Information Systems. Applicants who do not meet one of the above may be admitted on the basis of a combination of GPA and GMAT score using the formula: (GPA x 200) + GMAT > 1050.\n\nIn order to apply, please submit the following:\n\n- an application with the application fee\n- official transcripts of all previous college work\n- official GMAT scores (if required)",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master in Accounting",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Criminal Justice program is based on a holistic review of each applicant’s file. Admission requires the following: Admission to the College of Graduate Studies; Baccalaureate degree from an accredited university or college with a cumulative minimum GPA of 2.75 on a 4.0 scale; Scores on the Graduate Record Examination (GRE) or the Miller Analogies Test (MAT); Three letters of recommendation from individuals familiar with the applicant’s academic and/or professional capabilities; A letter of intent/purpose that outlines the reasons for applying to the M.C.J. program and how the degree will help achieve the applicant’s personal and professional goals; A current resume.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master in Criminal Justice Administration",
        "Program Page url": "https://www.mtsu.edu/program/criminal-justice-administration-m-c-j/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the Master of Science program in Engineering Management requires:\n\nAn undergraduate degree in engineering, technology, mathematics, physics, or a closely related field from an accredited university or college;\nAn undergraduate grade point average (GPA) of 3.0 or better on a 4.0 scale for unconditional admission. Conditional admission may be considered for applicants with GPAs between 2.75 and 3.0.\nGRE is no longer required for admission.\nFor international applicants who native language is not English, a minimum TOEFL score of 550 (paper based) or 213 (computer based) or 79-80 (Internet based) or a minimum IELTS score of 6.5 or a minimum Duolingo English Test of 110 is required.\nAll students must be admitted to the College of Graduate Studies. International applicants must also be admitted through the Office of International Affairs.\n\nApplication materials should be submitted to the College of Graduate Studies and include: an application form; official transcripts of all college work; and three letters of recommendation.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Engineering Management",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Science in Athletic Training program is a two-step process requiring admission to the College of Graduate Studies and the MS-AT Program. Applications must be submitted through the Athletic Training Centralized Application System (ATCAS). The ATCAS application requires official transcripts, three letters of recommendation, a personal statement, a minimum of 50 hours of clinical observation with a certified athletic trainer (ATC), completion of prerequisite coursework, a minimum 3.0 undergraduate GPA, and a minimum 3.0 prerequisite GPA. GRE scores are not required.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Athletic Training",
        "Program Page url": "https://mtsunews.com/new-master-athletic-training-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the Master of Science degree program in Engineering Technology requires an undergraduate degree in a technical or technology-related discipline from an accredited university or college. A minimum undergraduate GPA of 2.75 on a 4.0 scale is required for unconditional admission. Applicants with a GPA between 2.50 and 2.74 may be conditionally admitted. Conditional status is removed upon satisfactory completion of 9 semester hours of graduate work with a GPA of 3.00 or better. Applicants with an undergraduate degree in a non-technical or technology-related discipline will be required to demonstrate proficiency in at least three of the seven areas of study: algebra, trigonometry, chemistry, physics, statistics, circuit analysis, and statics and/or dynamics. This proficiency may be met by satisfactory completion of an undergraduate course or by a departmental examination. The following materials should also be sent directly to the Graduate Studies Office: one copy of all college transcripts; three letters of recommendation; an official report of the Graduate Record Examination (GRE) scores.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Engineering Technology (Occupational Health and Safety)",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants must meet the admission requirements of the College of Graduate Studies.\n\nApplicants must have a bachelor's degree from an accredited college or university.\n\nMust have a satisfactory score on the Graduate Record Exam (GRE).\n\nA minimum undergraduate GPA of 3.00 is required for unconditional admission.\n\nA Statement of Purpose must be submitted with the application.\n\nThree letters of recommendation must be submitted with the application.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Exercise Science",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be admitted to the Master of Professional Studies program, a student must have an undergraduate degree from an accredited university or college with a minimum 2.75 GPA. Admission is granted by the Dean of the College of Graduate Studies. Applicants are required to submit the following:\n- an application for admission;\n- one official transcript from each college or university attended;\n- a statement of purpose outlining the applicant's goals for graduate study and a professional career.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master in Leadership in Nutrition",
        "Program Page url": "https://www.mtsu.edu/program/professional-studies-leadership-in-nutrition-concentration-m-p-s/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Candidates seeking admission to the Master of Science in Nursing must submit a graduate application.\n\nIn addition to the admission requirements of the College of Graduate Studies, the School of Nursing requires applicants to meet the following criteria to be considered for admission to the Master of Science in Nursing program:\n\n1.  Baccalaureate degree in nursing from a program accredited by the Accreditation Commission for Education in Nursing (ACEN) or the Commission on Collegiate Nursing Education (CCME)\n2.  Current, unencumbered license to practice as a registered nurse in Tennessee or the state in which the student will complete clinical practicum requirements\n3.  A minimum GPA of 3.0 on a 4.0 scale on all undergraduate coursework is required for unconditional admission. Students with GPAs between 2.75 and 2.99 may be considered for conditional admission. The GRE is not required.\n4.  One year of full-time work experience or its equivalent as a registered nurse.\n5.  Submission of the following to the College of Graduate Studies:\n    *   an application for admission\n    *   official transcripts from all colleges/universities attended\n    *   three letters of recommendation (one of which is from the current or most recent employer) addressing the applicant’s potential for success in a graduate program\n    *   current resume\n    *   statement of purpose describing professional goals",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": true,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master in Nursing",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants must have a B.S.N. from a nationally accredited program. Applicants who have completed an Associate Degree in Nursing and a bachelor’s degree in another field may apply for provisional admission and complete a portfolio review.\nApplicants must be eligible for graduate study at MTSU.\nApplicants must submit a College of Graduate Studies application.\nApplicants must have a current, unencumbered Tennessee registered nurse (RN) license or a license from a compact state.\nApplicants must submit evidence of having completed a three-hour undergraduate course in statistics with a C or better.\nApplicants must have a grade point average (GPA) of 3.0 or higher in the last 60 hours of undergraduate coursework.\nApplicants are required to submit an essay that describes professional goals, why they chose the PMHNP specialty, and how they see the PMHNP role evolving.\nApplicants are required to submit a professional résumé.\nApplicants will complete a faculty interview.\nApplicants are required to have one year of experience as an R.N. prior to beginning clinical courses.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master in Nursing, Psychiatric Mental Health Nurse Practitioner",
        "Program Page url": "https://www.mtsu.edu/program/nursing-psychiatric-mental-health-nurse-practitioner-pmhnp-m-s-n/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants seeking admission to the Master of Science in Physician Assistant Studies program must have an earned bachelor’s degree from an accredited institution. Applicants must submit an application through the Centralized Application Service for Physician Assistants (CASPA). Applications will be screened based on the applicant’s academic record and references. Meeting the minimum requirements for admission does not guarantee an interview. Selected applicants will be invited for an interview. Applicants will be evaluated based on their motivation to become a physician assistant, their understanding of the role of a physician assistant, their academic aptitude, their communication and interpersonal skills, and their maturity and stability. Acceptance into the program is provisional and contingent upon a successful background check. Specific admission requirements include:\n\n1. Minimum overall GPA of 3.0.\n2. Minimum science GPA of 3.0.\n3. Completion of all prerequisite courses with a grade of C or better.\n4. Completion of the Graduate Record Examination (GRE) with a recommended score of 150 on both verbal and quantitative sections and a score of 3.5 on the analytical writing section.\n5. Three letters of recommendation.\n6. A minimum of 500 hours of direct patient care experience.\n7. Completion of a successful background check.\n8. Completion of the CASPer exam.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master in Physician Assistant Studies",
        "Program Page url": "https://catalog.mtsu.edu/preview_program.php?catoid=33&poid=11675&returnto=7439"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the Master of Education (M.Ed.) and Education Specialist (Ed.S.) requires a minimum score on the Graduate Record Examination (GRE) or the Miller Analogies Test (MAT) and an undergraduate grade point average of at least 2.75 on a 4.0 scale. To be admitted to the M.Ed. in Curriculum and Instruction program, applicants must have a valid teaching license.\n\nAdmission standards are as follows:\n\nUnconditional admission may be granted to applicants who meet the following:\n- hold a bachelor’s degree from an accredited college or university with a minimum 2.75 GPA;\n- have a valid teaching license; and\n- have an acceptable score on the GRE (800 verbal and quantitative on the old test; 286 on the new test) or the MAT (380).\n\nConditional admission may be granted to applicants who meet the following:\n- hold a bachelor’s degree from an accredited college or university with a minimum 2.50 GPA;\n- have a valid teaching license; and\n- have an acceptable score on the GRE (750 verbal and quantitative on the old test; 281 on the new test) or the MAT (370).",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Curriculum and Instruction",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the M.Ed. in Curriculum and Instruction requires an undergraduate degree with a minimum GPA of 2.75. To apply for admission to the Master of Education program, applicants should submit an application with the appropriate application fee (online at www.mtsu.edu/graduate/apply.php), submit official transcripts of all previous college work, and submit three letters of recommendation.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Digital Teaching and Learning",
        "Program Page url": "https://www.mtsu.edu/program/curriculum-and-instruction-teaching-and-innovation-in-pk-16-concentration-m-ed/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the M.Ed. in Curriculum and Instruction requires\n1. an earned bachelor's degree from an accredited university or college;\n2. an undergraduate GPA of 2.75 or a master's degree.\n\nUnconditional admission requires a minimum 2.75 undergraduate GPA.\nApplicants who have a master's degree are not required to meet the 2.75 GPA.\n\nThe GRE is not required for admission to this program.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Elementary School Education",
        "Program Page url": "https://www.mtsu.edu/program/curriculum-and-instruction-elementary-education-concentration-m-ed/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the Master of Education in Higher Education requires an earned bachelor’s degree from an accredited university or college; an undergraduate GPA of 2.75 or a 3.0 on the last 60 hours of undergraduate work; and submission of an acceptable writing sample (prompt can be obtained from the program coordinator); OR submission of an official report of the Graduate Record Examination (GRE) score. The GRE is waived with a 3.0 undergraduate GPA.",
        "WritingSample": "Optional",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Higher Education",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the Master of Education (M.Ed.) program in Literacy requires\n\n1. an earned bachelor’s degree from an accredited university or college;\n2. an undergraduate GPA of 2.75 or a master’s degree;\n3. successful completion of an interview with program faculty.\n\nCandidates for whom English is a second language must have a minimum TOEFL score of 550 (paper-based) or 213 (computer-based) or 79 (Internet-based) or a minimum IELTS score of 6.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Literacy",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": "To be admitted to the Master of Education in Special Education program, applicants should have one of the following:\n\n*   a valid teaching license or\n*   an undergraduate GPA of 2.75 or higher on a 4.0 scale.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Special Education",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be admitted to the Master of Professional Studies (M.P.S.) program, applicants should have a bachelor's degree from an accredited college or university with a minimum 2.75 GPA. Applicants who do not meet this GPA requirement may be considered for conditional admission. The GRE is not required for admission. For more information, contact the program coordinator. In addition to the application for admission to the College of Graduate Studies, students must submit a statement of purpose and a resume.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Professional Studies",
        "Program Page url": "https://www.mtsu.edu/program/professional-studies-training-and-development-concentration-m-p-s/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Professional Studies (M.P.S.) program requires an earned bachelor's degree from an accredited university or college; and an undergraduate grade point average (GPA) of 2.75 on a 4.0 scale for regular admission or a 2.50 for conditional admission. Applicants must also submit a statement of purpose and a professional résumé to the College of Graduate Studies.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Master of Professional Studies - Leadership in Nutrition",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to this program is competitive. Applicants should hold a bachelor's degree from an accredited institution. In addition, prospective students must meet the following requirements: submission of an official transcript showing a minimum GPA of 2.75 for the last 60 hours of undergraduate coursework; submission of an acceptable score on either the GRE (verbal and quantitative sections) or MAT. International students must also submit TOEFL scores.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Education in Administration and Supervision, Higher Education Specialization",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Applicants must meet the following requirements for admission to the M.S.W. program.\nSubmit a graduate application with the application fee.\nSubmit official transcripts from all colleges and universities attended to the College of Graduate Studies.\nHave a minimum cumulative grade point average (GPA) of 2.75 on a 4.0 scale or a 3.0 in the last 60 hours of undergraduate coursework.\nSubmit three letters of recommendation (at least one academic and one work/volunteer related).\nSubmit a professional résumé.\nSubmit a personal statement that addresses all of the prompts identified on the department website.\nComplete an interview with a Social Work faculty member.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Social Work",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the Master of Science in Mathematics program requires\n\n1.  an undergraduate degree from an accredited university or college;\n2.  a grade point average of 2.75 or better on a 4.0 scale;\n3.  satisfactory scores on the Graduate Record Examination (GRE). A waiver of the GRE may be obtained with prior approval from the graduate advisor and the department chair if the student has a bachelor's degree from MTSU with a major in mathematics, an overall GPA of 3.0, and a GPA of 3.25 in all upper division mathematics coursework or if the student holds a master's or higher degree.\n4.  three letters of recommendation addressing the applicant's potential for success in a graduate mathematics program.\n\nIn addition, students must have completed coursework equivalent to the MTSU major in Mathematics, which includes three semesters of calculus, a course in differential equations, a course in linear algebra, and at least six hours of upper-division mathematics courses. Students with an undergraduate major in an area other than mathematics are encouraged to apply but may be required to complete some undergraduate mathematics courses before being granted regular admission.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Science in Mathematics",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the M.S. in Mathematics program is determined by the mathematics graduate faculty and based on the applicant’s potential for success in the program. To be considered for admission, applicants must satisfy the minimum requirements of the College of Graduate Studies as well as the following departmental requirements:\n\nAn undergraduate major in mathematics or its equivalent from an accredited institution with a grade point average of at least 2.75 on a 4.0 scale.\nA combined score of at least 291 (verbal plus quantitative) on the Graduate Record Examination (GRE) with a quantitative score of at least 146.\nThree letters of recommendation from former professors that address the applicant’s potential for successfully completing a graduate program in mathematics.\nA one-page statement of purpose explaining the applicant's background and motivation for pursuing a graduate degree in mathematics.\n\nStudents who do not satisfy all the above requirements may be admitted with conditional status.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Mathematics - Pure and Applied Mathematics",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be considered for unconditional admission, an applicant must have a Master’s degree in a STEM field from an accredited institution. Applicants must also have a cumulative graduate GPA of at least 3.00 on a 4.00 scale. Application materials include: a completed online application, official transcripts from all previously attended colleges and universities, a current curriculum vitae (CV), a Statement of Purpose, and three letters of recommendation. The GRE is not required.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": true,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Doctor of Philosophy in Computational and Data Science",
        "Program Page url": "https://www.mtsu.edu/wp-content/uploads/2023/10/PHD-program-overview-v1.5.docx"
    },
    {
        "Resume": "Not Required",
        "StatementOfPurpose": "Required",
        "Requirements": "In order to be considered for unconditional admission, applicants must have: 1. Submit a graduate application with the application fee. 2. Submit official transcripts from all colleges and universities previously attended. 3. Possess a master’s degree from an accredited institution. 4. Have a minimum graduate grade point average (GPA) of 3.25 on a 4.0 scale. 5. Complete Graduate Record Examination (GRE) (all three parts) with preferred minimum scores of 146 on the Verbal section, 151 on the Quantitative section, and a 4.0 on the Analytical Writing section. GRE scores must be within five years of the date of application. 6. Submit two letters of recommendation. 7. Submit an acceptable scholarly writing sample which demonstrates appropriate writing proficiency, analytical skills, and potential for doctoral-level research and scholarship. 8. Submit a Statement of Purpose indicating research interests and goals.",
        "WritingSample": "Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": null,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Doctor of Philosophy in Mathematics and Science Education",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": null,
        "StatementOfPurpose": null,
        "Requirements": null,
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in Mathematics - Actuarial and Financial Mathematics",
        "Program Page url": "https://asrm.illinois.edu/admissions/graduate-degrees"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the M.B.A. program is granted to those who show high promise of success in a graduate business program. Each applicant is judged on the basis of their GMAT or GRE score, undergraduate record, and personal achievements. Admission decisions are based on the total profile. Applicants for the M.B.A. program must hold a bachelor’s degree from an accredited college or university. All applicants must submit scores from the Graduate Management Admission Test (GMAT) or Graduate Record Examination (GRE). A waiver of the GMAT/GRE requirement is available for qualified applicants. The GMAT/GRE may be waived for admission under any one of the following criteria:\n\n- An undergraduate GPA of 3.25 or higher from an AACSB-accredited business school.\n- An undergraduate GPA of 3.5 or higher from a regionally accredited institution.\n- A terminal degree (e.g., Ph.D., M.D., Ed.D., J.D., D.D.S., D.V.M.).\n- A master’s or other graduate degree with a GPA of 3.25 or higher.\n- A CPA or other professional certification with a passing score.\n- Substantial and significant managerial work experience (typically five or more years of progressively responsible experience).\n- Successful completion of at least 9 hours of graduate coursework from a regionally accredited college or university with a GPA of 3.5 or higher.\n\nInternational applicants must submit a minimum TOEFL score of 550 (paper-based), 213 (computer-based), or 79-80 (Internet-based) or a minimum IELTS score of 6.5. A waiver of the English proficiency test requirement can be obtained by meeting one of the waiver conditions listed in the graduate catalog. Additional admission requirements of the College of Graduate Studies must be met. See graduate catalog for additional details.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Master of Business Administration",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Business Administration (MBA) program is competitive. Applicants are evaluated on a number of factors, including academic background (GPA) and Graduate Management Admission Test (GMAT) or Graduate Record Examination (GRE) scores. To be considered for admission, applicants should meet the criteria for regular or conditional admission. Regular Admission: GPA of 3.00 or higher and a GMAT score of 500 or higher (or equivalent GRE score). Conditional Admission: GPA of 2.75 to 2.99 and a GMAT score of 450-499 (or equivalent GRE score). A GMAT/GRE Waiver Request is available for applicants with a 3.50+ GPA or 5+ years of relevant professional/managerial experience.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Marketing",
        "Program Page url": "https://marketing.mtsu.edu/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Not Required",
        "Requirements": "Admission to the M.B.A. program at MTSU is competitive. To be considered for admission, applicants must meet the admission requirements of the College of Graduate Studies and additional requirements of the M.B.A. program. The MBA Admissions Committee considers each applicant’s potential for success in the M.B.A. program by reviewing undergraduate academic performance, GMAT or GRE scores (if required), and work experience. Requirements include: an earned bachelor’s degree from an accredited university or college; an acceptable score on the Graduate Management Admission Test (GMAT) or the Graduate Record Examination (GRE). Applicants with an undergraduate GPA of 3.00 or above from an AACSB-accredited business school may request a GMAT/GRE waiver if they have at least two years of professional work experience. Also, those with an advanced degree (e.g., master’s or doctoral degree) may request a waiver. Applicants should also submit a current resume that shows evidence of at least two years of full-time work experience.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Healthcare Management",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": null,
        "Requirements": "To be considered for admission to the MBA program, applicants must submit the following:\n\nAn online application with a nonrefundable application fee\nOfficial transcripts from all previously attended colleges and universities\nA current résumé detailing work experience\nGMAT/GRE scores (if applicable). See GMAT/GRE Waiver Policy below.\n\nThe GMAT/GRE is automatically waived if the applicant meets any of the following criteria:\n\nHolds a terminal degree (e.g., Ph.D., M.D., Ed.D., J.D.)\nOR\nHolds a master's degree\nOR\nHas an undergraduate GPA of 3.0 or higher from a regionally accredited institution\nOR\nHas a minimum of 5 years of professional work experience",
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": true,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Strategic Marketing Analytics",
        "Program Page url": "https://mba.mtsu.edu/curriculum/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "To be considered for admission, applicants must meet the admission requirements of the College of Graduate Studies as well as the following M.B.A. program requirements:\n\n1. A bachelor's degree from an accredited university or college.\n2. Submission of an official GMAT or GRE score. The test requirement is waived if an applicant meets one of the following criteria:\n    * An advanced degree (e.g., master's or doctoral) from an accredited institution\n    * An undergraduate degree from an AACSB-accredited business school with a cumulative GPA of 3.25 or higher\n    * Five years of professional/managerial work experience and an undergraduate cumulative GPA of 3.0 or higher\n    * Membership in Beta Gamma Sigma\n    * An undergraduate degree from MTSU with a cumulative GPA of 3.5 or higher\n3. Submission of a current resume.\n4. Submission of a statement of purpose (approximately 300 to 500 words) that outlines the applicant's reasons for pursuing the M.B.A., career goals, and any additional information that may be useful to the admissions committee.\n5. International students must also meet the English proficiency requirements of the College of Graduate Studies.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Legal and Ethical Governance",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Business Administration program is based on a combination of GMAT or GRE score and undergraduate GPA. Applicants should also submit a resume and statement of purpose. Applicants must have earned a four-year baccalaureate degree from an accredited university or college.\n\nAdmission standards are based on one of the following:\n\n*   an admission index of 1050 (GPA x 200 + GMAT) or 1100 ([2.75 minimum] GPA x 200 + GMAT)\n*   an admission index based on GRE scores that is comparable to the GMAT-based index\n\nThe GMAT/GRE will be waived for any applicant who has a 3.0 or higher undergraduate GPA from a regionally accredited institution OR who has an undergraduate degree from an AACSB-accredited business school. Applicants with five or more years of professional or military experience and a 2.75 or higher undergraduate GPA can request a GMAT/GRE waiver by completing the waiver request form.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Risk Management",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "MTSU offers two options for admission to the MBA program.\n\nOption 1: GMAT or GRE Score Submission\n\nApplicants should meet the following minimum requirements:\n- A bachelor’s degree from a college or university accredited by the appropriate regional accrediting agency.\n- A minimum of 2.75 undergraduate GPA on a 4.0 scale.\n- Submission of GMAT or GRE scores.\n- A score of at least 1000, based on the formula: 200 times the undergraduate GPA plus the total GMAT score (or GRE equivalent).\n- A score of at least 450 on the GMAT (or GRE equivalent).\n\nOption 2: GMAT or GRE Waiver\n\nApplicants must have a bachelor’s degree from a college or university accredited by the appropriate regional accrediting agency AND meet at least ONE of the following criteria:\n- A minimum of 3.25 undergraduate GPA on a 4.0 scale, OR\n- An earned graduate degree (master’s, doctoral, or professional) from an accredited institution, OR\n- Five years of progressive, professional, full-time work experience.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Human Resource Management",
        "Program Page url": "https://mba.mtsu.edu/curriculum/concentrations/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "The College of Graduate Studies requirements for full admission include submission of an application to the College of Graduate Studies, an official transcript from each college or university attended, and an official score on the Graduate Management Admission Test (GMAT) or the Graduate Record Examination (GRE) general test. The minimum GMAT score accepted is 500 (with minimums of 25 on verbal and 28 on quantitative). A total GRE score of 1050 (302 on the revised scale with minimums of 150 on verbal and 152 on quantitative) is acceptable. Test scores submitted must not be more than five years old. In addition to the College of Graduate Studies requirements, applicants to the MBA program must submit the following directly to the MBA office: a current resume and a 150-word statement of purpose.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Data Analytics",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": null,
        "Requirements": "In addition to the admission requirements of the College of Graduate Studies, applicants must have:\n\n* a bachelor's degree from an accredited university or college;\n* an undergraduate GPA of 2.75 for admission.\n    * Applicants with an undergraduate GPA below 2.75 but no lower than 2.25 may be considered for conditional admission. Please contact the MBA office for details.\n\nApplicants must submit a current resume and official scores from the Graduate Management Admission Test (GMAT) or the Graduate Record Examination (GRE). See waiver policy below.",
        "WritingSample": null,
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - IT Project Management",
        "Program Page url": "https://www.mtsu.edu/search-program/"
    },
    {
        "Resume": "Required",
        "StatementOfPurpose": "Required",
        "Requirements": "Admission to the Master of Business Administration program is based upon the applicant’s potential to complete the program successfully. Each applicant is evaluated on a combination of factors including prior academic performance, test scores, work and/or leadership experience, and motivation to complete a rigorous graduate business program. Applicants who have a 3.00 undergraduate GPA from a regionally accredited institution are exempt from the GMAT/GRE requirement. Applicants who have a cumulative undergraduate GPA between 2.75 and 2.99 can be considered for admission to the MBA program if their GMAT score is at least 500 or their equivalent GRE score (calculated from the GRE Comparison Tool for Business Schools) plus their undergraduate GPA multiplied by 200 equals at least 1,100 ([GPA x 200] + GMAT/GRE equivalent ≥ 1,100). Applicants who have a cumulative undergraduate GPA lower than 2.75 can be considered for admission if their GMAT score is at least 500 or their equivalent GRE score (calculated from the GRE Comparison Tool for Business Schools) plus their undergraduate GPA multiplied by 200 equals at least 1,150 ([GPA x 200] + GMAT/GRE equivalent ≥ 1,150). The College of Graduate Studies requires a minimum GMAT score of 450 (or GRE equivalent) for all MBA applicants.",
        "WritingSample": "Not Required",
        "IsAnalyticalNotRequired": false,
        "IsAnalyticalOptional": false,
        "IsRecommendationSystemOpted": false,
        "IsStemProgram": false,
        "IsACTRequired": false,
        "IsSATRequired": false,
        "MinimumACTScore": null,
        "MinimumSATScore": null,
        "extraction_level": "program",
        "Program name": "Concentration in MBA - Music Business",
        "Program Page url": "https://catalog.mtsu.edu/preview_program.php?catoid=33&poid=11571&returnto=7440"
    }
]