[
    {
        "Concentration name": [
            "General",
            "Taxation Track"
        ],
        "description": "The Baylor Master of Accountancy (MAcc) program provides a firm foundation for a career in public accounting and industry. Within 10 months, students can complete the 33 required semester hours and gain the skills necessary to excel in the competitive business world. Our students enjoy excellent job placement and high pass rates on the CPA exam. Students can choose a general MAcc degree or a taxation track. The Baylor MAcc is designed for students with an undergraduate degree in accounting from an accredited U.S. institution. Students without an undergraduate degree in accounting should consider the Master of Taxation (MTax) program.",
        "program website url": "https://www.baylor.edu/business/macc/",
        "Accreditation status": "The Accounting and Business Law department holds a separate AACSB accreditation, an honor held by less than 2 percent of business schools worldwide.",
        "Level": "Master's",
        "Program name": "Master of Accountancy",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Adult-Gerontology Acute Care Nurse Practitioner",
        "description": "The Baylor University Louise Herrington School of Nursing Doctor of Nursing Practice (DNP) program for Adult-Gerontology Acute Care Nurse Practitioner (AGACNP) is a 75-credit hour program offered in a hybrid format, combining online and in-person learning. This program is tailored for nurses who hold a Bachelor of Science in Nursing (BSN) degree and are looking to advance their careers to the highest level of clinical practice. The curriculum is designed to equip students with advanced skills in assessing and managing the health of acutely ill adult and older adult patients, preparing them for leadership roles in various healthcare settings. Graduates of the AGACNP track are eligible to sit for the national certification exam through the American Nurses Credentialing Center (ANCC) or the American Association of Critical-Care Nurses (AACN), qualifying them to practice as certified Adult-Gerontology Acute Care Nurse Practitioners.",
        "program website url": "https://www.baylor.edu/nursing/index.php?id=973145",
        "Accreditation status": "The Doctor of Nursing Practice degree program at Baylor University Louise Herrington School of Nursing is accredited by the Commission on Collegiate Nursing Education, 655 K Street, NW, Suite 750, Washington, DC 20001, 202-887-6791.",
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice in Adult-Gerontology Acute Care Nurse Practitioner",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts degree in American Studies is an interdisciplinary program that draws its faculty and curriculum from departments throughout the humanities and social sciences. The program emphasizes a foundation in traditional and contemporary American culture and a flexibility that encourages students to follow individual interests. Both a thesis and a non-thesis option are available. American Studies offers a joint degree program with the School of Law. Contact the departmental Graduate Program Director for more information about the J.D./M.A. in American Studies.",
        "program website url": "https://www.baylor.edu/americanstudies",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in American Studies",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/american-studies/american-studies.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Doctor of Nursing Practice (DNP) Program is a cooperative program between the U.S. Army Medical Center of Excellence (MEDCoE) at Fort Sam Houston, Texas and the Baylor University Louise Herringer School of Nursing. The program is designed to produce independent and competent anesthetists who are able to serve in all branches of the uniformed services. The program consists of a rigorous curriculum divided into two phases. The first phase consists of didactic instruction for 12 months at the MEDCoE, Fort Sam Houston, Texas. The MEDCoE offers an excellent learning environment with an experienced faculty and state-of-the-art simulation center for hands-on crisis management training. The curriculum emphasizes basic sciences in the first semester, including anatomy, physiology, pathophysiology, pharmacology, chemistry, and physics. The second semester focuses on advanced anesthesia principles. Upon completion of the didactic phase, students progress to the second phase of the program, the clinical residency. The clinical residency is a minimum of 24 months in length. The residency consists of supervised patient care in a variety of clinical settings where students are exposed to a wide spectrum of patient acuity and subspecialty anesthesia practice. Students are assigned to a military medical center and a variety of civilian hospitals for their clinical training. All students will perform a clinical rotation in a combat support hospital as part of their training.",
        "program website url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/nursing-anesthesia/anesthesia-nursing-dnp-bsn-dnp-program/",
        "Accreditation status": "The program is accredited by the Council on Accreditation of Nurse Anesthesia Educational Programs (COA).",
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice in Anesthesia Nursing (Army-Baylor)",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/nursing-anesthesia/anesthesia-nursing-dnp-bsn-dnp-program/"
    },
    {
        "Concentration name": null,
        "description": "The Department of Anthropology offers graduate coursework leading to a PhD in Anthropology. Our program specializes in the archaeology of complex societies and we encourage cross-disciplinary research that bridges the sciences and the humanities. We currently conduct research in Mesoamerica, the Near East, North America, and South America on a variety of topics and theoretical problems relevant to complex societies. The department encourages students to develop a course of study that takes advantage of our faculty’s strengths and the diverse resources available through other Baylor departments and programs, such as the Baylor Archaeometry Laboratory, Environmental Science, Geosciences, History, Museum Studies, and Religion. Our graduate students are also encouraged to participate in a variety of departmental research projects. As a department, we believe that field and laboratory experience are essential for our graduate students’ training. We endeavor to provide our students with opportunities to gain research experience in the field and in the laboratory in order to promote their individual research interests and future employment.",
        "program website url": "https://graduate.baylor.edu/study/anthropology-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Anthropology",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Athletic Training (MAT) is a full-time, two-year (six-semester) program that prepares students to become highly skilled and competent healthcare professionals. The program’s challenging curriculum will focus on critical-thinking, evidence-based practice, and advanced clinical-skills. The MAT is a cohort model, where a new group of students begins each summer. The program requires 62-hours of graduate-level coursework, which is uniquely divided between didactic, laboratory, and clinical education experiences. The program utilizes a variety of clinical experiences, including on-campus athletic teams, as well as local high schools and healthcare facilities. Students are also required to complete an immersive clinical experience during their second year, which can take place anywhere in the United States.",
        "program website url": "https://robbins.baylor.edu/academics/departments/health-human-performance-recreation/master-athletic-training",
        "Accreditation status": "Baylor University’s Master of Athletic Training Program is accredited by the Commission on Accreditation of Athletic Training Education (CAATE), 6850 Austin Center Blvd., Suite 100, Austin, TX 78731-3101.",
        "Level": "Master's",
        "Program name": "Master of Athletic Training",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "PhD in Biology",
        "Program Page url": "https://science.indianapolis.iu.edu/academics/degrees-and-programs/_degrees/biology-phd-iupui-biophd.html"
    },
    {
        "Concentration name": null,
        "description": "The Department of Biology offers a Master of Science (M.S.) degree program that provides students with a broad background in biology while allowing for specialization in areas such as ecology, evolution, organismal biology, and cell and molecular biology. The M.S. degree program prepares students for various careers in research, education, and industry, or for further graduate studies in a Ph.D. program. The research-based M.S. program is the terminal degree for some students, while it provides a stepping stone to a Ph.D. program for others. Coursework and research leading to the M.S. degree are offered in a broad range of biological disciplines.",
        "program website url": "https://graduate.baylor.edu/study/biology-ms",
        "Accreditation status": null,
        "Program name": "Master of Science in Biology",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Health Professions",
        "description": "The Master of Arts degree in Biology is a non-thesis program that offers a specialization in health professions. Its goal is to provide students with a strong background in the biological sciences in preparation for admission to a professional school (medical, dental, etc). This program is designed to strengthen an applicant's credentials for professional school by improving his/her GPA, providing an opportunity for a robust standardized test (MCAT/DAT) preparatory course, and reinforcing a strong academic background. To this end, students will take courses offered at the Baylor College of Medicine on the Baylor University campus and/or graduate-level science courses offered on the Baylor University campus. Most of our students will also be enrolled in a robust MCAT/DAT preparatory course in the spring.",
        "program website url": "https://graduate.baylor.edu/program/biology-ma-health-professions-track",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Biology – Health Professions",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Biomedical Engineering (MSBE) is intended for students with a bachelor’s degree in engineering or related field. Students can obtain either a thesis-based or non-thesis MSBE, both of which prepare them for careers in industry or for advanced studies in a doctoral program. The MSBE is a joint program between the School of Engineering & Computer Science and Baylor’s Graduate School. The program requires 30 semester hours of graduate-level course work. Students must successfully complete BME 5310, 5320, 5330, and 5340. Additional courses required depend on the student’s interests and degree track (thesis or non-thesis).",
        "program website url": "https://www.ecs.baylor.edu/students-academics/degree-programs/graduate/msbe",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Biomedical Engineering",
        "Program Page url": "https://www.ecs.baylor.edu/students-academics/degree-programs/graduate/msbe"
    },
    {
        "Concentration name": null,
        "description": "The Baylor Master of Science in Business Analytics (MSBA) is an innovative, 10-month program designed to build upon your undergraduate degree with in-depth knowledge of business analytics and data-driven strategy. The MSBA develops leaders who can leverage data to solve business problems and gain a competitive advantage. You will learn the tools and techniques to analyze data, build predictive models and communicate insights effectively. You will also have the opportunity to apply your knowledge and skills through real-world practicum experiences.",
        "program website url": "https://www.baylor.edu/business/ms-business-analytics/",
        "Accreditation status": "The Hankamer School of Business is accredited by AACSB International.",
        "Level": "Masters",
        "Program name": "Master of Science in Business Analytics",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The doctoral degree in chemistry and biochemistry at Baylor University is a research-intensive program that prepares students for a wide range of careers in industry, government, and academia. Graduate students at Baylor are able to choose a research director from any of our internationally-recognized faculty who are pursuing cutting-edge research in analytical, physical, inorganic, organic, and theoretical chemistry, as well as biochemistry. Baylor graduate students enjoy small research group sizes that foster close student-mentor relationships. They also have full access to a wide-range of state-of-the-art instrumentation and facilities. A Ph.D. degree in chemistry or biochemistry from Baylor University provides students with the critical-thinking skills and the practical experience to be innovators and to solve challenging problems in the ever-changing technical landscape.",
        "program website url": "https://chemistry.artsandsciences.baylor.edu/graduate/phd-degree",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Chemistry & Biochemistry",
        "Program Page url": "https://chemistry.artsandsciences.baylor.edu/graduate/phd-degree"
    },
    {
        "Concentration name": "organ, choral conducting, collaborative piano, and worship leadership",
        "description": "The Master of Music in Church Music is a professional graduate degree which aims to equip students with the practical skills and the scholarly acumen necessary for a vital and effective music and worship ministry. It is a sixty-one hour program with several areas of concentration: organ, choral conducting, collaborative piano, and worship leadership. It is designed to be completed in two years of full-time study.",
        "program website url": "https://www.baylor.edu/music/index.php?id=977699",
        "Accreditation status": "The Baylor University School of Music is accredited by the National Association of Schools of Music (NASM).",
        "Level": "Master's",
        "Program name": "Master of Music in Church Music",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Music Ministry, Worship, Hymnology",
        "description": "The Doctor of Musical Arts in Church Music is the School of Music’s most advanced professional degree. It is designed to prepare its recipient for a career that combines the highest level of artistic and practical accomplishment with significant scholarly achievement. The program is specifically intended to prepare students for careers as directors of music in churches, teachers of church music in colleges, universities, and seminaries, and denominational leaders in church music. This degree requires 46 semester hours of graduate study beyond a master’s degree in church music. The program of study includes a core of coursework in hymnology, worship, philosophy, and administration of church music. Students must also complete at least two of three available concentrations. A professional dissertation is the capstone experience.",
        "program website url": "https://www.baylor.edu/music/index.php?id=973909",
        "Accreditation status": "The Baylor University School of Music is a member of the National Association of Schools of Music.",
        "Level": "Doctoral",
        "Program name": "Doctor of Musical Arts in Church Music",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Ethnomusicology, Musicology, Worship Studies",
        "description": "The Doctor of Philosophy degree in Church Music is offered for the purpose of training scholars for teaching careers at the college, university, or seminary level. The degree requires broad and comprehensive knowledge of church music, a specific area of specialization for research, and a command of research skills and methods. All students must develop a general knowledge of Christian worship, theology, music history, music theory, and performance. Each student will also select a major area for research from one of three areas of study: ethnomusicology, musicology, or worship studies. Those selecting ethnomusicology or musicology will further specify a research focus.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-music/doctoral-degrees-church-music/church-music-phd/",
        "Accreditation status": "The Baylor University School of Music is a member of the National Association of Schools of Music.",
        "Level": "PhD",
        "Program name": "PhD in Church Music",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-music/doctoral-degrees-church-music/church-music-phd/"
    },
    {
        "Concentration name": null,
        "description": "Baylor’s Doctor of Psychology (Psy.D.) degree in clinical psychology is a 5-year, full-time program of study that includes 4 years of coursework and a 1-year pre-doctoral internship. The primary goal of our program is to train students as health service psychologists to provide evidence-based psychological services to a diverse public. A secondary goal is to train students to be consumers and evaluators of research, and to a lesser extent, producers of applied clinical research. The Psy.D. program is built upon the practitioner-scholar model of training for the professional practice of psychology. The program values and respects the empirical basis of scientific psychology as the foundation for the practice of clinical psychology.",
        "program website url": "https://www.baylor.edu/psychologyneuroscience/index.php?id=975618",
        "Accreditation status": "Baylor University’s Psy.D. Program in Clinical Psychology is accredited by the American Psychological Association (APA). Questions related to the program’s accredited status should be directed to the Commission on Accreditation: Office of Program Consultation and Accreditation American Psychological Association 750 1st Street, NE, Washington, DC 20002 Phone: (202) 336-5979 / E-mail: apaaccred@apa.org Web: www.apa.org/ed/accreditation",
        "Level": "Doctoral",
        "Program name": "Doctor of Psychology in Clinical Psychology",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Collaborative Piano",
        "description": "The Master of Music degree in collaborative piano offers an intensive course of study for pianists who wish to pursue a career working with singers and instrumentalists. Students receive weekly coachings on vocal and instrumental repertoire, lyric diction, and piano ensemble playing. Ample performance opportunities include degree recitals, studio recitals, master classes, opera and choral productions, and other venues. Students have the opportunity to study with internationally acclaimed faculty.",
        "program website url": "https://www.baylor.edu/music/index.php?id=973273",
        "Accreditation status": "The Baylor University School of Music is a member of the National Association of Schools of Music (NASM).",
        "Level": "Masters",
        "Program name": "Master of Music in Collaborative Piano",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": [
            "Rhetoric",
            "Interpersonal Communication"
        ],
        "description": "The M.A. program in Communication is an advanced, comprehensive course of study focused on the theories, methods, and applications of human communication. The degree offers students the chance to prepare for a variety of communication-related careers, or it can be a pathway to doctoral studies. The program offers tracks in rhetoric and interpersonal communication. M.A. students are admitted into a particular track but are encouraged to take classes across both areas of study. Each area has a specific focus for study, which shapes the student’s coursework and overall graduate school experience.",
        "program website url": "https://graduate.baylor.edu/communication",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Communication",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science (M.S.) degree program in Communication Sciences and Disorders at Baylor University is a two-year, nationally-ranked graduate program that provides academic and clinical education to prepare students for professional careers as speech-language pathologists. Students will learn the principles and methods of prevention, assessment, and intervention for people with a wide variety of communication and swallowing disorders. The M.S. program is designed to help students meet the academic and clinical requirements for the Certificate of Clinical Competence in Speech-Language Pathology (CCC-SLP) from the American Speech-Language-Hearing Association (ASHA) and for a Texas license in speech-language pathology.",
        "program website url": "https://www.baylor.edu/csd/index.php?id=975618",
        "Accreditation status": "The Master of Science (M.S.) education program in speech-language pathology at Baylor University is accredited by the Council on Academic Accreditation in Audiology and Speech-Language Pathology of the American Speech-Language-Hearing Association, 2200 Research Boulevard, #310, Rockville, MD 20850, 800-498-2071 or 301-296-5700.",
        "Level": "MS",
        "Program name": "Master of Science in Communication Sciences & Disorders",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The primary objective of the PhD program is to prepare students to become independent scholars and researchers who, through their own research contributions, can advance the knowledge base in the discipline of human communication sciences and disorders. Students develop expertise in a specific area of study and acquire the skills necessary to conduct research, as well as become effective teachers at the university level. We have faculty with expertise in audiology, speech-language pathology, and hearing science. Our program offers an interdisciplinary approach to research which encourages students to develop a course of study that addresses research questions from multiple perspectives. To this end, students are encouraged to select mentors and committee members from both inside and outside the department, and to engage in research both in and outside of our department laboratories. The doctoral program prepares individuals for a variety of career opportunities, including academic and research careers in university settings, research and leadership positions in clinical settings such as hospitals and schools, and positions in government and industry.",
        "program website url": "https://graduate.baylor.edu/communication-sciences-disorders/phd-communication-sciences-disorders",
        "Accreditation status": null,
        "Program name": "PhD in Communication Sciences & Disorders",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "Baylor University’s online Master of Science in Communication Sciences and Disorders program prepares aspiring speech-language pathologists (SLPs) to work in a variety of professional settings, including schools, hospitals, and clinics. Delivered through the Department of Communication Sciences and Disorders, the Speech@Baylor program provides students with a strong academic and clinical foundation to prevent, assess, diagnose, and treat speech, language, social communication, cognitive communication, and swallowing disorders in children and adults. The program emphasizes evidence-based practice and compassionate, patient-centered care. Throughout the curriculum, students will integrate research, theory, and clinical practice to provide ethical and effective care to diverse populations. Our faculty are experts in the field who will serve as mentors and guides as you become an aspiring SLP. Students attend live online classes and complete clinical placements in their communities or at one of our partner sites. The online format enables students from across the United States to experience a Baylor education without relocating.",
        "program website url": "https://online.baylor.edu/programs/master-of-science-in-communication-sciences-and-disorders",
        "Accreditation status": "The Master of Science (M.S.) education program in speech-language pathology (residential and distance education) at Baylor University is a Candidate for Accreditation by the Council on Academic Accreditation in Audiology and Speech-Language Pathology (CAA) of the American Speech-Language-Hearing Association, 2200 Research Boulevard, #310, Rockville, MD 20850, 800-498-2071 or 301-296-5700. Candidacy is a “preaccreditation” status with the CAA, awarded to developing or emerging programs for a maximum period of 5 years. This program has an accreditation visit scheduled for the 2023-2024 academic year.",
        "Level": "Master's",
        "Program name": "Master of Science in Communication Sciences & Disorders (Online)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Music degree in composition provides student composers with opportunities for advanced creative work and the development of a personal compositional voice. Graduate composers study privately with our composition faculty and participate in a weekly composition seminar. The curriculum also includes advanced studies in music theory, musicology, and other areas of music to complement the student's background and interests. The graduate composition student has many opportunities to have their works performed on student and faculty recitals.\n\nBaylor composition students write for a wide variety of media including solo instruments, voice, chamber ensembles, choir, band, and orchestra. Premieres of student works are common events in the School of Music, and composers have opportunities to collaborate with student and faculty performers in a variety of settings. The School of Music regularly hosts guest composers and performers for residencies that include lectures, masterclasses, and concerts, providing graduate students with opportunities for personal interaction with these distinguished artists.\n\nThe two-year MM in Composition degree culminates with the public performance of a thesis recital, a substantial original work or a collection of shorter works composed during the course of study. This recital is accompanied by a document that provides a theoretical analysis of the recital compositions.",
        "program website url": "https://music.baylor.edu/mmcomposition",
        "Accreditation status": "The Baylor University School of Music is a member of the National Association of Schools of Music and the Texas Association of Music Schools. Baylor University is accredited by the Southern Association of Colleges and Schools.",
        "Level": "Master of Music",
        "Program name": "Master of Music in Composition",
        "Program Page url": "https://music.baylor.edu/mmcomposition"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Computer Science (MSCS) degree program is designed for students who want to broaden and deepen their understanding of computer science. Students in the Baylor MSCS program can choose between a thesis and non-thesis option. The thesis option allows students to participate in state-of-the-art research with one of the Computer Science faculty and is excellent preparation for doctoral studies. The non-thesis option allows students to expand their knowledge of cutting-edge computer science topics and may be completed more quickly than the thesis option. Most students take two years to complete the degree, but students in the non-thesis option may be able to finish in one-and-a-half years.",
        "program website url": "https://graduate.baylor.edu/computer-science-ms",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Computer Science",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The PhD in Computer Science offers students the opportunity to study at the highest levels with our world-class faculty. Students are typically funded throughout their time in the program, including tuition remission and a stipend. We work with students to develop individualized plans of study based on their interests and our faculty research strengths. PhD students work closely with a faculty mentor to conduct novel research. This research is expected to result in scholarly publications and a dissertation. Graduates of our PhD program are well-prepared to go into industrial research labs and academic positions.",
        "program website url": "https://www.baylor.edu/ecs/cs/index.php?id=973781",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Computer Science",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": [
            "software engineering",
            "data science",
            "cybersecurity"
        ],
        "description": "Baylor's online Master of Science in Computer Science (MSCS) provides students with the advanced skills and knowledge they need to succeed in the fast-paced and ever-changing world of technology. The program is designed for working professionals who want to advance their careers in computer science but need the flexibility of an online program. The curriculum is rigorous and challenging, but it is also flexible and adaptable to the needs of each student. Students can choose to specialize in one of three areas: software engineering, data science, or cybersecurity. The program is taught by experienced and knowledgeable faculty who are experts in their fields. The faculty is committed to providing students with the best possible education and preparing them for successful careers in computer science.",
        "program website url": "https://graduate.baylor.edu/program/computer-science-ms-online",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Computer Science (Online)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Computer Systems Engineering is a new and exciting program for graduate students interested in pursuing a career that bridges the gap between hardware and software. The program is designed to provide students with a strong foundation in both computer hardware and software design. Students in the program will take a variety of courses that cover topics such as computer architecture, digital logic, and operating systems. In addition, students will have the opportunity to participate in hands-on projects and research that will allow them to apply their knowledge to real-world problems. The Certificate in Computer Systems Engineering is a great way for students to gain the skills and knowledge they need to succeed in the ever-changing world of computer engineering.",
        "program website url": "https://www.baylor.edu/ecs/cs/index.php?id=977017",
        "Accreditation status": null,
        "Program name": "Certificate in Computer Systems Engineering",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Choral, Orchestral, and Wind Band",
        "description": "The Master of Music in conducting is offered in three areas of concentration: choral, orchestral, and wind band. The conducting program provides students with the opportunity to refine their conducting gesture, to broaden their knowledge of repertoire, to expand their score study and rehearsal techniques, and to develop their musical leadership skills in a Christian environment that encourages the highest standards of musical performance and scholarship.\n\nThe primary focus of the graduate conducting student’s curriculum is applied conducting lessons, conducting seminars, and ensemble participation. In addition, students have numerous podium opportunities as assistant conductors of major ensembles, conductors of studio and lab ensembles, conductors of department recitals, and as guest conductors with major ensembles.",
        "program website url": "https://graduate.baylor.edu/program/music-mm-conducting",
        "Accreditation status": "Baylor University is an accredited institutional member of the National Association of Schools of Music. The undergraduate and graduate curricula in music have been and are approved by the Commission on Accreditation and the Commission on Community/Junior College Accreditation, as appropriate.",
        "Program name": "Master of Music in Conducting",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Curriculum and Instruction is designed to prepare master teachers, educational leaders, and instructional specialists for a variety of educational settings. Through the program, students develop an advanced knowledge base of learning, curriculum, and instruction and are able to apply this knowledge to the creation, implementation, and evaluation of curriculum, instruction, and assessment in school and school-related settings. Advanced professional skills in curriculum, pedagogy, technology, and research are emphasized. The program includes the option of a thirty-hour non-thesis program or a thirty-hour program with thesis.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-education/curriculum-instruction/curriculum-instruction-ma/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Curriculum and Instruction (Education)",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-education/curriculum-instruction/curriculum-instruction-ma/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Master of Science in Education in Curriculum and Instruction (Education)",
        "Program Page url": "https://www.kcentv.com/article/news/local/baylor-rename-school-of-education-30-million-gift/500-b561c7d4-52ca-497e-922b-57dcb9c42c60"
    },
    {
        "Concentration name": "English Education/Language Arts, Gifted and Talented Education, Mathematics Education, Science Education, Social Studies Education, Multicultural Education/Social Justice",
        "description": "The Doctor of Philosophy (PhD) in Curriculum & Teaching is designed to develop leaders in the field of education who can fill a variety of roles in universities, school districts, and educational organizations. The program’s focus is to provide students with the theoretical and practical knowledge needed to meet the challenges that confront educators today. The PhD in Curriculum & Teaching provides a balance of theoretical and applied knowledge with an emphasis on research. The program is designed for individuals with a master’s degree in curriculum and instruction, or a related field, who desire a comprehensive program of study in curriculum and teaching and an introduction to educational research.",
        "program website url": "https://ci.soe.baylor.edu/graduate-programs/phd-curriculum-and-teaching",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Curriculum and Teaching",
        "Program Page url": "https://ci.soe.baylor.edu/graduate-programs/phd-curriculum-and-teaching"
    },
    {
        "Concentration name": null,
        "description": "The M.F.A. in Directing is an intensive, three-year program focused on developing theatre directors who are Christian artists and scholars. We are interested in emerging directors who are collaborative artists, eager to explore the world through a variety of theatrical lenses, and excited to engage with a diversity of texts and performance styles. With a small cohort size and a low student-to-faculty ratio, we offer personal mentorship from a faculty of professional artists and scholars. Our students develop their own directing practice through hands-on experience and a sequence of directing classes and seminars, including Theatre History, Dramatic Literature, and Pedagogy. Baylor Theatre's production season offers many opportunities for our directors to practice their craft in a variety of venues and with a range of production support. Every directing student will direct a fully-supported production as their thesis project.",
        "program website url": "https://theatre.artsandsciences.baylor.edu/academics/graduate-programs/mfa-directing",
        "Accreditation status": "Baylor Theatre is accredited by the National Association of Schools of Theatre (NAST).",
        "Program name": "Master of Fine Arts in Directing (Theatre Arts)",
        "Program Page url": "https://theatre.artsandsciences.baylor.edu/"
    },
    {
        "Concentration name": "Students will choose one of two specializations from the School of Education: either Learning and Development or Quantitative Methods.",
        "description": "The Master of Divinity/Master of Science in Education (MDiv/MSEd) is a joint degree program between Baylor's George W. Truett Theological Seminary and the School of Education. The MDiv/MSEd degree is an academically rigorous program intended to prepare students who plan to serve in educational ministries, church administration, and teaching in schools, including college and university settings. Students graduate with two degrees, an MDiv from Truett Seminary and an MSEd in Educational Psychology from the School of Education. The program requires 90 total hours, a reduction from the 111 hours required if both degrees were completed separately.",
        "program website url": "https://truett.baylor.edu/academics/degrees/mdiv-msed",
        "Accreditation status": "Truett Seminary is accredited by the Association of Theological Schools in the United States and Canada (ATS), and the following degree programs are approved: MDiv, MACM, MTS, DMin. Baylor University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award baccalaureate, masters, and doctorate degrees.",
        "Program name": "Master of Divinity with Master of Science in Education Joint Degree",
        "Program Page url": "https://www.google.com/search?q=time+in+McLennan+County,+US"
    },
    {
        "Concentration name": "Old Testament, New Testament, Theological Studies, or Historical Studies",
        "description": "The joint MDiv/MA degree is offered by Baylor University's George W. Truett Theological Seminary and the Graduate School. This program offers students the opportunity to combine the professional Master of Divinity (MDiv) degree with the academic Master of Arts (MA) degree. Students may pursue an MA in any of the fields offered in the Religion Department: Old Testament, New Testament, Theological Studies, or Historical Studies.",
        "program website url": "https://graduate.baylor.edu/programs/program/master-of-divinity-with-master-of-arts-joint-degree",
        "Accreditation status": "The George W. Truett Theological Seminary of Baylor University is accredited by the Association of Theological Schools in the United States and Canada, and the following degree programs are approved: MDiv, MACM, MTS, DMin, PhD.",
        "Program name": "Master of Divinity with Master of Arts Joint Degree",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Economics provides a deep and rigorous training in modern economic theory and econometrics. The curriculum trains students to use and apply economic models and econometric techniques to analyze real world phenomena. Students will acquire advanced skills in analytical and quantitative methods from both a theoretical and an applied perspective. The program can be completed in as little as 10 months and has been designated by the U.S. government as a STEM degree program (science, technology, engineering and mathematics).",
        "program website url": "https://graduate.baylor.edu/economics-ms",
        "Accreditation status": null,
        "Program name": "Master of Science in Economics",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The online Doctor of Education (Ed.D.) in Learning and Organizational Change is an online professional doctoral degree program designed for leaders in various professional settings including K-12, higher education, corporate, non-profit, government, and military who are interested in becoming more effective change agents in their organizations. The program’s curriculum is grounded in the belief that leaders must understand how people learn and how organizations change in order to lead effectively. Leaders must also possess the professional knowledge, skills, and dispositions necessary to design and implement innovative and effective systems for learning and organizational improvement. Students in the program develop these essential capacities by engaging in a relevant, challenging, and fast-paced curriculum that blends theory and practice. The Ed.D. program challenges students to hone their analytic and problem-solving skills in order to address learning and leadership challenges within their own organizational contexts. The program requires 54 semester hours of coursework which includes two required immersion experiences that connect with coursework. The program is specifically designed to be completed in three years.",
        "program website url": "https://education.baylor.edu/online-programs/edd-learning-and-organizational-change/",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Education in Learning & Organizational Change (Online)",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-education/curriculum-instruction/curriculum-instruction-edd/"
    },
    {
        "Concentration name": null,
        "description": "The Baylor Doctor of Education (EdD) in K-12 Educational Leadership is an online cohort-based program for leaders of schools, districts, and other educational organizations who seek to bring about substantive, lasting improvement. The program is designed for working professionals, providing the flexibility of online coursework with the rigor of a Baylor EdD. Students advance through the program with a cohort of fellow educators, creating a built-in support system for each student. Baylor’s EdD in K-12 Educational Leadership prepares graduates for a variety of leadership roles in both public and private K-12 educational settings. Graduates assume roles such as superintendents, assistant superintendents, central office administrators, principals, and other key leadership positions.",
        "program website url": "https://education.baylor.edu/educational-leadership/programs-degrees/doctor-education-edd-k-12-educational-leadership",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Education in Educational Leadership K-12",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Education (M.S.Ed.) in Educational Psychology is designed to provide you with a unique perspective on learning and human development as you work to develop research-based practices that improve learning environments in schools, homes, and community settings.\n\nOur program provides a broad curriculum with an emphasis in learning and development, but you may also take classes in quantitative methods, gifted and talented education, special education, and other areas of interest. You can design a course of study that aligns with your specific career goals in areas such as:\n\nTeaching\nInstructional design and coordination\nYouth and family ministry\nCommunity agency program development\nResearch\nPreparation for doctoral study\nThe M.S.Ed. in Educational Psychology offers thesis and non-thesis options. The thesis option prepares you for further graduate study at the doctoral level, while the non-thesis option provides a broader course of study to better prepare you for employment immediately following graduation.",
        "program website url": "https://graduate.baylor.edu/program/educational_psychology_msed",
        "Accreditation status": null,
        "Program name": "Master of Science in Education in Educational Psychology",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Gifted & Talented Education",
        "description": "The Master of Science in Education (MSEd) in Educational Psychology with a concentration in Gifted and Talented Education is a fully online, 36-hour program that is designed for individuals who desire to develop expertise in meeting the needs of gifted and talented students. The coursework provides in-depth understanding of the nature and needs of gifted students, curriculum and instruction for gifted students, and the social and emotional needs of gifted students. An additional focus is on creativity. Graduates of this program may become a gifted and talented coordinator/specialist in a school district, a teacher of gifted and talented students, or a gifted and talented instructional coach. The program does not offer teacher certification. Students take 12 courses, each lasting 8 weeks. Students complete the program in two years or less.",
        "program website url": "https://graduate.baylor.edu/programs/program/gifted-talented-education-msed",
        "Accreditation status": null,
        "Program name": "Master of Science in Education in Educational Psychology with a Concentration in Gifted & Talented Education",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": [
            "Gifted and Talented",
            "Learning and Development",
            "Quantitative Methods"
        ],
        "description": "The Ph.D. in Educational Psychology is designed to prepare you to become a university professor or a leader in other educational settings. Our graduates have pursued successful careers at major research universities, in liberal arts colleges, and in a variety of other applied settings, including the military, research corporations, school districts, and state education agencies. The graduate program in Educational Psychology focuses on learning, development, and instruction across the lifespan. You’ll have the chance to explore quantitative methods and educational research. The program features a faculty-student mentorship model where you’ll work closely with a faculty mentor on research and teaching. You’ll become part of a research team with your mentor and fellow graduate students. There are numerous opportunities to co-author publications in research journals and present research at national and international conferences. The program has three specializations from which you can choose: Gifted and Talented, Learning and Development, and Quantitative Methods.",
        "program website url": "https://graduate.baylor.edu/educational-psychology-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Educational Psychology",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Gifted & Talented Education",
        "description": "The Doctor of Philosophy (Ph.D.) degree in Educational Psychology is an intensive, research-oriented degree that prepares students for careers in research, college and university teaching, and other leadership positions in education and human services. The Department of Educational Psychology offers concentrations in: Gifted and Talented Education, Learning and Development, Quantitative Methods, and Special Education. Graduates from our program have received tenure-track faculty positions in universities and colleges and leadership positions in state departments of education, regional education service centers, school districts, and private organizations.",
        "program website url": "https://graduate.baylor.edu/program/educational-psychology-phd",
        "Accreditation status": null,
        "Program name": "PhD in Educational Psychology with a Concentration in Gifted & Talented Education",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Electrical and Computer Engineering (ECE) PhD program is a research-oriented degree program. The purpose of the program is to produce graduates who are able to conduct independent research in electrical and computer engineering at the highest levels of originality and quality. The degree is granted upon demonstration of ability to do independent research.",
        "program website url": "https://graduate.baylor.edu/study/electrical-computer-engineering-phd/",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Electrical & Computer Engineering",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Communications, Computer Engineering, Electromagnetics & Microwaves, Power, Control Systems, Signal Processing & Machine Learning, VLSI",
        "description": "The graduate program in electrical and computer engineering prepares students for leadership roles in research, development, and design positions in industry and academia. The master of science degree is offered with both thesis and non-thesis options. The Doctor of Philosophy degree is also offered. Both degrees provide students with a strong background in the fundamentals of electrical engineering while permitting them to pursue in-depth study and research in a specialized area.",
        "program website url": "https://www.ecs.baylor.edu/departments/electrical-and-computer-engineering/electrical-computer-engineering-graduate-programs",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Electrical & Computer Engineering",
        "Program Page url": "https://www.ecs.baylor.edu/departments/electrical-and-computer-engineering/electrical-computer-engineering-graduate-programs"
    },
    {
        "Concentration name": "Electrical and Computer Engineering, Mechanical Engineering, General Engineering",
        "description": "The Master of Engineering (MEng) degree program is a non-thesis professional master’s degree focused on providing advanced technical skills to our students. In addition, the degree program provides professional development in the areas of leadership, management, and communication. The degree can be completed in as little as three semesters. The MEng degree is available in three concentrations: Electrical and Computer Engineering, Mechanical Engineering, and a general Engineering option which allows students more flexibility. The program is flexible and allows for students to focus in areas of their interest. With a focus on application and design, this degree prepares students for a variety of careers in industry.",
        "program website url": "https://graduate.baylor.edu/programs/program/engineering-meng",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Engineering",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": [
            "Old and Middle English Language and Literature",
            "Renaissance and Early Modern Literature",
            "Eighteenth-Century Literature",
            "Nineteenth-Century Literature",
            "Modern British and American Literature",
            "Religion and Literature",
            "Rhetoric and Composition"
        ],
        "description": "The M.A. is a two-year program that prepares students for Ph.D. work and for teaching at the secondary or junior college level. The program is flexible, giving students freedom to explore their interests and prepare for their chosen career path. We offer two options for the M.A. degree: a thesis option and a non-thesis option. The thesis option allows students to work closely with a faculty member on an extended research project and is recommended for those who plan to pursue a Ph.D. The non-thesis option allows students to take a wider range of courses and is a good option for those who plan to teach at the secondary or community college level. In addition to a variety of courses in British and American literature, we regularly offer classes on literary theory, religion and literature, and rhetoric and composition. Students may choose to take courses in any of these areas.",
        "program website url": "https://english.artsandsciences.baylor.edu/graduate",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in English",
        "Program Page url": "https://english.artsandsciences.baylor.edu/graduate"
    },
    {
        "Concentration name": [
            "Old and Middle English Literature",
            "Renaissance Literature",
            "18th-Century British Literature",
            "19th-Century British Literature",
            "20th- and 21st-Century British Literature",
            "Early American Literature (to 1865)",
            "Late American Literature (1865-present)",
            "Literary Theory"
        ],
        "description": "Baylor’s PhD program in English offers a traditional course of study in English and American literary history. The curriculum provides a solid grounding in literary history and theory, while affording students the opportunity to concentrate their work in a major field and one minor field.\n\nThe department is committed to its students’ intellectual development as scholars and their professional development as teachers. The department provides students with rigorous training in scholarship and with individual guidance toward professional publication. The PhD program prepares students for positions as scholar-teachers in colleges and universities.",
        "program website url": "https://graduate.baylor.edu/program/english-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in English",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The PhD in Entrepreneurship prepares students to become highly-skilled researchers and inspirational teachers at top universities around the world. Baylor's program is distinct because of its deep emphasis on mentorship and its apprenticeship-style of learning.\n\nStudents in the program work closely with faculty, collaborating on research projects from the very beginning. This hands-on experience provides students with the practical skills and knowledge they need to be successful.\n\nThis mentoring model has a track record of success. Graduates of Baylor's program have secured tenure-track positions at leading research universities such as Indiana University, University of Georgia, University of Tennessee, University of Oklahoma, Texas Christian University, University of Louisville, University of Missouri, University of Mississippi, Iowa State University, Syracuse University, Kansas State University, Oklahoma State University and Oregon State University.\n\nThe PhD in Entrepreneurship is a four-year, full-time, in-residence program. The program is designed to develop the research and teaching skills needed for a successful academic career.",
        "program website url": "https://www.baylor.edu/business/entrepreneurship/index.php?id=973278",
        "Accreditation status": "Hankamer School of Business is accredited by AACSB International.",
        "Level": "PhD",
        "Program name": "PhD in Entrepreneurship",
        "Program Page url": "https://www.sioe.org/news/baylor-phd-entrepreneurship"
    },
    {
        "Concentration name": null,
        "description": "The Department of Environmental Science offers graduate education leading to both Master of Science (M.S.) and Doctor of Philosophy (Ph.D.) degrees. Our primary objective is to provide an educational experience of the highest quality in order to prepare our students for careers in research, teaching, and environmental management. Strengths of the department include aquatic systems science, ecotoxicology and risk assessment, environmental chemistry and health.",
        "program website url": "https://graduate.baylor.edu/environmental-science/environmental-science-ms",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Environmental Science",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Ph.D. in Environmental Science is an interdisciplinary degree program involving faculty from the departments of Biology, Chemistry and Biochemistry, Environmental Science, Geosciences, Public Health, and Statistical Science. The program is committed to excellence in research and teaching, and provides students with a broad background and understanding of environmental issues from a scientific perspective and specialized training in their chosen research areas. Students receive broad training in environmental sciences through a series of core courses and specialized training through advanced courses and original research.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/environmental-science/environmental-science-phd/",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Environmental Science",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/environmental-science/environmental-science-phd/"
    },
    {
        "Concentration name": "Professional, Science Communication",
        "description": "The Master of Environmental Studies (MES) is a non-thesis degree that provides interdisciplinary training for students seeking careers in the private or public sector. With a flexible curriculum tailored to meet individual student interests, the MES degree allows students to acquire broad expertise across a range of environmental topics or in-depth knowledge in a focused area. This degree is designed for students from a variety of academic backgrounds and requires a minimum of thirty-six semester hours, which includes three hours of a professional internship. The MES is a non-thesis degree available in two tracks: professional and science communication. Students in the professional track typically aspire to careers in industry or government, while students in the science communication track focus on communicating environmental science to broader audiences through journalism, digital media, and other venues.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/environmental-science/master-environmental-studies-mes/",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Environmental Studies",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/environmental-science/master-environmental-studies-mes/"
    },
    {
        "Concentration name": null,
        "description": "The Baylor Executive MBA program in Dallas is designed for the mid-career executive who is on the fast track to the C-suite. With a collaborative environment, a curriculum focused on executive-level strategic decision making and a convenient once-a-month format, we offer a premier MBA program that has been transforming leaders in the DFW area for 30 years.",
        "program website url": "https://www.baylor.edu/business/emba/dallas/",
        "Accreditation status": "Hankamer School of Business is accredited by AACSB International.",
        "Level": "Masters",
        "Program name": "Executive Master of Business Administration (Dallas)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Healthcare",
        "description": "The Baylor Executive MBA Program in Dallas provides a specialized curriculum with a healthcare focus for experienced executives who are on a trajectory to the C-suite. Our 21-month program allows you to earn an MBA from a nationally-ranked institution without interrupting your career. You will benefit from a collaborative environment that brings together a diverse group of physicians, entrepreneurs, administrators, and other clinical and non-clinical professionals. Each student brings an average of 15 years of professional experience, with 8-10 years in management, which creates a dynamic classroom environment. In addition, our cohort format allows you to create a valuable professional network for life.",
        "program website url": "https://hankamer.baylor.edu/mba/dallas",
        "Accreditation status": "The Hankamer School of Business is accredited by AACSB International.",
        "Level": "MBA",
        "Program name": "Executive Master of Business Administration in Healthcare (Dallas)",
        "Program Page url": "https://hankamer.baylor.edu/mba/dallas"
    },
    {
        "Concentration name": "Executive Nurse Leadership",
        "description": "The Baylor University Louise Herrington School of Nursing Doctor of Nursing Practice (DNP) in Executive Nurse Leadership (ENL) is a 30-month, 39-credit hour program for nurses who hold a Master of Science in Nursing (MSN) degree in nursing leadership, administration, or management from a regionally accredited institution. Students in this track must have a current, unencumbered license to practice as a Registered Nurse. The DNP-ENL program is offered through a hybrid format, which means the majority of the coursework is online with executive on-campus sessions each semester. The on-campus sessions are held in Dallas, Texas. The program is designed to develop nurse leaders who are prepared to lead and transform today’s complex and dynamic healthcare systems.",
        "program website url": "https://nursing.baylor.edu/academics/graduate/dnp-executive-nurse-leadership",
        "Accreditation status": "The Doctor of Nursing Practice degree program at Baylor University Louise Herrington School of Nursing is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice in Executive Nurse Leadership",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": [
            "Exercise & Nutrition",
            "Exercise Physiology",
            "Nutrition Sciences"
        ],
        "description": "The PhD in Exercise and Nutrition Sciences is designed to provide students with an advanced understanding of the integration of exercise and nutrition to improve human health and performance. The PhD is an interdisciplinary program that includes faculty from nutrition sciences, exercise physiology, and physical therapy. Students will choose one of three concentrations: 1) Exercise & Nutrition, 2) Exercise Physiology, and 3) Nutrition Sciences. Each concentration is designed to provide advanced training in research and content knowledge specific to the discipline. Students in all concentrations are expected to conduct high-quality, impactful research that leads to publication in reputable peer-reviewed journals. All students will complete a core curriculum to gain a broad understanding of exercise and nutrition sciences and will select one of the three concentrations for an in-depth course of study. The curriculum provides a strong research core, including statistics and research methods, with additional coursework focused on the student’s concentration of interest. The goal of the PhD in Exercise and Nutrition Sciences is to train the next generation of researchers and scholars who can work in academic or industry settings.",
        "program website url": "https://www.baylor.edu/hhpr/ens/index.php?id=975878",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Exercise and Nutrition Sciences",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Exercise Physiology degree program is a two-year program in the Department of Health, Human Performance, and Recreation. We have two tracks: a thesis track and a non-thesis track. Both tracks are designed to provide students an advanced understanding of the physiological responses and adaptations to acute and chronic exercise. In addition, students are provided the opportunity for research and an in-depth study of exercise physiology.",
        "program website url": "https://www.baylor.edu/hhpr/index.php?id=973789",
        "Accreditation status": null,
        "level": "Masters",
        "Program name": "Master of Science in Exercise Physiology",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Family Nurse Practitioner",
        "description": "Baylor University's DNP-FNP program prepares students with the skills and knowledge to serve as leaders in the nursing profession. Our Family Nurse Practitioner program is designed to prepare nurses with a Bachelor of Science in Nursing (BSN) or a Master of Science in Nursing (MSN) for advanced practice as a family nurse practitioner. FNPs are prepared to provide primary care for persons of all ages in a variety of settings. The curriculum emphasizes health promotion, disease prevention, and the clinical management of common health problems. Upon completion of the DNP-FNP program, graduates are eligible to take the Family Nurse Practitioner national certification exam through the American Nurses Credentialing Center (ANCC) or the American Academy of Nurse Practitioners (AANP). Courses are offered online with on-campus immersions and clinicals can be arranged in your own community.",
        "program website url": "https://nursing.baylor.edu/programs/dnp/dnp-fnp",
        "Accreditation status": "The Doctor of Nursing Practice program at Baylor University is accredited by the Commission on Collegiate Nursing Education, 655 K Street, NW, Suite 750, Washington, DC 20001, 202-887-6791.",
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice in Family Nurse Practitioner",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Thesis Track, Professional Track",
        "description": "The Master of Arts in Film & Digital Media provides students with a theoretical and practical foundation for careers in film and digital media. The curriculum trains students to produce creative content, including narrative and documentary films, client-based media, web series, and other forms of digital media. Students also develop research and critical thinking skills as they learn about film history and media theory. The MA in Film & Digital Media prepares students for creative and professional careers in media production as well as for further study at the doctoral level.",
        "program website url": "https://www.baylor.edu/fdm/index.php?id=973215",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Film & Digital Media",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Fine Arts in Film & Digital Media is an intensive two-year program in which a select group of students are trained as writer/directors who will graduate with the professional, artistic, and intellectual acuity to create compelling narrative films. MFA students produce an original, festival-ready thesis film in their final year. Throughout the two years, they take a broad range of film production courses and advanced seminars in film history and theory. Graduate students are encouraged to take courses in other departments and have access to our wide range of professional-grade film equipment.",
        "program website url": "https://graduate.baylor.edu/program/film-digital-media-mfa",
        "Accreditation status": null,
        "Level": "MFA",
        "Program name": "Master of Fine Arts in Film and Digital Media",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Department of Geosciences at Baylor University offers both the Master of Science (M.S.) and Doctor of Philosophy (Ph.D.) degrees. Our graduate program is thesis/dissertation-based and offers a low student-to-faculty ratio (2:1). With state-of-the-art facilities, our program provides a wide variety of research opportunities for graduate students. Faculty research areas are diverse and interdisciplinary, and we highly encourage collaborative research between students and faculty. As a result, Baylor graduate students have established a long tradition of producing and presenting high-quality research.",
        "program website url": "https://geosciences.artsandsciences.baylor.edu/graduate",
        "Accreditation status": null,
        "Program name": "Master of Science in Geosciences",
        "Program Page url": "https://geosciences.artsandsciences.baylor.edu/people/graduate-students"
    },
    {
        "Concentration name": null,
        "description": "The Department of Geosciences offers a PhD in Geosciences. The program prepares students for careers in academia, the energy and environmental industries, and government. We conduct research worldwide, from the Arctic to Antarctica. We are a dynamic, growing department of 14 tenured/tenure-track faculty and 2 full-time lecturers, approximately 50 undergraduates, and 40 graduate students. Our areas of emphasis in research and teaching are broad and include: Environmental Geosciences (climate change, hydrogeology, geophysics, paleoclimatology, biogeochemistry, contaminant transport), Tectonics & Sedimentology (basin analysis, structural geology, geophysics, tectonics, thermochronology, sedimentology, reservoir characterization), and Paleontology (paleoecology, vertebrate paleontology, paleobotany).",
        "program website url": "https://graduate.baylor.edu/geosciences/program/geosciences-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Geosciences",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "Baylor's residential Master of Health Administration (MHA) program is a professional degree for those seeking to lead and manage in a variety of health service organizations. Students in the Baylor MHA program are prepared for careers in hospitals, health systems, physician practices, consulting firms, and long-term care facilities. The program provides the opportunity for students to complement their classroom education with a seven-month, paid administrative residency. This distinctive feature of the program gives students invaluable experience and exceptional placement opportunities. Through the Baylor MHA program, students are equipped for a career that aligns with a calling to serve others through healthcare leadership.",
        "program website url": "https://robbins.baylor.edu/programs/graduate/master-health-administration",
        "Accreditation status": "Accredited by the Commission on Accreditation of Healthcare Management Education (CAHME)",
        "Level": "Masters",
        "Program name": "Master of Health Administration",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Executive Clinical Leadership",
        "description": "The Executive Clinical Leadership Track (ECL) is designed to prepare senior clinicians for leadership roles in fixed medical facilities, operational units, and at the strategic level of the Military Health System (MHS). This 24-month program leads to a dual Master of Health Administration (MHA) and Master of Business Administration (MBA) degree from Baylor University.\n\nProgram Goals\nGraduates of the Executive Clinical Leadership Track are able to:\n- Integrate foundational business and healthcare management disciplines to resolve complex organizational problems in a variety of healthcare settings.\n- Think critically to solve problems and make sound leadership and management decisions.\n- Effectively communicate to a wide range of audiences using a variety of communication methods.\n- Develop and lead others in a way that reflects values of integrity, service, and excellence.\n- Create innovative solutions to challenges across the Military Health System.",
        "program website url": "https://hankamer.baylor.edu/army-baylor/curriculum/ecl-mha-mba",
        "Accreditation status": "The Army-Baylor University MHA degree program is accredited by the Commission on Accreditation of Healthcare Management Education (CAHME). The Hankamer School of Business is accredited by AACSB International – The Association to Advance Collegiate Schools of Business for both its business and accounting programs.",
        "Level": "Masters",
        "Program name": "Master of Health Administration / Master of Business Administration Joint Degree",
        "Program Page url": "https://hankamer.baylor.edu/army-baylor/curriculum/ecl-mha-mba"
    },
    {
        "Concentration name": null,
        "description": "The PhD in Health Services Research is designed for students seeking careers in health services research in academic, government, corporate or consulting organizations. The program has three distinct pillars with a comprehensive curriculum to train scholars in health services research. The program is unique in its integration within a business school and its strong emphasis on developing scholars with a deep understanding of health economics, health policy and management and their intersection in the development of a highly reliable health system. Baylor University’s PhD in Health Services Research, offered through the Department of Economics in the Hankamer School of Business, prepares graduates for a career in academia, government or industry. Students will develop a rich understanding of one of these areas, depending on their interests: Health Services Research, Health Policy & Management, Health Economics. The curriculum is delivered in a face-to-face format on Baylor's campus in Waco, Texas. Students complete the program in four to five years.",
        "program website url": "https://hankamer.baylor.edu/health-services-phd",
        "Accreditation status": null,
        "Program name": "PhD in Health Services",
        "Program Page url": "https://hankamer.baylor.edu/health-services-phd"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Education (MSEd) in Higher Education and Student Affairs (HESA) is a full-time, two-year graduate program that prepares students for careers in student affairs, academic affairs, and other administrative areas of higher education. The Baylor HESA program emphasizes the integration of faith and learning, and it is built upon the foundational principles of a Christian mission in a caring community.\n\nThe HESA program operates on a cohort model, where students enter and proceed through the program together. Most classes have an enrollment of 10-15 students, which fosters close relationships among students and faculty. Students have ample opportunities for mentoring from faculty and administrators, research experience with faculty, and professional development and networking on and off campus.\n\nGraduates from the HESA program have found success in obtaining jobs in various offices on college campuses including student activities, admissions, academic advising, career services, multicultural affairs, residence life, financial aid, and new student programs. Students have found jobs at institutions such as Baylor University, Duke University, the University of North Carolina at Chapel Hill, Texas A&M University, Southern Methodist University, Texas Christian University, the University of Oklahoma, and Oklahoma State University.",
        "program website url": "https://edl.soe.baylor.edu/graduate-programs/msed-higher-education-student-affairs-hesa",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Education in Higher Education and Student Affairs",
        "Program Page url": "https://edl.soe.baylor.edu/graduate-programs/msed-higher-education-student-affairs-hesa"
    },
    {
        "Concentration name": null,
        "description": "The PhD in Higher Education Studies and Leadership (HESL) is an intensive program of study designed to prepare individuals for faculty and administrative leadership positions in colleges and universities as well as for positions in higher education-related agencies, boards, and commissions. The program is specifically designed to provide students with significant grounding in higher education literature, theory, and research. Students will study curriculum with a cohort and gain significant knowledge and skills in organizational theory, governance and finance, student development, legal issues, and teaching and learning. Additionally, students are able to customize their studies through elective coursework, cognate studies, and dissertation research.",
        "program website url": "https://www.baylor.edu/soe/hesl/index.php?id=930335",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Higher Education Studies & Leadership",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "United States history, European history, history of Religion, World History",
        "description": "The M.A. program in History provides students with an introduction to the professional study of history and equips them with basic research and analytical skills in the discipline. The M.A. in History is not a terminal degree program, and as such we give strong preference in admissions to students who plan to continue in the Ph.D. program at Baylor. However, the M.A. program serves those who plan to teach history at the secondary level, work in public history, or enter a number of other professions. We accept M.A. applications in United States history, European history, and the history of Religion and we offer a separate concentration in World History.",
        "program website url": "https://history.artsandsciences.baylor.edu/graduate/ma-history",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in History",
        "Program Page url": "https://history.artsandsciences.baylor.edu/"
    },
    {
        "Concentration name": "History of the Americas, History of Early Modern Europe, History of Modern Europe, World History",
        "description": "The Baylor PhD program in History provides students with a vibrant and supportive intellectual community. Our faculty have published widely and are highly respected in their fields. Graduate students have the opportunity to work closely with their faculty mentors in small seminars and one-on-one tutorials. The program’s curriculum is flexible, designed to allow each student to tailor a course of study to fit their intellectual interests and professional goals. We take pride in our success in preparing students for a variety of careers. Our students have an excellent record of winning prestigious fellowships, publishing their work, and securing academic positions. We are committed to funding our students through five years of study. Our standard funding package includes full tuition remission, a generous stipend, and subsidized health insurance. The Baylor History PhD program offers comprehensive study in the following fields: History of the Americas, History of Early Modern Europe, History of Modern Europe, World History.",
        "program website url": "https://history.artsandsciences.baylor.edu/graduate-programs/phd-program-overview",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in History",
        "Program Page url": "https://history.artsandsciences.baylor.edu/graduate-programs/phd-program-overview"
    },
    {
        "Concentration name": "Cyber Security",
        "description": "The Master of Science in Information Systems (MSIS) degree is offered by the Department of Information Systems and Business Analytics in the Hankamer School of Business. It is a STEM (Science, Technology, Engineering, and Math) designated program designed to provide students with a strong foundation of technical skills and business knowledge to become leaders in the rapidly growing information systems field. The program is flexible to accommodate students from various undergraduate backgrounds. The MSIS program prepares students for careers in the areas of business analytics, information technology, and cyber security. Students may select a concentration in cyber security or a general MSIS degree. Students develop both their analytical and problem-solving skills to manage and leverage information systems in the workplace. We equip students with the necessary skills to develop secure information systems and analyze data for business decision-making. We emphasize hands-on and experiential learning by incorporating real-world projects in our courses. We also provide ample opportunities for students to meet with professionals from leading companies in our classes as well as through seminars and career fairs.",
        "program website url": "https://graduate.baylor.edu/program/information-systems-ms",
        "Accreditation status": "The Hankamer School of Business is accredited by AACSB International, the premier accreditation agency for business schools.",
        "Program name": "Master of Science in Information Systems",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The PhD program in Information Systems (IS) at Baylor’s Hankamer School of Business will prepare you for a career as a productive researcher and an effective teacher in a university setting. We train our graduates to excel in academia as professors at leading research institutions. We recognize that the value of an IS PhD degree depends heavily upon a graduate’s initial placement and long-term professional development. Therefore, our program provides significant faculty support and other resources to ensure student success on the job market and throughout their careers. Our PhD program provides many distinct advantages for a student seeking an academic career. For example, all admitted students are fully funded with a competitive stipend and their tuition is waived. In addition, the program has a strong placement record at leading research universities in the United States and abroad. As an R1-designated university, our faculty publish in premier journals, offering students excellent opportunities for research collaboration.",
        "program website url": "https://www.baylor.edu/business/mis/index.php?id=974415",
        "Accreditation status": null,
        "Program name": "PhD in Information Systems",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Interdisciplinary Studies allows students to customize a graduate program that suits their particular interests and needs. This program allows students to select three areas of study to combine in a way that creates a unique and personalized learning experience. The MSIS can be particularly attractive to those who have undergraduate degrees in a professional or technical area and seek advanced training in areas such as management, communication or leadership.",
        "program website url": "https://graduate.baylor.edu/study/interdisciplinary-studies-ms",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Interdisciplinary Studies",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of International Journalism (M.I.J.) degree is designed for students who want to become journalists with a global perspective. The program focuses on journalistic practice within a strong scholarly framework. It prepares students for careers in international journalism in the United States and abroad. Students develop reporting skills across media platforms along with a critical understanding of the historical, political, economic and cultural contexts of global media. In addition to rigorous coursework, students complete a professional project, such as a substantial piece of journalistic work or a research-based project on a topic in international media. The degree also requires an internship or professional experience in an international setting.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/journalism-public-relations-new-media/master-international-journalism-mij/",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of International Journalism",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/journalism-public-relations-new-media/master-international-journalism-mij/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in International Relations (MAIR) program provides students with a solid foundation for careers in the U.S. government, the private sector, and nonprofit organizations devoted to international affairs. In recent years, Baylor MAIR graduates have found jobs with the Central Intelligence Agency, the Federal Bureau of Investigation, the U.S. Department of State, the U.S. Agency for International Development, the U.S. Congress, and other federal government agencies. Some go to work for “Beltway bandit” consulting firms that assist the U.S. government with national security matters. Some find jobs in the private sector with firms that conduct international business. Some go on to doctoral programs and academic careers. The MAIR degree can be completed in approximately 18 months. It requires 36 hours of coursework. All students must take a required core curriculum of 12 hours: PSC 5310 Seminar in International Relations, PSC 5320 Seminar in American Foreign Policy, PSC 5331 International Relations in the Developing World, and PSC 5340 National Security Policy. Students complete their remaining hours with a combination of additional international relations courses, courses in other political science subfields, courses from other Baylor departments, and an optional thesis. Many students choose to specialize in a particular region of the world (e.g., the Middle East) or a particular issue area (e.g., international economic policy).",
        "program website url": "https://politicalscience.artsandsciences.baylor.edu/graduate/ma-international-relations",
        "Accreditation status": null,
        "Program name": "Master of Arts in International Relations (Political Science)",
        "Program Page url": "https://politicalscience.artsandsciences.baylor.edu/"
    },
    {
        "Concentration name": "Professional Track, Thesis Track",
        "description": "The Master of Arts in Journalism, Public Relations & New Media is a one-year program that prepares recent graduates or returning professionals to excel in a rapidly changing media world. The program provides an intensive, hands-on experience, and students can choose between a professional or thesis track. The professional track is designed for students who desire to learn practical and professional skills and is the most common choice for M.A. students. The thesis track is designed for students who want to develop research skills and potentially prepare for doctoral studies. Regardless of track, M.A. students take foundational courses on media theory, research and ethics before delving into more practical skills classes. At the end of the first semester, students identify a focus area that could include such topics as sports media, public relations, visual storytelling or literary journalism. From there, students tailor their course schedule to match their professional goals. They also work closely with faculty members on professional projects and research. The goal of the graduate program in journalism is to create master storytellers who can work as professionals in a number of communications fields or as scholars in academia.",
        "program website url": "https://journalism.artsandsciences.baylor.edu/mamj",
        "Accreditation status": "Accredited by the Accrediting Council on Education in Journalism and Mass Communications (ACEJMC)",
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Journalism, Public Relations and New Media",
        "Program Page url": "https://journalism.artsandsciences.baylor.edu/mamj"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Education (MSEd) in Learning Design and Technology (LDT) is designed for professionals who desire to be educational leaders and innovators in a variety of contexts, including P-12 education, higher education, corporate training, non-profit, military, and government settings. The program equips students with the knowledge and skills necessary to design, develop, implement, and evaluate effective and engaging learning experiences using a wide range of technologies and pedagogical strategies. Graduates will be prepared to assume roles such as instructional designers, educational technologists, curriculum specialists, training managers, and online learning specialists.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-education/curriculum-instruction/curriculum-instruction-ldt/",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Learning Design and Technology",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-education/curriculum-instruction/curriculum-instruction-ldt/"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Learning Design and Technology (LDT) is designed to provide professional development for K-12 teachers, instructional designers, technology coordinators, higher education professionals, corporate trainers, and others who wish to incorporate technology and digital resources into their teaching and training. This 12-hour certificate program may be completed in two semesters or longer.",
        "program website url": "https://catalog.baylor.edu/course-information/graduate-course-information/curriculum-instruction-graduate/certificate-learning-design-technology/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Learning Design and Technology",
        "Program Page url": "https://catalog.baylor.edu/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Marriage and Family Therapy (MFT) is a 60 hour program that prepares students for licensure in Texas as a Marriage and Family Therapist (LMFT). The mission of the Master of Science in Marriage and Family Therapy program is to train relationally-minded scholars and therapists for service to diverse individuals, couples, and families through contextually-informed and evidence-based practice.\nStudents will learn from faculty who are productive scholars in the field of marriage and family therapy as well as experienced clinicians and supervisors. The program prepares students to become scientist-practitioners who appreciate the role of research in informing clinical practice and the role of practice in informing research.\nThe MFT program can be completed in two years. During the first year, students take academic courses and begin to develop clinical skills at the Baylor Couple and Family Therapy Clinic, our on-campus training facility. During the second year, students continue their academic coursework and are placed in community agencies to continue their clinical training.",
        "program website url": "https://graduate.baylor.edu/programs/program/marriage-family-therapy-ms",
        "Accreditation status": "The Master of Science in Marriage and Family Therapy Program at Baylor University is accredited by the Commission on Accreditation for Marriage and Family Therapy Education (COAMFTE) of the American Association for Marriage and Family Therapy (AAMFT), 112 South Alfred Street, Alexandria, Virginia 22314, (703) 838-9808, coa@aamft.org.",
        "Level": "Master of Science",
        "Program name": "Master of Science in Marriage & Family Therapy",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Ph.D. in Materials Science and Engineering is an interdisciplinary program designed to equip students with a deep understanding of materials science and engineering principles, preparing them for careers in academia, industry, and national laboratories. This program is housed in the Baylor University School of Engineering and Computer Science (ECS) and is administered through the Materials Science and Engineering program within ECS. It leverages the expertise and research capabilities of faculty from various departments, including Mechanical Engineering, Electrical and Computer Engineering, Physics, Chemistry, and Geosciences.\n\nThe Ph.D. program in Materials Science and Engineering (MSE) is designed to provide students with a comprehensive, interdisciplinary education and research experience in the field of materials. The curriculum is structured to offer a strong foundation in materials science fundamentals, followed by specialized coursework and in-depth research in a chosen area of interest. Students in the program will engage in cutting-edge research projects, working closely with faculty mentors who are leaders in their respective fields. The research-intensive nature of the program aims to develop independent researchers capable of addressing complex challenges in materials science and engineering.\n\nStudents will have access to state-of-the-art research facilities and laboratories, fostering a collaborative and innovative research environment. The program encourages interdisciplinary collaboration, allowing students to work on projects that span multiple scientific and engineering disciplines. Graduates of the Ph.D. program will be well-prepared for careers in academia, industrial research and development, and government laboratories, with the skills and knowledge to make significant contributions to the field of materials science and engineering.",
        "program website url": "https://graduate.baylor.edu/program/materials-science-engineering-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Materials Science & Engineering",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Materials Science and Engineering is a research-based master's degree that prepares students to enter a PhD program or for a career as a research and development engineer. This program is for students who want to develop strong fundamentals in material science through in-depth coursework and a rigorous research experience. The program provides an option to concentrate in a specific area of materials.",
        "program website url": "https://www.ecs.baylor.edu/students-academics/degree-programs/graduate/me",
        "Accreditation status": null,
        "Program name": "Master of Science in Materials Science and Engineering",
        "Program Page url": "https://www.ecs.baylor.edu/students-academics/degree-programs/graduate/me"
    },
    {
        "Concentration name": null,
        "description": "Our department has a thriving and active graduate program leading to both the M.A. and Ph.D. degrees in mathematics. Our aim is to develop mathematicians who are both outstanding researchers and excellent teachers. Our faculty are dedicated to these goals. For our Ph.D. students, our graduate program has a strong track record for placing our graduates in academic positions at a variety of colleges and universities. We are small enough to give our graduate students individual attention, yet large enough to have active research programs in several areas of algebra, analysis, differential equations, mathematical physics, numerical analysis, representation theory and topology.\nThe Department of Mathematics offers a program of study leading to the Doctor of Philosophy degree. The primary goal of the Ph.D. program is to train students to become excellent researchers and teachers of mathematics. Students entering this program will choose an area of research in either pure or applied mathematics and will work closely with a faculty member. The Ph.D. program requires a minimum of 78 hours of graduate work, including at least 48 hours of graduate-level course work and at least 12 hours of dissertation credit. Each student's program of study is designed in conjunction with a faculty advisor.",
        "program website url": "https://math.artsandsciences.baylor.edu/graduate-program",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Mathematics",
        "Program Page url": "https://math.artsandsciences.baylor.edu/graduate-program"
    },
    {
        "Concentration name": [
            "Cybersecurity",
            "Executive Communication",
            "Global Trade and Supply Chain Management"
        ],
        "description": "The Baylor Online MBA is designed for working professionals who desire to earn their MBA from a nationally-acclaimed institution with a distinct mission. The curriculum emphasizes strategic decision-making, leadership, and management with purpose. The Baylor Online MBA provides a rigorous learning experience for students with an average of eight years of work experience. The degree can be completed in as little as 12 months. Our distinguished faculty, challenging curriculum and connected network are just a few of the reasons to choose Baylor for your MBA.",
        "program website url": "https://graduate.baylor.edu/study/business-administration-mba-online",
        "Accreditation status": "The Hankamer School of Business is accredited by AACSB International, the premier accrediting body for business schools. This \"gold standard\" is held by less than five percent of business schools worldwide.",
        "Level": "MBA",
        "Program name": "Master of Business Administration (Online)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": [
            "Business Analytics",
            "Cyber Security",
            "Economics",
            "Entrepreneurship and Corporate Innovation",
            "Finance",
            "Healthcare Administration",
            "Information Systems and Management",
            "International Business",
            "Marketing",
            "Supply Chain Management"
        ],
        "description": "The Baylor MBA full-time program is designed for early-career professionals who want to accelerate their career or pivot to a new one. The 53-hour curriculum can be completed in as few as 16 months and up to 21 months. Students are encouraged to tailor their degree to fit their professional goals with a robust curriculum of elective courses and 10 concentrations from which to choose. Students learn valuable leadership skills in a collaborative, team-based environment and are encouraged to put their knowledge into practice through case studies, client-based projects and consulting opportunities.",
        "program website url": "https://www.baylor.edu/business/mba/",
        "Accreditation status": "Baylor University's Hankamer School of Business is accredited by AACSB International—The Association to Advance Collegiate Schools of Business.",
        "Level": "MBA",
        "Program name": "Master of Business Administration (Waco, Full-Time)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Cyber Security",
        "description": "Baylor’s Online Master of Business Administration (MBA) program is designed for working professionals who want a top-ranked, Christian-focused education that will help them achieve their career goals. We bring our nationally acclaimed MBA program online in a flexible format that allows students to continue their careers while pursuing their degrees. The Baylor Online MBA program provides a rigorous learning experience taught by the same Christian faculty as our on-campus programs. Through our curriculum, you will develop advanced business skills in areas such as accounting, finance, management, and marketing. You will also have the opportunity to concentrate your degree in a specific area of business, including cyber security, executive communication, or marketing.",
        "program website url": "https://online.baylor.edu/programs/mba/",
        "Accreditation status": "Baylor University’s Hankamer School of Business is accredited by AACSB International, which represents the highest standard of achievement for business schools worldwide. Less than 5 percent of the world’s business programs have earned this distinction.",
        "Level": "MBA",
        "Program name": "Master of Business Administration in Cyber Security (Online)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Executive Communication",
        "description": "The Baylor University Online MBA with a concentration in Executive Communication goes beyond theory to focus on practical strategies and techniques for effective corporate communication. Learn from the same distinguished faculty who teach in our on-campus programs. We designed this corporate communication degree with a rigorous curriculum to challenge and prepare you to become a leader of influence in any organization. The Executive Communication concentration within our online MBA program consists of 12 credit hours. You will learn to do the following: Develop communication strategies for internal and external stakeholders. Leverage social media and other technologies in a communication strategy. Use effective communication techniques for crisis management. Lead and communicate change within an organization. Throughout the program, you will learn to apply the necessary communication strategies to successfully navigate corporate settings and guide your organization through any business situation.",
        "program website url": "https://www.baylor.edu/business/online-mba/executive-communication/",
        "Accreditation status": "Baylor's Hankamer School of Business is accredited by AACSB International, which is the most prestigious accreditation for business schools. Less than 5 percent of business schools worldwide have AACSB accreditation, and we are one of the 10 percent of AACSB-accredited schools that also holds a separate accreditation for our accounting program.",
        "Level": "Master",
        "Program name": "Master of Business Administration in Executive Communication (Online)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Global Trade & Supply Chain Management",
        "description": "Baylor's Online MBA in Global Trade and Supply Chain Management prepares students for executive-level roles in the complex and dynamic fields of international commerce and logistics. The program's curriculum emphasizes ethical leadership, data-informed decision making and strategic management. Students in the program develop the knowledge and skills necessary to improve organizational performance through the orchestration of an efficient, agile and adaptable global supply chain.",
        "program website url": "https://www.baylor.edu/business/mba/global-trade-and-supply-chain-management/",
        "Accreditation status": "Baylor University's Hankamer School of Business is accredited by AACSB International (The Association to Advance Collegiate Schools of Business) for business and accounting.",
        "Level": "Masters",
        "Program name": "Master of Business Administration in Global Trade & Supply Chain Management (Online)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Healthcare Administration",
        "description": "The Robbins MBA Healthcare Program prepares leaders to be on the forefront of the healthcare industry. Our nationally-ranked curriculum is uniquely focused on experiential learning and professional development. With a business core curriculum, specialized healthcare classes, a seven-month paid Executive Residency and an administrative fellowship, our students graduate with the skills and confidence to lead a variety of healthcare organizations.",
        "program website url": "https://www.baylor.edu/business/mba/healthcare/",
        "Accreditation status": "The MBA Healthcare Administration program is accredited by the Commission on Accreditation of Healthcare Management Education (CAHME) and the Hankamer School of Business is accredited by the Association to Advance Collegiate Schools of Business (AACSB International).",
        "Program name": "Master of Business Administration in Healthcare Administration",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Marketing",
        "description": "The Baylor Online MBA is designed for working professionals who want a top-ranked, nationally-acclaimed MBA degree from a Tier 1 university with AACSB accreditation. Our online format allows you to earn your MBA in as little as 12 months without career interruption. You will learn from the same Christian faculty who teach in our residential MBA programs and engage in a rigorous, relevant curriculum that builds upon your experience. The supportive, collaborative environment will equip you with the skills needed to lead with integrity and purpose.",
        "program website url": "https://www.baylor.edu/business/mba/online/",
        "Accreditation status": "AACSB International",
        "Program name": "Master of Business Administration in Marketing (Online)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Mechanical Engineering (MSME) degree program offers graduate students an opportunity to strengthen their technical skills for the challenges they will encounter in their professional careers. It also serves as a path to pursuing doctoral studies. The graduate curriculum is flexible to allow a student to design a degree plan that fits their specific research interests. A graduate student can elect to focus their thesis research and coursework in one of three areas:\n\nBiomechanical\nMaterials\nThermal-Fluid Sciences",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-engineering-computer-science/mechanical-engineering/mechanical-engineering-msme/",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Mechanical Engineering",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-engineering-computer-science/mechanical-engineering/mechanical-engineering-msme/"
    },
    {
        "Concentration name": null,
        "description": "The PhD degree in Mechanical Engineering provides students with an opportunity to demonstrate the ability to make a significant and original contribution to the field of mechanical engineering. The primary areas of emphasis are thermofluid sciences, design and manufacturing, and materials science. The program is designed to create a culture of research and discovery and to prepare students for successful careers in industry, research, or academia. Students are encouraged to contact a Mechanical Engineering Graduate Faculty member in their area of interest for more information.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-engineering-computer-science/mechanical-engineering/mechanical-engineering-phd/",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Mechanical Engineering",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-engineering-computer-science/mechanical-engineering/mechanical-engineering-phd/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Medical Science (MSMS) program is a specialized one-year master's program designed to provide students with a broad-based one-year curriculum in the medical sciences while strengthening their credentials for admission into medical school or other health professional programs. The MSMS program emphasizes the development of critical thinking skills, problem solving, and the acquisition of a knowledge base in the foundational medical sciences. The curriculum consists of 36 credit hours of graduate-level coursework taken over a 12-month period. Students take courses alongside the first-year medical students for the majority of the curriculum including Medical Gross Anatomy and Embryology, Medical Physiology, Medical Neuroscience, Medical Biochemistry and Genetics, and Medical Histology and Cell Biology. There are other courses that have been developed exclusively for the MSMS students including Link to Clinical Medicine, Critical Appraisal of the Medical Literature, and Professional Development in the Health Sciences. The program will also offer workshops, advising, and professional development to prepare students to succeed in the rigorous application process to medical school and other health professional programs. The Medical Sciences Program will equip students to be more successful in gaining admission into, and completing, a medical school curriculum.",
        "program website url": "https://graduate.baylor.edu/program/medical-science-ms",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Medical Science",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Museum Studies program offers students an interdisciplinary course of study that combines research, practice, and critical theory. The program focuses on training well-rounded museum professionals who have hands-on experience in a variety of museum settings. Through core coursework and elective seminars, students are trained in the practical and theoretical aspects of museum work. Internships and a thesis or professional project provide practical, real-world experience. Graduates of our program are competitive in the museum job market and are well-prepared for a variety of careers in the field.",
        "program website url": "https://graduate.baylor.edu/study/museum-studies-ma",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Museum Studies",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Music in Music Theory provides advanced study in music theory, analysis, history of theory, Schenkerian analysis, post-tonal theory, and pedagogy of theory. The degree culminates in the writing and defense of a master’s thesis.",
        "program website url": "https://graduate.baylor.edu/program/music-theory-mm",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Music in Music Theory",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Music in Musicology is a research-oriented degree that prepares students for doctoral study and for a variety of other career paths. We offer a comprehensive and rigorous two-year program of study that surveys the history of Western music and its methodologies, culminating in a master’s thesis. Faculty research interests are wide-ranging and include early modern music and culture, German modernism, music and religion, music and politics, and popular music. Students are encouraged to develop their own research interests and pursuits under the guidance of our faculty. All students take a sequence of courses in music history and its research methods, as well as a specified number of electives in music theory or other areas of music that are tailored to the student’s interests and background. In the second year of study, each student writes a thesis on a research topic of their choice. The thesis is a substantial work of scholarship that is written in consultation with a faculty advisor. Recent thesis topics have covered a diverse range of topics, including the music of Hildegard von Bingen, the nineteenth-century reception of J.S. Bach, the player piano in America, sacred music in the films of the Dardenne brothers, and the role of nostalgia in the music of the rock band Radiohead.",
        "program website url": "https://music.baylor.edu/musicology",
        "Accreditation status": "The Baylor University School of Music is a member of the National Association of Schools of Music and the Texas Association of Music Schools. The university is accredited by the Southern Association of Colleges and Schools Commission on Colleges.",
        "Level": "Masters",
        "Program name": "Master of Music in Musicology",
        "Program Page url": "https://music.baylor.edu/musicology"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Doctor of Nursing Practice in Neonatal Nurse Practitioner",
        "Program Page url": "https://nursing.wayne.edu/dnp-neonatal-nurse-practitioner"
    },
    {
        "Concentration name": "Nurse-Midwifery",
        "description": "The online Doctor of Nursing Practice – Nurse-Midwifery (DNP-NM) program, offered through the Baylor University Louise Herrington School of Nursing, prepares registered nurses (BSN or MSN) to become nurse-midwives and leaders in their field. The DNP-NM program focuses on clinical practice, leadership, and evidence-based care for women across their lifespan. Graduates will be prepared to provide care during pregnancy, childbirth, and the postpartum period, as well as gynecologic and primary care to women from adolescence through menopause.\n\nAs a student in the online DNP-NM program, you will learn to:\n\n- Provide full-scope midwifery care, including prenatal, labor and birth, postpartum, and newborn care.\n- Manage common gynecologic and primary health conditions in women.\n- Develop and implement evidence-based practice guidelines to improve patient outcomes.\n- Advocate for policies that promote health equity and access to care for women and families.\n- Lead interprofessional teams to enhance the quality and safety of health care delivery.",
        "program website url": "https://onlinenursing.baylor.edu/programs/dnp-midwifery",
        "Accreditation status": "The Doctor of Nursing Practice degree program at Baylor University Louise Herrington School of Nursing is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).\n\nThe Nurse-Midwifery track is also accredited by the Accreditation Commission for Midwifery Education (ACME), 2000 Duke Street, Suite 300, Alexandria, VA 22314, Tel: (703) 835-4565, support@theacme.org, www.theacme.org.",
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice in Nurse-Midwifery",
        "Program Page url": "https://onlinenursing.baylor.edu/programs/dnp-midwifery"
    },
    {
        "Concentration name": "Thesis, Non-Thesis",
        "description": "The Master of Science (MS) degree in Nutrition Sciences requires the successful completion of 36 hours of graduate coursework, of which 18 hours must be 5000-level courses. The MS degree in Nutrition Sciences has two different tracks: Thesis or Non-Thesis. Both tracks require the same core courses: NTR 5323, NTR 5330, NTR 5340, NTR 5350, and NTR 5360. In addition, students in both tracks take three hours of statistics (STA 5300 or approved substitute), and six hours of supporting coursework. The remaining coursework consists of six hours of thesis for students in the thesis track (NTR 5V99), or six hours of electives for students in the non-thesis track. Thesis track students must orally defend their thesis and non-thesis track students must pass a final oral examination.",
        "program website url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/nutrition-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Nutrition",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/nutrition-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science (MS) in Nutrition Sciences is a research degree that prepares students for careers in research, academia and industry or for doctoral study. The mission of the MS in Nutrition Sciences program is to prepare graduates to translate research into practice to improve health and well-being. This mission is accomplished by emphasizing evidence-based nutrition science, developing skills for critical analysis of nutrition research, and providing opportunities for participation in innovative research.",
        "program website url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/nutrition-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Nutrition Sciences",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/nutrition-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Army-Baylor University Doctor of Science in Occupational Therapy program's mission is to produce highly skilled, autonomous, evidence-based occupational therapists who are prepared to serve as leaders in the United States military health system. We train military officers to be leaders and advanced clinical practitioners in the field of Occupational Therapy. Our graduates are problem solvers, change agents, and skilled in treating the physical, cognitive, and mental health needs of soldiers and their families. Our students gain advanced clinical skills as practitioners with an emphasis on research. The unique mission of the military occupational therapist requires that our students graduate with an advanced clinical skill set. This program provides the training and research skills to ensure that our students meet this requirement.",
        "program website url": "https://graduate.baylor.edu/program/occupational-therapy-army-baylor-dscot",
        "Accreditation status": "The Doctor of Science in Occupational Therapy Program is accredited by the Accreditation Council for Occupational Therapy Education (ACOTE) of the American Occupational Therapy Association (AOTA), located at 6116 Executive Boulevard, Suite 200, North Bethesda, MD 20852-4929. ACOTE's telephone number, c/o AOTA, is (301) 652-AOTA, and its web address is www.acoteonline.org.",
        "Level": "Doctoral",
        "Program name": "Doctor of Science in Occupational Therapy (Army-Baylor)",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Doctor of Occupational Therapy (OTD) is an entry-level doctoral degree program that prepares students to become registered occupational therapists. The Baylor OTD is a full-time, 24-month, hybrid program. The hybrid learning model combines the best of online learning with hands-on immersion labs held on campus in Waco, Texas. Students complete their didactic coursework through an interactive online platform and travel to campus for face-to-face instruction and skills training in the immersion labs. Students also complete Level I and Level II Fieldwork in their local communities and a 14-week Capstone project in an area of interest.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/robbins-college-health-human-sciences/otd/",
        "Accreditation status": "The entry-level occupational therapy doctoral degree program has applied for accreditation and has been granted Candidacy Status by the Accreditation Council for Occupational Therapy Education (ACOTE) of the American Occupational Therapy Association (AOTA), located at 6116 Executive Boulevard, Suite 200, North Bethesda, MD 20852-4929. ACOTE’s telephone number c/o AOTA is (301) 652-AOTA and its Web address is www.acoteonline.org. The program must have a preaccreditation review, complete an on-site evaluation, and be granted Accreditation Status before its graduates will be eligible to sit for the national certification examination for the occupational therapist administered by the National Board for Certification in Occupational Therapy (NBCOT). After successful completion of this exam, the individual will be an Occupational Therapist, Registered (OTR).",
        "Program name": "Doctor of Occupational Therapy",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/robbins-college-health-human-sciences/otd/"
    },
    {
        "Concentration name": null,
        "description": "The Hybrid Teaching Certificate is a 12-credit hour program designed for occupational therapists who desire to gain foundational knowledge and skills in teaching in a hybrid-learning environment. The certificate includes content on learning theories, curriculum design and development, instructional methods and assessment, and innovative teaching technologies. Throughout the program, students will engage in active-learning experiences and assignments focused on applying teaching and learning principles. The certificate culminates with a capstone project in which students work closely with a faculty mentor to design and deliver an instructional module in the hybrid OTD program.",
        "program website url": "https://robbins.baylor.edu/otd/academics/hybrid-teaching-certificate",
        "Accreditation status": null,
        "level": "Certificate",
        "Program name": "Certificate in Occupational Therapy-Hybrid Teaching",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Online Teaching and Learning is an 18-hour graduate certificate that prepares individuals to design, develop, deliver, and manage online learning environments in a variety of contexts, including P-12 schools, higher education, corporate, and military settings. This certificate can be completed as a stand-alone certificate or in conjunction with a graduate degree. The Online Teaching and Learning Certificate does not result in a teaching certification.",
        "program website url": "https://www.baylor.edu/soe/ci/index.php?id=971577",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Online Teaching and Learning",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Orthopaedic Manual Physical Therapy",
        "description": "This nationally ranked Doctor of Science in Physical Therapy (DScPT) program in Orthopaedic Manual Physical Therapy is a 18-month, post-professional degree for licensed physical therapists in the U.S. Military. Students develop into advanced physical therapy practitioners, educators, and researchers, skilled in critical inquiry and evidence-based practice. Graduates are prepared as clinical scientists who can function in academic, research, and clinical settings and are poised to serve as leaders in the Military and in the physical therapy profession. The DScPT curriculum consists of 66 semester hours of didactic and clinical coursework. The first 12 months is primarily didactic instruction and advanced clinical mentorship where students refine their clinical reasoning and manual therapy skills at the Brooke Army Medical Center in San Antonio, Texas. The last 6 months is a clinical fellowship and research dissertation at one of our multiple military sites across the country. DScPT graduates are eligible to sit for the Orthopaedic Clinical Specialist (OCS) examination administered by the American Board of Physical Therapy Specialties and are recognized as a Fellow in the American Academy of Orthopaedic Manual Physical Therapists (FAAOMPT).",
        "program website url": "https://military.robbins.baylor.edu/physical-therapy/orthopaedic-manual-physical-therapy-dscpt",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Science in Physical Therapy (Orthopaedic Physical Therapy - Brooke Army-Baylor)",
        "Program Page url": "https://military.robbins.baylor.edu/physical-therapy/orthopaedic-manual-physical-therapy-dscpt"
    },
    {
        "Concentration name": "higher education, curriculum and instruction, and public policy",
        "description": "The Doctor of Philosophy (PhD) program in P-12 Educational Leadership is designed to prepare highly qualified researchers and practitioners who can become professors, research associates, and leaders in schools, districts, and other educational organizations. The PhD in P-12 Educational Leadership seeks to balance theory and practice through a rigorous curriculum that includes cognate concentrations in areas such as higher education, curriculum and instruction, and public policy, as well as a rich apprenticeship. The degree requires a minimum of 60 semester hours beyond the master's degree and requires a dissertation.",
        "program website url": "https://www.baylor.edu/soe/edl/index.php?id=971350",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in P-12 Educational Leadership",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "ACPC-PNP Dual-Track",
        "description": "The Acute Care Pediatric Nurse Practitioner (ACPNP) and Primary Care Pediatric Nurse Practitioner (PNP) dual track is designed for nurses who hold a baccalaureate degree in nursing and who wish to continue their education to the doctoral level. The dual track focuses on the care of children from birth through young adulthood with an emphasis on complex, chronic, acute, and critical pediatric illness. The PNP track also focuses on health promotion and health maintenance of infants and children. With this dual preparation, graduates will be eligible to take both the Acute Care CPNP exam and the Primary Care CPNP exam offered by the Pediatric Nursing Certification Board. Upon completion of the DNP program graduates are prepared for leadership roles to improve health outcomes of individuals and populations and to transform practice.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/louise-herrington-school-nursing/doctor-nursing-practice-dnp/acpc-pnp-dual-track-bsn-dnp-degree/",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice in Pediatric Nurse Practitioner",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/louise-herrington-school-nursing/doctor-nursing-practice-dnp/acpc-pnp-dual-track-bsn-dnp-degree/"
    },
    {
        "Concentration name": "piano, organ, voice, collaborative piano, and orchestral instruments (violin, viola, cello, double bass, flute, oboe, clarinet, bassoon, horn, trumpet, trombone, tuba, percussion, and harp)",
        "description": "The Master of Music in Performance is offered with concentrations in piano, organ, voice, collaborative piano, and orchestral instruments (violin, viola, cello, double bass, flute, oboe, clarinet, bassoon, horn, trumpet, trombone, tuba, percussion, and harp). The degree normally requires four semesters of study, during which time the student must be enrolled for a minimum of 12 semester hours of credit during each of the first three semesters and for a minimum of one hour of credit for the final semester. The program of study includes private instruction in the major performance area, classes in music history and music theory, pedagogy courses, music electives, and large ensembles. The degree culminates in the presentation of a solo recital.",
        "program website url": "https://www.baylor.edu/music/index.php?id=973273",
        "Accreditation status": "The Baylor University School of Music is a member of the National Association of Schools of Music and the Texas Association of Music Schools.",
        "Level": "Masters",
        "Program name": "Master of Music in Performance",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "Baylor's Ph.D. program in philosophy is a small, select program that prepares students for careers as professional philosophers. The Ph.D. program provides students with rigorous training for research and teaching in philosophy, with special emphasis on philosophy in the Christian tradition. The program is designed to be completed in five years. Students take twelve seminars over their first three years, three in each of the four main areas of the discipline: (1) History of Philosophy, (2) Metaphysics and Epistemology, (3) Value Theory, and (4) Special Topics (Logic, Philosophy of Religion, etc.). After their coursework is completed, students must pass two comprehensive exams and write a dissertation. Generous funding packages are available for all admitted students, including full-tuition remission and an annual stipend (currently $23,000). For more information, please visit the Graduate School page or contact the Director of Graduate Studies.",
        "program website url": "https://philosophy.artsandsciences.baylor.edu/programs/graduate-programs/phd-philosophy",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Philosophy",
        "Program Page url": "https://philosophy.artsandsciences.baylor.edu/programs/graduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Baylor University Doctor of Physical Therapy program is a two-year, hybrid-accelerated DPT program. Our program blends the best of online and hands-on learning. The Baylor DPT program spans 24 months (6 semesters) and includes 31 weeks of full-time clinical education experience. We prepare our graduates to be leaders and innovators in the profession, well-prepared for autonomous practice. Our innovative curriculum is designed to facilitate student learning and clinical reasoning through a case-based and evidence-based approach to teaching. Students engage in courses online and then travel to campus for intensive, hands-on lab immersion sessions. The DPT program is housed in the Robbins College of Health and Human Sciences.",
        "program website url": "https://www.baylor.edu/dpt/",
        "Accreditation status": "The Doctor of Physical Therapy Program at Baylor University is accredited by the Commission on Accreditation in Physical Therapy Education (CAPTE), 3030 Potomac Ave., Suite 100, Alexandria, Virginia 22305-3085; telephone: 703-706-3245; email: accreditation@apta.org; website: http://www.capteonline.org. If needing to contact the program/institution directly, please call 254-710-3111 or email DPTadmissions@baylor.edu.",
        "Level": "Doctoral",
        "Program name": "Doctor of Physical Therapy",
        "Program Page url": "https://ptcasdirectory.apta.org/357/Baylor-University"
    },
    {
        "Concentration name": null,
        "description": "The U.S. Army-Baylor University Doctoral Program in Physical Therapy is a top-ranked program that has been producing leaders in the field of physical therapy for over 50 years. Our graduates are problem-solvers who are dedicated to serving their country and their communities as members of the Armed Forces. They are prepared to provide evidence-based care in a variety of settings, from combat zones to hospitals and clinics. The Army-Baylor DPT program is a unique blend of academic rigor, clinical experience, and military training. Our students are challenged to think critically and creatively, and to develop the skills and knowledge they need to be successful in their careers. They are also taught the importance of teamwork, leadership, and service. We believe that our graduates are the future of physical therapy, and we are proud to play a role in shaping their development. If you are looking for a challenging and rewarding career, we encourage you to consider the U.S. Army-Baylor University Doctoral Program in Physical Therapy.",
        "program website url": "https://www.baylor.edu/dpt",
        "Accreditation status": "The U.S. Army-Baylor University Doctor of Physical Therapy Program at Baylor University is accredited by the Commission on Accreditation in Physical Therapy Education (CAPTE), 3030 Potomac Ave., Suite 100, Alexandria, Virginia 22305-3085; telephone: 703-706-3245; email: accreditation@apta.org; website: http://www.capteonline.org. If needing to contact the program/institution directly, please call 210-221-6456 or email usarmy.jbsa.medical-coe.mbx.dpt-program@health.mil.",
        "Program name": "Doctor of Physical Therapy (Army-Baylor)",
        "Program Page url": "https://ptcasdirectory.apta.org/353/ArmyBaylor-University"
    },
    {
        "Concentration name": null,
        "description": "The U.S. Army-Baylor University Master of Physician Assistant Studies (MPAS) degree program is a 29-month graduate program that consists of a 16-month didactic phase and a 13-month clinical phase. The didactic curriculum is an organ-system based, spiraling curriculum that emphasizes active and collaborative learning. Courses in the basic sciences, clinical medicine, and professional development are integrated in a manner that requires students to apply knowledge of the basic sciences to clinical situations. Throughout the didactic phase, small group learning, case-based learning, simulation, and hands-on laboratory experiences in anatomy, clinical skills, and emergency medicine procedures prepare students for entry into the clinical phase of the program. During the 13-month clinical phase, students complete 10 core clinical rotations and 3 elective rotations at one of several Army, Navy, or Air Force Medical Treatment Facilities. The program curriculum is designed to provide students with the knowledge and skills necessary for the development of a competent, compassionate Physician Assistant who is prepared for clinical practice in any setting and in any specialty.",
        "program website url": "https://military.robbins.baylor.edu/pa-program",
        "Accreditation status": "The Accreditation Review Commission on Education for the Physician Assistant, Inc. (ARC-PA) has granted Accreditation-Continued status to the Interservice Physician Assistant Program sponsored by the Army Medical Center of Excellence. Accreditation-Continued is an accreditation status granted when a currently accredited program is in compliance with the ARC-PA Standards. Accreditation remains in effect until the program closes or withdraws from the accreditation process or until accreditation is withdrawn for failure to comply with the Standards. The approximate date for the next validation review of the program by the ARC-PA will be March 2029. The review date is contingent upon continued compliance with the Accreditation Standards and ARC-PA policy.",
        "Program name": "Physician Assistant Studies (Army-Baylor)",
        "Program Page url": "https://military.robbins.baylor.edu/"
    },
    {
        "Concentration name": null,
        "description": "The Baylor University Physician Assistant Program will prepare graduates to serve as physician assistants. Housed in the Robbins College of Health and Human Sciences, the program is a full-time, 28-month curriculum leading to the Master of Physician Assistant Studies degree. The program is designed to provide a broad-based medical education that will enable graduates to provide patient care in a wide range of medical settings and specialties. The program emphasizes the acquisition of knowledge and the development of clinical skills and acumen necessary to function as a competent health care provider.",
        "program website url": "https://www.baylor.edu/physicianassistant/",
        "Accreditation status": "The ARC-PA has granted Accreditation-Provisional status to the Baylor University Physician Assistant Program sponsored by Baylor University.\n\nAccreditation-Provisional is an accreditation status granted when the plans and resource allocation, if fully implemented as planned, of a proposed program that has not yet enrolled students appear to demonstrate the program’s ability to meet the ARC-PA Standards or when a program holding Accreditation-Provisional status appears to demonstrate continued progress in complying with the Standards as it prepares for the graduation of the first class (cohort) of students.\n\nAccreditation-Provisional does not ensure any subsequent accreditation status. It is limited to no more than five years from matriculation of the first class.\n\nThe program’s accreditation history can be viewed on the ARC-PA website at http://www.arc-pa.org/accreditation-history-baylor-university/.",
        "Level": "Masters",
        "Program name": "Master of Physician Assistant Studies",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "Welcome to Graduate Studies in Physics at Baylor! The Baylor University Department of Physics offers M.S. and Ph.D. degrees. The department is a vibrant, exciting, and friendly place to pursue graduate work. It is also an integral component of the research mission of Baylor University. The graduate physics program at Baylor is designed to provide students with a strong background in both experimental and theoretical physics through formal course work and research. After completing a core curriculum that provides a solid foundation in the fundamental areas of physics, students specialize in a particular subfield and become deeply involved in state-of-the-art research.",
        "program website url": "https://physics.artsandsciences.baylor.edu/graduate/phd-physics",
        "Accreditation status": null,
        "Program name": "PhD in Physics & Astronomy",
        "Program Page url": "https://physics.artsandsciences.baylor.edu/news"
    },
    {
        "Concentration name": null,
        "description": "The Department of Physics offers graduate work leading to the Master of Arts, Master of Science, and Doctor of Philosophy degrees. Graduate study and research opportunities are available in atomic and molecular physics, astrophysics and space physics, condensed matter and materials physics, gravitation and cosmology, nuclear and particle physics, and physics education. Opportunities for interdisciplinary research also exist.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/physics/physics-ma-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Physics",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/college-arts-sciences/physics/physics-ma-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Music degree in piano pedagogy and performance is an innovative program that offers a unique course of study for the aspiring piano teacher. The degree track provides a balance between pedagogical training, performance studies, and music scholarship. It is designed to prepare graduates to be effective and successful studio teachers as well as be qualified to pursue a doctoral degree. Students in the program develop their skills as artists and teachers through applied lessons and recitals, pedagogy courses, and a supervised teaching internship in the Baylor Piano Laboratory Program. They also gain additional teaching experience in group and individual settings with children and university-level students. Assistantships are available in both piano and piano pedagogy. Many of our recent graduates have gone on to doctoral programs at prestigious music schools and have also established successful independent piano studios.",
        "program website url": "https://music.baylor.edu/pianopedagogy",
        "Accreditation status": "Baylor University is an accredited institutional member of the National Association of Schools of Music. The undergraduate and graduate curricula for the School of Music have been approved by NASM.",
        "Level": "Master of Music",
        "Program name": "Master of Music in Piano Pedagogy and Performance",
        "Program Page url": "https://music.baylor.edu/pianopedagogy"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "PhD in Political Science",
        "Program Page url": "https://www.ceu.edu/academics/degrees/phd-political-science"
    },
    {
        "Concentration name": null,
        "description": "The Doctor of Philosophy (PhD) in Preaching is an advanced academic degree designed for the development of teacher-scholars in the field of homiletics. It seeks to form students for vocations of research, scholarship, and teaching in universities, theological seminaries, and divinity schools and for the equipping of church leaders. At the same time, because preaching is an ecclesial and theological practice as well as an academic discipline, the program aims to promote research that enriches the practice of preaching in the church. The Doctor of Philosophy (PhD) in Preaching is offered by Baylor University's Graduate School and is delivered by the faculty of George W. Truett Theological Seminary. Upon successful completion of the program, the degree is conferred by Baylor University.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/george-w-truett-theological-seminary/preaching-phd/",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Preaching",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/george-w-truett-theological-seminary/preaching-phd/"
    },
    {
        "Concentration name": "Psychiatric Mental Health Nurse Practitioner",
        "description": "The Baylor University Louise Herrington School of Nursing Doctor of Nursing Practice (DNP) program is a practice-focused doctoral program. This program is designed for nurses who have a bachelor's or master's degree and want to become a Psychiatric Mental Health Nurse Practitioner (PMHNP). The post-master's DNP program is offered online. It can be completed in approximately two years on a full-time basis and three years on a part-time basis. The BSN to DNP option is also available in an online format. Full-time students typically complete this option in four years and part-time students can do so in five years.",
        "program website url": "https://graduate.baylor.edu/program/nursing-practice-dnp-psychiatric-mental-health-nurse-practitioner",
        "Accreditation status": "The Doctor of Nursing Practice degree program at Baylor University is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Doctor of Nursing Practice in Psychiatric Mental Health Nurse Practitioner",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": [
            "Behavioral Neuroscience",
            "Social Psychology",
            "General Experimental Psychology"
        ],
        "description": "The Department of Psychology and Neuroscience at Baylor University offers a Ph.D. in Psychology with four areas of specialization: Behavioral Neuroscience, Social Psychology, General Experimental Psychology, and Clinical Psychology (Psy.D.). We offer a research-intensive program designed to prepare students for careers in research and teaching in a variety of settings (e.g., academic, industrial, governmental). Although a student’s interests typically fall within one of the primary areas of research, all graduate students develop a strong general background in psychology that is reflected in the Ph.D. in Psychology. We strive for a student-faculty ratio (typically 2:1) that is optimal for providing individualized instruction in small classes, seminars, and research laboratories. As a result, admission to our program is highly competitive. During the most recent admissions cycle we admitted 12 new Ph.D. students and 12 new Psy.D. students. All doctoral students who are in good academic standing are supported by a full tuition waiver and a competitive stipend for five years. More than half of our doctoral students are also supported by a prestigious University Graduate Fellowship. Students pursuing the Ph.D. may specialize in Behavioral Neuroscience, Social Psychology, or General Experimental Psychology.",
        "program website url": "https://psychologyneuroscience.artsandsciences.baylor.edu/graduate/graduate-program-psychology",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Psychology and Neuroscience",
        "Program Page url": "https://psychologyneuroscience.artsandsciences.baylor.edu/graduate/graduate-program-psychology"
    },
    {
        "Concentration name": "Community Health Science, Environmental Health Science, Epidemiology, Global Health, Physical Activity & Nutrition",
        "description": "The Baylor University Master of Public Health (MPH) degree program in the Robbins College of Health and Human Sciences provides a Christ-centered environment to prepare culturally competent, ethical public health professionals for careers in a variety of sectors. With a focus on strategies to prevent disease and promote health and well-being in diverse populations, our curriculum is practice-based and provides students with opportunities to apply what they learn in the classroom to real-world settings. Baylor’s MPH program is small by design, which creates a low student-to-faculty ratio and ensures a highly relational and personalized learning experience. Students receive individualized attention from nationally- and internationally-recognized faculty who are committed to student success. Opportunities abound for students to engage in ongoing faculty research and to participate in public health initiatives both locally and globally. The MPH program has a strong sense of community and provides a supportive learning environment for all students.",
        "program website url": "https://www.baylor.edu/publichealth/index.php?id=971358",
        "Accreditation status": "The Baylor University Public Health Program is accredited by the Council on Education for Public Health (CEPH). Our initial accreditation was awarded for a five-year term, extending to July 1, 2023. The Program submitted a self-study in 2022 and had a site visit in fall 2022. The Program has been recommended for re-accreditation for a seven-year term, extending to July 1, 2030.",
        "Level": "Masters",
        "Program name": "Master of Public Health",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Security Studies, Public Health, World Affairs, Local Government, Non-Profit Management",
        "description": "Baylor's Master of Public Policy and Administration (MPPA) program, offered through the Department of Political Science in the College of Arts and Sciences, equips students to serve in the public or non-profit sectors. Our curriculum provides students with a strong foundation of knowledge about the public policy process as well as the analytical skills necessary to be an effective public manager. Students in our program frequently get to work on real-world policy and administrative problems for public and non-profit organizations. Students gain practical experience through an internship in the public or nonprofit sectors.",
        "program website url": "https://www.baylor.edu/politicalscience/index.php?id=97135",
        "Accreditation status": null,
        "Program name": "Master of Public Policy and Administration",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science (MS) program in School Psychology is designed for students who want to become a Licensed Specialist in School Psychology (LSSP). Students must complete the Master of Science (MS) and the Education Specialist (EdS) degrees in order to be eligible for LSSP licensure.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-education/educational-psychology/school-psychology-ms/",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in School Psychology",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/school-education/educational-psychology/school-psychology-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science degree in Sport Pedagology is a 36-hour program designed to enhance the knowledge base of teachers and coaches in the various aspects of physical education and athletic coaching. Baylor's Sport Pedagogy program is committed to developing leaders in the field and promoting a physically active lifestyle for all individuals. The degree plan has both a thesis and non-thesis option and is individualized to meet the specific career goals of each student. The degree can typically be completed in one and a half to two years. The purpose of this degree is to prepare individuals for careers in teaching and coaching at the elementary, secondary, and junior college level. The program may also provide the foundation for students who plan to continue their education at the doctoral level.",
        "program website url": "https://www.baylor.edu/hhpr/index.php?id=973783",
        "Accreditation status": null,
        "Program name": "Master of Science in Sport Pedagogy",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The School of Education and George W. Truett Theological Seminary offer a joint degree program leading to the Master of Arts (M.A.) in Curriculum and Instruction and the Master of Divinity (M.Div.). Students complete the requirements for both degrees in a shortened time frame. The purpose of the joint degree program is to prepare persons for a variety of leadership roles in church and educational settings. Persons holding both degrees might serve in such roles as ministers of education in churches, leaders of denominational agencies, curriculum writers, or college teachers in church-related colleges. The total number of hours required for the joint degree is 99, 63 in the seminary and 36 in the School of Education. The 36 hours in Curriculum and Instruction constitute the Master of Arts degree.",
        "program website url": "https://catalog.baylor.edu/graduate-school/school-education/curriculum-instruction/master-arts-curriculum-instruction-master-divinity/",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Arts (Curriculum and Instruction)/Master of Divinity Joint Degree",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/general-information/degrees-offered/"
    },
    {
        "Concentration name": null,
        "description": "The joint JD/MBA degree program allows a student to obtain both a Juris Doctor from Baylor Law and a Master of Business Administration from Baylor’s Hankamer School of Business. By pursuing the joint degree, the total time and course work for the two degrees can be significantly reduced. For students interested in careers that merge law and business, the JD/MBA joint degree provides valuable training in both disciplines and an excellent foundation for careers in business law or executive leadership.",
        "program website url": "https://law.baylor.edu/why-baylor-law/academics/business-and-transactional-law/transactional-dual-degree-programs",
        "Accreditation status": null,
        "Program name": "Master of Business Administration/Juris Doctor Joint Degree",
        "Program Page url": "https://law.baylor.edu/why-baylor-law/academics/business-and-transactional-law/transactional-dual-degree-programs"
    },
    {
        "Concentration name": null,
        "description": "The MBA/MDiv is a joint degree program of the Hankamer School of Business and the George W. Truett Theological Seminary. Students in the joint program earn two separate degrees: a Master of Business Administration and a Master of Divinity. This program provides an opportunity for students to gain the skills needed to engage in various forms of ministry that require business acumen, including non-profit management and minister of administration/executive pastor roles in larger churches. Similarly, students looking to enter the corporate world can gain a theologically-informed ethical and social perspective through Truett Seminary's MDiv curriculum.",
        "program website url": "https://www.baylor.edu/business/mba/index.php?id=973972",
        "Accreditation status": "Baylor's MBA program is accredited by the Association to Advance Collegiate Schools of Business (AACSB), and Truett Seminary is accredited by the Association of Theological Schools (ATS).",
        "Program name": "Master of Business Administration/Master of Divinity Joint Degree",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Hankamer School of Business and the School of Engineering and Computer Science offer a joint degree program leading to the Master of Business Administration (MBA) and the Master of Engineering (ME) degrees. This joint degree program provides a unique opportunity for individuals with undergraduate degrees in engineering, computer science, or other related technical fields to develop both their technical skills and business acumen to prepare them for leadership positions in technology-based organizations.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/hankamer-school-business/joint-master-business-administration-master-engineering/",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Business Administration/Master of Engineering Joint Degree",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/hankamer-school-business/joint-master-business-administration-master-engineering/"
    },
    {
        "Concentration name": null,
        "description": "The MBA/MSBA Joint Degree is a graduate-level program that merges the comprehensive business education of the Master of Business Administration (MBA) with the specialized data analytics expertise of the Master of Science in Business Analytics (MSBA). This integrated curriculum is designed to equip students with a unique and powerful combination of skills, preparing them for leadership roles in a data-driven world. This joint degree is an efficient and cost-effective way to get two advanced degrees in a shorter period of time. You'll gain a strong foundation in business disciplines through the Baylor MBA and MSBA curricula.",
        "program website url": "https://graduate.baylor.edu/program/business-administration-business-analytics-joint-degreemba-msba",
        "Accreditation status": "The Hankamer School of Business is accredited by AACSB International—the Association to Advance Collegiate Schools of Business.",
        "level": "Masters",
        "Program name": "Master of Business Administration/Master of Science in Business Analytics Joint Degree",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The MBA/MSIS joint degree is a 64-credit hour program that prepares students for the challenges of managing in an increasingly technological business environment. Students take MBA core classes that provide a solid business foundation and MSIS core classes that develop specialized technical expertise. This combination of business and IT skills makes our graduates highly marketable.",
        "program website url": "https://www.baylor.edu/business/mba/index.php?id=973752",
        "Accreditation status": "AACSB International",
        "Level": "Masters",
        "Program name": "Master of Business Administration/Master of Science in Information Systems Joint Degree",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The Hankamer School of Business and the Diana R. Garland School of Social Work jointly offer a program in which a student can obtain both an MBA and an MSW degree. The joint degree program prepares students to become managers and leaders in various businesses and social service agencies that may be for profit, nonprofit, or governmental.",
        "program website url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/hankamer-school-business/joint-master-business-administration-master-social-work/",
        "Accreditation status": null,
        "Program name": "Master of Business Administration/Master of Social Work Joint Degree",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/curriculum-departments-institutes-instruction/hankamer-school-business/joint-master-business-administration-master-social-work/"
    },
    {
        "Concentration name": null,
        "description": "The joint Master of Music in Church Music and Master of Divinity degree is a cooperative program of the School of Music and George W. Truett Theological Seminary. This degree program allows the student to combine the Master of Music degree in Church Music with the Master of Divinity degree. The purpose of the joint degree is to equip students for ministry in which music and the pastoral arts are combined. Graduates of this program will be equipped for a variety of leadership positions in Christian churches and other ministry contexts.",
        "program website url": "https://graduate.baylor.edu/program/church-music-mm-div",
        "Accreditation status": "The School of Music is an accredited member of the National Association of Schools of Music (NASM). The George W. Truett Theological Seminary is accredited by the Association of Theological Schools in the United States and Canada (ATS).",
        "Level": "Masters",
        "Program name": "Master of Music (Church Music)/Master of Divinity Joint Degree",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "Baylor University offers a Juris Doctor (JD) and Master of Public Policy and Administration (MPPA) joint degree program that allows a student to complete both degrees in a shorter amount of time than would be required to complete them separately. The joint degree program gives students the opportunity to gain a deeper understanding of the political system at the local, state, national and international levels and to prepare for a career in public service. Students take courses in the School of Law and the Graduate School at Baylor University and receive two separate degrees.",
        "program website url": "https://politicalscience.artsandsciences.baylor.edu/graduate-programs/joint-jdma-public-policy-and-administration",
        "Accreditation status": null,
        "Program name": "Master of Public Policy and Administration/Juris Doctor Joint Degree",
        "Program Page url": "https://politicalscience.artsandsciences.baylor.edu/graduate-programs/joint-jdma-public-policy-and-administration"
    },
    {
        "Concentration name": null,
        "description": "This joint degree provides students with an integrated program of study leading to the Master of Divinity and the Master of Science in Education degrees. It is for those who are preparing for ministry and educational leadership in the church as well as in Christian schools. Students receive professional training from both the School of Education and George W. Truett Theological Seminary. This joint degree is designed for those who have been called to specialized ministry and sense the need for comprehensive training in both theological studies and education. It requires completion of coursework in both areas, with a minimum of 24 semester hours in the School of Education (EDP, TED, or EDL courses), in addition to required coursework for the MDiv.",
        "program website url": "https://graduate.baylor.edu/program/curriculum-instruction-msed-mdiv",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Education (Curriculum and Instruction)/Master of Divinity Joint Degree",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": null,
        "description": "The joint Master of Taxation/Juris Doctor degree is a three-year program sponsored by the Law School and the Hankamer School of Business. It is designed to produce a lawyer who also has an in-depth knowledge of taxation. In the current job market, this combination provides a distinct competitive advantage for a law school graduate. Typically, a graduate will seek employment as an associate in a law firm or with a \"Big Four\" or smaller accounting firm. As an MTAX/JD student, you will enroll in the School of Law and concurrently pursue the MTAX degree. To complete the MTAX portion of the joint degree, you must be admitted into the MTAX program, complete all undergraduate prerequisite courses required for the MTAX degree, and take five graduate tax courses at the Hankamer School of Business.",
        "program website url": "https://graduate.baylor.edu/program/taxation-juris-doctor-mtaxjd",
        "Accreditation status": null,
        "Level": "Masters, Doctoral",
        "Program name": "Master of Taxation/Juris Doctor Joint Degree",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Elementary Education (Grades EC-6), Middle Grades (Grades 4-8), Secondary Education (Grades 7-12), All-Level (Grades EC-12)",
        "description": "Baylor’s Master of Arts in Teaching (MAT) is a full-time, one-year master’s degree program that prepares individuals for initial teacher certification in a variety of fields and levels. The MAT program is an ideal option for recent college graduates who have a bachelor’s degree in a field other than education and who want to become a certified teacher. The program is specifically designed to prepare highly qualified individuals who have both deep content knowledge and a commitment to making a difference in the lives of children. The MAT program is unique in its focus on intensive, school-based experiences combined with rigorous graduate coursework. Throughout the program, MAT candidates are immersed in local schools and work alongside experienced mentor teachers. A full-year, supervised clinical experience provides MAT candidates with extensive opportunities to apply the knowledge and skills they are learning in their coursework.",
        "program website url": "https://ci.soe.baylor.edu/graduate-programs/ma-teaching-mat/",
        "Accreditation status": "The Baylor University School of Education is accredited by the Texas Education Agency (TEA) and is a member in good standing of the American Association of Colleges for Teacher Education (AACTE). Baylor SOE programs are currently in the process of seeking accreditation from the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Masters",
        "Program name": "Master of Arts in Teaching",
        "Program Page url": "https://ci.soe.baylor.edu/graduate-programs/ma-teaching-mat/admissions-master-arts-teaching"
    },
    {
        "Concentration name": null,
        "description": "The MTax degree is a specialized program designed to prepare students for a career in taxation. The curriculum emphasizes a conceptual understanding of taxation as well as the development of technical and research skills. The program satisfies the 150-hour requirement to become a CPA.",
        "program website url": "https://hankamer.baylor.edu/macc",
        "Accreditation status": "The Baylor accounting programs are separately accredited by the AACSB, a distinction held by less than two percent of business schools worldwide.",
        "Level": "Masters",
        "Program name": "Master of Taxation",
        "Program Page url": "https://hankamer.baylor.edu/macc/degree-plan"
    },
    {
        "Concentration name": "Emergency Medicine",
        "description": "The Baylor University Doctor of Science in Physician Assistant Studies (DScPA) is a 12-month program with an emphasis in Emergency Medicine that is designed for the experienced, board-certified Physician Assistant who is seeking to enhance their knowledge base, skills, and professional stature. The hybrid educational format, 60-semester hour curriculum, combines distributed learning with four, one-week, on-campus immersive experiences that include work in Baylor University's state-of-the-art simulation lab. Didactic content focuses on advanced medical concepts while the clinical component provides PAs with extensive, hands-on experience in one of our many emergency medicine partner sites. The DScPA faculty are all experienced PAs who are dedicated to training the next generation of PA leaders. The DScPA curriculum has a three-fold purpose of enhancing the PA’s fund of knowledge, honing their skills, and developing a professional growth plan that prepares PAs for a lifetime of leadership and service.",
        "program website url": "https://graduate.baylor.edu/program/physician-assistant-studies-dsc",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Science in Physician Assistant Studies with an emphasis in Emergency Medicine",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "Orthopaedics",
        "description": "The Baylor University Doctor of Science in Physician Assistant Studies (DScPAS) is a 65-semester hour program designed for the experienced, board-certified Physician Assistant who wishes to grow in their clinical and professional skills, with an emphasis in either Emergency Medicine or Orthopaedics. The program is offered in a hybrid format, allowing PAs to continue working while pursuing this advanced degree.\n\nThe Baylor University DScPAS program will be a leader in Physician Assistant graduate education by building on the foundation of the U.S. Military’s highly successful DScPA programs and the excellence in graduate education for which Baylor is nationally recognized. Our curriculum is designed to produce graduates who are prepared to be leaders in the PA profession through an emphasis on scholarship and service.\n\nThe program consists of didactic courses offered in an online format and a variety of supervised clinical practice experiences. Students are also required to travel to the Baylor University campus in Waco, Texas for two, one-week sessions to learn hands-on skills such as advanced procedures and point-of-care ultrasound.\n\nGraduates of the Baylor University DScPAS program will use their advanced knowledge and skills to improve the quality and accessibility of patient care, advance the PA profession, and serve their communities.",
        "program website url": "https://graduate.baylor.edu/program/physician_assistant_dsc",
        "Accreditation status": "The ARC-PA has granted Accreditation-Continued status to the Baylor University Physician Assistant Program sponsored by Baylor University. Accreditation-Continued is an accreditation status granted when a currently accredited program is in compliance with the ARC-PA Standards.\n\nAccreditation remains in effect until the program closes or withdraws from the accreditation process or until accreditation is withdrawn for failure to comply with the Standards. The approximate date for the next validation review of the program by the ARC-PA will be June 2028. The review date is contingent upon continued compliance with the Accreditation Standards and ARC-PA policy.",
        "Level": "Doctoral",
        "Program name": "Doctor of Science in Physician Assistant Studies with an emphasis in Orthopaedics",
        "Program Page url": "https://graduate.baylor.edu/programs"
    },
    {
        "Concentration name": "General Surgery",
        "description": "The Army Medical Department Center and School (AMEDDC&S) offers a Doctor of Science in Physician Assistant Studies (DScPAS) with an emphasis in General Surgery through the Graduate School at Baylor University. The program is fully accredited by the Accreditation Review Commission on Education for the Physician Assistant (ARC-PA). The 12-month program provides PAs with a robust didactic education and a concentrated clinical experience in general surgery. The goal of the program is to produce graduates with the necessary knowledge and skills to manage patients with complex surgical and critical illness. Upon successful completion of the program, the graduate will serve as a subject matter expert in general surgery and be fully capable of independent practice in a variety of settings.",
        "program website url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/physician-assistant/surgery-criticalcare/surgery-criticalcare.pdf",
        "Accreditation status": "The program is fully accredited by the Accreditation Review Commission on Education for the Physician Assistant (ARC-PA).",
        "Level": "Doctor of Science",
        "Program name": "Doctor of Science in Physician Assistant Studies with an emphasis in General Surgery",
        "Program Page url": "https://catalog.baylor.edu/graduate-school/affiliated-programs/physician-assistant/surgery-criticalcare/surgery-criticalcare.pdf"
    }
]