[
    {
        "Concentration name": null,
        "description": "The program of study for the Bachelor of Science in Accountancy prepares students for careers as professional accountants in public practice, industry, government, and not-for-profit organizations. It also serves as preparation for graduate study in accountancy or business, and to satisfy the educational requirements for professional certifications such as the Certified Public Accountant (CPA), Certified Management Accountant (CMA), and Certified Internal Auditor (CIA). The program has been continuously accredited by the AACSB International for both accounting and business programs since 1965, a distinction held by fewer than 2% of the world’s accounting programs.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/accountancy/accounting-bs/accounting-bs.pdf",
        "Accreditation status": "Accredited by the AACSB International for both accounting and business programs since 1965.",
        "Program name": "Bachelor of Science in Accounting",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/accountancy/accounting-bs/accounting-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "This bachelor's program is for students interested in careers that involve the application of mathematical and statistical methods to assess risk in the insurance and finance industries. This program will give you a solid theoretical foundation and extensive practical applications. Our program focuses on all the major components of the actuarial exams required by the Society of Actuaries and the Casualty Actuarial Society. Graduates of the program are well prepared for the job market and for graduate studies.",
        "program website url": "https://www.uakron.edu/academics_majors/academics/actuarial-science-statistics",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Actuarial Science, Statistics",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Adolescent to Young Adult (AYA) program prepares students to teach grades 7-12 in a content-specific area. Students pursuing an AYA license will choose one of the following content areas: Integrated Language Arts, Integrated Mathematics, Integrated Science, Integrated Social Studies, Teaching English to Speakers of Other Languages (TESOL), or World Language (French, German, Spanish).\nAs an AYA student, you’ll engage in a robust curriculum focused on content knowledge, pedagogical skills, and practical experience. You’ll have opportunities to observe and teach in diverse classroom settings, working with experienced mentor teachers. The program culminates in a full semester of student teaching, providing invaluable hands-on experience and preparing you for successful entry into the teaching profession. Graduates of the AYA program are eligible to apply for an Ohio teaching license in their chosen content area.",
        "program website url": "https://www.uakron.edu/education/teacher-ed/undergraduate/AYA/index.dot",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Adolescent to Young Adult (AYA)",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Students are provided with a strong background in analytical sciences and engineering fundamentals with a focus on aerospace applications. This program places emphasis on the design, analysis, and operation of complex aerospace systems, including aircraft, spacecraft, and unmanned aerial vehicles. Students will gain expertise in aerodynamics, flight mechanics, propulsion, structures, materials, control systems, and aerospace system integration. The curriculum emphasizes hands-on learning through laboratory experiences, design projects, and research opportunities, preparing graduates for a wide range of careers in the aerospace industry or for further graduate studies.",
        "program website url": "https://www.uakron.edu/engineering/me/undergraduate/aerospace-systems",
        "Accreditation status": "Our program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Aerospace Systems Engineering",
        "Program Page url": "https://www.uakron.edu/engineering/me/undergraduate/aerospace-systems"
    },
    {
        "Concentration name": null,
        "description": "The online Bachelor of Science (B.S.) in Allied Health Care Administration is designed for healthcare professionals who want to advance their career in leadership and management positions. This program offers a unique pathway for individuals with an associate’s degree in a health-related field to earn their bachelor’s degree fully online. Students gain essential skills in organizational leadership, human resource management, financial management, healthcare law and ethics, and strategic planning, all crucial for effective administration in various healthcare settings. The Bachelor of Science in Allied Health Care Administration program is an online degree completion program that provides career advancement opportunities for health care professionals. Students with an associate's degree or its equivalent in a health-related field may pursue this online bachelor's degree program. It prepares students for a variety of roles within hospitals, clinics, long-term care facilities, and public health organizations. The curriculum focuses on developing skills in leadership, financial management, human resources, healthcare law, and strategic planning, essential for administrative and management positions. Graduates are equipped to navigate the complexities of the healthcare industry, implement effective solutions, and lead teams towards improved patient outcomes and organizational efficiency.",
        "program website url": "https://www.uakron.edu/allied-health/baha/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Allied Health Care Administration",
        "Program Page url": "https://www.uakron.edu/allied-health/baha/"
    },
    {
        "Concentration name": null,
        "description": "The B.A. in Anthropology helps students understand the origin and nature of humankind. Anthropology is a comprehensive discipline that considers biological, social, cultural, and archaeological questions about human beings and human experience. You’ll learn how human societies have been structured and how they vary across time and space. Because anthropology is truly global, it provides a strong foundation for understanding the forces of globalization that shape our modern world. In a competitive job market, an anthropology degree provides students with an attractive skill set, including cultural competency, critical thinking, research, and communication skills.",
        "program website url": "https://www.uakron.edu/academics_majors/anthropology",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Anthropology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor of Science in Applied Mathematics",
        "Program Page url": "https://bulletin.temple.edu/undergraduate/science-technology/applied-mathematics-bs/"
    },
    {
        "Concentration name": "Studio Art",
        "description": "The Bachelor of Fine Arts (B.F.A.) in Art with a concentration in Studio Art provides students with a broad and deep education in art and studio practice. Students select from a variety of studio areas, including ceramics, metalsmithing, painting, drawing, printmaking, and sculpture. Our program supports a wide range of artistic expression and helps students develop their unique creative voice. The comprehensive curriculum allows students to develop technical skills, critical thinking, and historical understanding necessary for a career in art or for graduate study.",
        "program website url": "https://www.uakron.edu/academics_majors/majors/art-bfa-studio-art.dot",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Art",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Art Education program prepares students for careers as visual art educators in public and private school settings from kindergarten through twelfth grade. Students complete a rigorous curriculum in studio art, art history, and art education culminating in student teaching in local school districts. The Art Education program is nationally accredited by the Council for the Accreditation of Educator Preparation (CAEP) through the College of Education and will lead to an initial teaching license in Visual Art (K-12) in the State of Ohio. This program is a collaborative effort between the School of Art and the LeBron James Family Foundation College of Education.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/art-education-ba/",
        "Accreditation status": "Nationally accredited by the Council for the Accreditation of Educator Preparation (CAEP)",
        "Program name": "Bachelor of Arts in Art Education",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/art-education-ba/"
    },
    {
        "Concentration name": null,
        "description": "The Associate of Arts program is an interdisciplinary program designed for students who desire a broad liberal arts education before transferring to a four-year baccalaureate program or entering the workforce. It provides students with a foundational understanding of various academic disciplines, critical thinking skills, and effective communication abilities. The curriculum emphasizes a balanced distribution of courses across humanities, social sciences, and natural sciences, fostering intellectual curiosity and preparing them for diverse academic and professional paths.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-programs/associate-arts/",
        "Accreditation status": null,
        "Program name": "Associate of Arts",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-programs/associate-arts/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/arts-sciences.pdf",
        "Accreditation status": null,
        "Level": "Associate's",
        "Program name": "Associate of Science",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/arts-sciences.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Associate of Technical Studies degree (A.T.S.) provides the opportunity for individuals to design a program of study that best meets their personal and professional career objectives through a combination of technical credits, general education courses, and elective courses. Students tailor an associate degree to meet their specific interests and goals with the help of an academic adviser. This degree is designed for individuals who desire a broad-based, interdisciplinary associate degree that includes a significant portion of technical training (minimum of two technical areas). The A.T.S. provides an educational background for immediate employment or to continue an education for a bachelor's degree. Students are encouraged to pursue advanced education by transferring into the Bachelor of Organizational Supervision, the Bachelor of Technical and Applied Studies or another bachelor's degree program.",
        "program website url": "https://www.uakron.edu/academics_majors/program_detail.dot?programId=56350352-780e-4dd4-934c-22345d06b9b3",
        "Accreditation status": null,
        "Program name": "Associate of Technical Studies",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Automated Manufacturing Engineering Technology (AMET) degree program at The University of Akron is designed to provide students with the knowledge and skills necessary to succeed in the rapidly evolving field of advanced manufacturing and automation. Students in this program will learn to design, implement, maintain, and manage automated manufacturing systems, including robotics, computer-aided design and manufacturing (CAD/CAM), programmable logic controllers (PLCs), and other automated technologies. The AMET curriculum combines theoretical knowledge with hands-on practical experience, preparing graduates for a wide range of careers in industries such as automotive, aerospace, electronics, and consumer goods. Our program emphasizes critical thinking, problem-solving, and teamwork, ensuring that students are well-equipped to address the complex challenges of modern manufacturing. With a focus on innovation and industry relevance, the AMET program provides a strong foundation in engineering principles, manufacturing processes, and automation technologies. Graduates will be prepared to contribute to the development of intelligent manufacturing systems, optimize production efficiency, and drive technological advancements in the global marketplace.",
        "program website url": "https://www.uakron.edu/engineering/academics/bachelor-of-science-in-automated-manufacturing-engineering-technology",
        "Accreditation status": "Accredited by the Engineering Technology Accreditation Commission of ABET.",
        "Program name": "Bachelor of Science in Automated Manufacturing Engineering Technology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Organizational Supervision is a degree completion program designed for students who have earned an associate's degree or have completed 60 credit hours, and desire to continue their education to earn a bachelor's degree. Students acquire the knowledge and skills necessary to manage and lead a diverse workforce in a variety of for-profit, non-profit and public sector organizations. The curriculum provides a strong background in supervision, human relations, organizational behavior, operations, training and development, and employment law. The Organizational Supervision curriculum is designed to help students acquire knowledge and skills to effectively manage and lead a diverse workforce in various organizations. Students learn practical application of: Supervision; Human relations; Organizational behavior; Operations; Training and development; Employment law.",
        "program website url": "https://www.uakron.edu/academics_majors/info.dot?id=1259202",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Organizational Supervision",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (B.S.) in Biochemistry at The University of Akron is designed to provide you with a solid foundation in the principles of chemistry and biology, preparing you for a wide range of career opportunities in the chemical and biological sciences. This program is ideal for students who are fascinated by the molecular basis of life and wish to explore the intricate chemical processes that occur within living organisms.\n\nOur curriculum integrates rigorous coursework in general chemistry, organic chemistry, analytical chemistry, physical chemistry, and biochemistry with essential courses in biology, physics, and mathematics. You will gain hands-on experience through laboratory work, utilizing modern instrumentation and techniques to conduct experiments and analyze data. The program emphasizes critical thinking, problem-solving, and effective communication, skills that are highly valued in both academic and industrial settings.\n\nUpon graduation, you will be well-prepared for entry-level positions in diverse fields such as pharmaceutical research, biotechnology, clinical laboratories, forensic science, and environmental monitoring. The B.S. in Biochemistry also serves as an excellent foundation for further studies in graduate school (M.S. or Ph.D.) or professional programs such as medicine, dentistry, or pharmacy.",
        "program website url": "https://www.uakron.edu/chemistry/undergrad/biochemistry-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biochemistry",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Department of Biology offers an excellent education to students interested in a career in biological sciences. We offer a Bachelor of Science (B.S.) degree in Biology, a minor in biology, and a minor in plant science. Students are exposed to both basic and applied topics in the biological sciences through a modern curriculum with state-of-the-art facilities and opportunities to engage in undergraduate research.",
        "program website url": "https://www.uakron.edu/biology/academics/undergraduate/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology",
        "Program Page url": "https://www.uakron.edu/biology/academics/undergraduate/"
    },
    {
        "Concentration name": "Biomaterials & Tissue Engineering, Medical Devices",
        "description": "The Biomedical Engineering program at The University of Akron is unique due to its focus on both medical devices and biomaterials. Our curriculum is designed to provide students with a strong foundation in engineering principles, coupled with a deep understanding of biological systems and medical applications. Through hands-on learning experiences, state-of-the-art facilities, and collaborations with local hospitals and medical device companies, students gain practical skills and real-world exposure essential for success in the biomedical engineering field. Our graduates are well-prepared for diverse career paths in industry, research, and advanced studies, making a significant impact on healthcare innovation and patient well-being. The Bachelor of Science in Biomedical Engineering curriculum focuses on providing students with a strong foundation in engineering principles, with a specific emphasis on medical device design, biomaterials, and biomechanics. Through a comprehensive curriculum that combines classroom learning, laboratory experiences, and hands-on projects, students will learn to: Design and develop innovative medical devices and diagnostic tools. Understand the properties and applications of biomaterials in various medical contexts. Analyze biomechanical systems and their role in human health and injury. Apply engineering principles to solve complex problems in healthcare. Collaborate effectively in interdisciplinary teams to address real-world challenges.",
        "program website url": "https://www.uakron.edu/engineering/departments/biomedical/ugrad/bs-biomedical-engineering/",
        "Accreditation status": "The Biomedical Engineering curriculum is designed to meet the requirements of ABET (Accreditation Board for Engineering and Technology) accreditation. The program will pursue ABET accreditation following graduation of its first class.",
        "Program name": "Bachelor of Science in Biomedical Engineering",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The biomedical science curriculum provides a strong background in biology, chemistry, and physics, as well as an introduction to basic concepts in biomedical sciences. Students in this program will learn the fundamentals of disease processes, diagnosis, and treatment. Graduates of this program are well prepared for careers in health professions fields such as medicine, dentistry, optometry, pharmacy, physical therapy, and physician assistant, or for graduate school in biomedical sciences. In addition, graduates will have the skills and knowledge to enter the biotechnology and pharmaceutical industries.",
        "program website url": "https://www.uakron.edu/academics_majors/info.dot?u=bachelors-biomedical-science",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biomedical Science",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Business Administration (B.B.A.) in Business Administration provides students with a broad exposure to the fundamentals of business. This program prepares students for various business roles and provides a solid foundation for general management, entrepreneurship, or further graduate study. Students gain a foundational understanding of key business disciplines such as accounting, finance, marketing, management, and operations. The curriculum emphasizes critical thinking, problem-solving, and communication skills essential for success in the modern business world.",
        "program website url": "https://www.uakron.edu/academics_cba/undergraduate/bba-business-admin.dot",
        "Accreditation status": "The University of Akron's College of Business is accredited by AACSB International – The Association to Advance Collegiate Schools of Business. This accreditation is a hallmark of excellence in business education and has been continuously maintained since 1966.",
        "Level": "Bachelor's",
        "Program name": "Bachelor of Business Administration in Business Administration",
        "Program Page url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQGyyYLA1e2yo0Msw7UTg6M7-OdVFd2O0ldK6YpDJv0FxaOCgm9D7hh9CqZF9WduI0dQOV1FZ6JaBJnwk6x8Dky-XwEmvSMbiefzTpM2E3rXaccvsy3RlGSSBXyUYj64CAV2qV9OE972rTY5KmGwwgMIhFbfhM93lc8-92QzVqbdML705CDFPxudond4IdXN-A9B56whxoaU0j9g5EnnZDJ7bhheE4X_RQ0SocsuJG2LBzqx-HkFXbC2r3VbLYpIaA_FJ7yg0gn84V9PsCZ5zL8k_2wferBT2EYcJcAo"
    },
    {
        "Concentration name": null,
        "description": "A minor in Business Administration provides non-business majors with the fundamental business knowledge needed to succeed in today's dynamic global economy. The minor provides a basic understanding of business principles, including accounting, economics, finance, management and marketing. With this minor, you'll gain the skills to apply business knowledge in various professional settings, giving you a competitive edge in your chosen career path. The minor complements your primary major, enhancing your career prospects and opening doors to a wide range of opportunities in both the private and public sectors.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Minor in Business Administration for Non-Business Majors",
        "Program Page url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHy3qAbF3nTKR7vj1NhGXAOJAqxdo-CaIvOHh7MrvrroaDMYR2WHbS3RYVkqOKNJD74PxH9ouPOFd_BOhjHdcCMSBti9_EK1B_l-WfgdVxi6-lBNVA_wemzneFEJNYlHKRr8we7Ic403UWAtpcUrpYsiwmt8gNunrkePab6I7ZjWtWYMkhlkZr4qbtvQ0nZ5nP_Malx2eaDTRd7XyvL3NB1e_baKX4Pp_YoNfgRPaw8t24LutBxItUuRziypfZt0hfkTYQlfXocGw5U"
    },
    {
        "Concentration name": null,
        "description": "Ready to work with data to solve problems and make decisions? Earn your Bachelor of Business Administration (BBA) in Business Data Analytics. The Business Data Analytics program (BBA) provides students with the critical skills and knowledge in data science for careers in business analytics. Our graduates learn to apply data-driven approaches to solve real business problems, make informed decisions, and develop business strategies. This program empowers students to use business intelligence (BI), analytics and data science to transform an organization. Students learn to interpret complex data, develop data models, and communicate findings through data visualization techniques. They will be prepared for a range of positions across various industries.",
        "program website url": "https://www.uakron.edu/business/departments/management/business-data-analytics-bsba",
        "Accreditation status": "AACSB International – The Association to Advance Collegiate Schools of Business",
        "Program name": "Bachelor of Business Administration in Business Data Analytics",
        "Program Page url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQFH3ymWxFo2BJB-QEiF2bhGDUYWKDgtNEB26Zrus48ZOzTaLNJZhKiPXw0-z5_WqZrIUL6_TvuBdbQwXxK90Mych-B5EKMeanMKq3AC_s3CiMAfldXydWivBJpA5L8ZmPMZ1m_032Ub_RhdQ0wSOws2J_ilTm1mkg8Sf-y_vonsFiot9Nffrx6nNRD3ipXnx2gv0WmaINZ97-hPZThoFiGp_8IT3WIvPDyIGpKCwBLyuISn3AtR934OpNfPIKQWEruWrBSF6P0BVP5wxGDnxlELVz0D6A=="
    },
    {
        "Concentration name": null,
        "description": "The Minor in Business Essentials for Engineering Majors is designed to give engineering students a basic understanding of business, economics, finance, accounting, and management. Engineers often move into management and leadership roles, where a basic understanding of business practices and principles is essential for success. This minor is intended for undergraduate engineering majors.",
        "program website url": "https://www.uakron.edu/academics_majors/programs.dot?programid=6630",
        "Accreditation status": null,
        "Program name": "Minor in Business Essentials for Engineering Majors",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Business Administration (BBA) in Business Management program provides students with the fundamental knowledge and skills required to effectively manage organizations. Students develop expertise in various aspects of management, including strategic planning, organizational behavior, human resource management, operations management, and leadership. The curriculum emphasizes practical application through case studies, projects, and internships, preparing graduates for diverse management roles in a wide range of industries.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/management/business-management-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Business Administration in Business Management",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/management/business-management-bs/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Ceramics",
        "Program Page url": "https://www.temple.edu/academics/degree-programs/ceramics-major-ta-crme-bfa"
    },
    {
        "Concentration name": null,
        "description": "Chemical engineering is a diverse and exciting field that plays a vital role in our modern world. Chemical engineers use principles of chemistry, physics, biology, and mathematics to design, develop, and optimize processes that transform raw materials into valuable products. From the production of fuels, plastics, and pharmaceuticals to the development of sustainable energy solutions and advanced materials, chemical engineers are at the forefront of innovation.\n\nIn our ABET-accredited Bachelor of Science in Chemical Engineering program, you will gain a strong foundation in chemical engineering fundamentals, including thermodynamics, fluid mechanics, heat and mass transfer, reaction engineering, and process control. You'll also have opportunities to specialize in areas such as biochemical engineering, materials science, or environmental engineering through elective courses and research projects.",
        "program website url": "https://www.uakron.edu/engineering/cbe/undergraduate-programs/chemical-engineering",
        "Accreditation status": "ABET-accredited",
        "Program name": "Bachelor of Science in Chemical Engineering",
        "Program Page url": "https://www.uakron.edu/engineering/cbe/undergraduate-programs/chemical-engineering"
    },
    {
        "Concentration name": null,
        "description": "Chemistry is the central science and the B.A. in Chemistry is a versatile degree that provides a broad exposure to the field of chemistry with sufficient flexibility to pursue a double major or a minor in other areas such as business, law or foreign languages. This program provides excellent preparation for employment in science-related fields and for careers in areas such as forensic science, environmental science, chemical sales, and science writing. It also provides excellent background for further study, including medical, dental, and law school, or graduate school in a variety of science-related disciplines.",
        "program website url": "https://www.uakron.edu/academics_majors/program_details.dot?programid=588",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Chemistry",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "As a chemistry major, you will study the composition, structure, properties and reactions of matter. You will be exposed to fundamental principles that span all the natural sciences and will learn the language of science to help solve complex problems. The hands-on experiences offered at UA will help develop problem-solving skills and critical thinking that can be applied to both industry and academia. Research is conducted using modern instrumentation for students to be fully prepared for jobs in chemical industries or for graduate studies. The BS in Chemistry provides a stronger foundation in chemistry and is designed to prepare students for graduate study in chemistry or for immediate employment in chemical industries. It also provides excellent preparation for professional schools such as medical, dental, and pharmacy schools. Students are trained in the five main fields of chemistry: analytical, biochemistry, inorganic, organic, and physical chemistry. Our students engage in active research projects with faculty, often resulting in co-authorship on peer-reviewed publications and presentations at national conferences. Students also have the opportunity to participate in co-op experiences at local companies that lead to both academic credit and monetary compensation.",
        "program website url": "https://www.uakron.edu/chemistry/undergraduate.dot",
        "Accreditation status": "ACS Approved",
        "Program name": "Bachelor of Science in Chemistry",
        "Program Page url": "https://www.uakron.edu/chemistry/undergraduate.dot"
    },
    {
        "Concentration name": "Polymer",
        "description": "The Bachelor of Science (B.S.) in Chemistry with an Option in Polymer Chemistry is offered through the Department of Chemistry. This curriculum is designed to prepare students for careers in the polymer industry or for graduate study in polymer science. The program provides a strong foundation in the fundamental principles of chemistry while specializing in the exciting and rapidly growing field of polymers. Students in the Polymer Option curriculum will develop a comprehensive understanding of the traditional areas of organic, inorganic, analytical, physical, and biochemistry; acquire specialized knowledge and skills in polymer chemistry, including synthesis, characterization, and processing techniques; gain extensive hands-on laboratory experience relevant to polymers; understand structure-property relationships in polymeric materials; and learn to apply scientific principles and critical thinking to solve problems in polymer chemistry. They will be prepared for careers in the polymer industry or for advanced studies in polymer science and related fields.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/chemistry/chemistry-polymer-option-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Chemistry - Polymer",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/chemistry/chemistry-polymer-option-bs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Child and Family Development program provides students with knowledge and skills to work effectively with children and families in a variety of community and educational settings. The program helps prepare students for careers working with families in crisis, as well as roles that promote healthy development in young children and adolescents. Through an interdisciplinary curriculum grounded in the theories of child development, family studies and professional practice, students gain an understanding of individuals and families across the lifespan. The program's core courses provide students with a strong foundation in family theory, human development, and professional ethics. There is a strong emphasis on evidence-based practice and professional skills development. The program culminates in an internship experience to apply classroom learning in a professional setting. The program helps prepare students to pursue graduate studies in child and family studies, social work, counseling, public health, law and other related fields.",
        "program website url": "https://www.uakron.edu/academics/programs/child-family-development-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Child & Family Development",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Civil engineering is the oldest of the engineering disciplines and is concerned with the planning, design, construction, and maintenance of structures and with the public health and safety of society. This includes buildings, bridges, dams, highways, water treatment plants, airports, power plants, environmental protection, transportation, and construction management. Civil engineering applies the principles of mathematics, physics, and chemistry to the development of these systems for the betterment of society. The Bachelor of Science in Civil Engineering program prepares graduates for careers in civil engineering, graduate study, and lifelong learning.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/civil-engineering/",
        "Accreditation status": "The Bachelor of Science in Civil Engineering program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Civil Engineering",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/civil-engineering/"
    },
    {
        "Concentration name": "Strategic & Organizational Communication",
        "description": "The Strategic & Organizational Communication (BA) program prepares students for leadership roles in a variety of public and private organizations. Students learn to develop strategies and tactics for effective communication with internal and external audiences, manage communication in crisis situations, build and maintain organizational image and reputation, and apply ethical principles to communication practices. Graduates will have the skills needed to effectively communicate in a variety of contexts, including corporate, non-profit, government, and entrepreneurial settings.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/communication/strategic-organizational-communication-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Communication",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/communication/strategic-organizational-communication-ba/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Community and Workforce Education is a multidisciplinary program designed for students interested in developing the skills and knowledge needed to educate, train, and support individuals in various community, non-profit, and business settings. This program is ideal for those who are passionate about empowering others through education and professional development. Students will learn to design, implement, and evaluate educational programs, develop leadership skills, and understand the dynamics of adult learning and community engagement. The curriculum combines foundational courses in education with electives from various disciplines, allowing students to tailor their studies to their specific career interests. Graduates are prepared for diverse roles such as community educators, corporate trainers, non-profit program coordinators, human resource development specialists, and adult literacy instructors. The program emphasizes practical application, critical thinking, and ethical leadership, preparing students to make a significant impact in their chosen fields.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/education/community_workforce_education_ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Community and Workforce Education",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/education/community_workforce_education_ba/"
    },
    {
        "Concentration name": null,
        "description": "Computer engineers design and develop computer hardware and software. The discipline combines aspects of computer science and electrical engineering. With a Bachelor of Science degree in Computer Engineering, students will be prepared for a career in fields such as computer architecture, embedded systems, very large scale integrated (VLSI) circuit design, computer networks, robotics and software development. Students will develop a strong foundation in digital system design, computer hardware and software, microprocessors, operating systems, and computer networks. The curriculum emphasizes a strong mix of theory and hands-on laboratory experience, preparing students for successful careers in industry or for graduate studies.",
        "program website url": "https://www.uakron.edu/academics/colleges/engineering/computer-engineering/",
        "Accreditation status": "The Bachelor of Science degree program in Computer Engineering is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Level": "Bachelor of Science",
        "Program name": "Bachelor of Science in Computer Engineering",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Computer Information Systems (CIS) program prepares students for careers in the analysis, design, and implementation of business information systems. Our graduates are in demand and consistently receive multiple job offers. The curriculum emphasizes the application of computing in business with a focus on problem-solving, analytical, and managerial skills. Students learn about programming, database management, systems analysis and design, business intelligence, project management, networking, and security. The CIS program is accredited by the Computing Accreditation Commission of ABET.",
        "program website url": "https://www.uakron.edu/cba/departments/mis/computer-information-systems-bs/",
        "Accreditation status": "Accredited by the Computing Accreditation Commission of ABET.",
        "Program name": "Bachelor of Science in Computer Information Systems",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Associate of Applied Business (AAB) in Computer Information Systems (CIS) program prepares students for various entry-level careers in information technology. Our curriculum is designed to provide students with a solid foundation in computer programming, networking, database management, web development, and cybersecurity. The program emphasizes hands-on learning, practical skills, and industry-relevant technologies. Graduates will be equipped to analyze, design, implement, and maintain information systems, making them valuable assets in today's technology-driven world.",
        "program website url": "https://www.uakron.edu/cis/degrees/aab-cis",
        "Accreditation status": null,
        "Program name": "Associate of Applied Business in Computer Information Systems",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Computer Science",
        "Program Page url": "https://www.ics.hawaii.edu/academics/undergraduate-programs/bs/"
    },
    {
        "Concentration name": null,
        "description": "The Associate of Applied Science in Construction Engineering Technology program at The University of Akron provides students with a solid foundation in the principles and practices of construction engineering. This program prepares graduates for entry-level positions in the construction industry, where they will assist in the planning, design, and management of construction projects. Students gain practical skills in areas such as construction methods, materials, estimating, scheduling, and project control. The curriculum emphasizes hands-on learning and real-world applications, ensuring graduates are well-equipped to contribute immediately to the construction workforce or to continue their education in a related bachelor’s degree program.",
        "program website url": "https://www.uakron.edu/academics_majors/program.dot?id=1418",
        "Accreditation status": null,
        "Program name": "Associate of Applied Science in Construction Engineering Technology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Construction Engineering Technology (CET) is a field of engineering that deals with the planning, design, construction, and management of infrastructure projects such as buildings, roads, bridges, and dams. The Bachelor of Science in Construction Engineering Technology (BS CET) program at The University of Akron prepares students for professional careers in the construction industry. The program emphasizes both theoretical knowledge and practical skills, providing students with a strong foundation in construction methods, materials, equipment, project management, and structural analysis. Graduates of the program are equipped to work in various roles within the construction industry, including project managers, field engineers, estimators, schedulers, and quality control engineers. The Bachelor of Science in Construction Engineering Technology (BS CET) program at The University of Akron is an exciting and challenging program that prepares students for professional careers in the construction industry. The program emphasizes both theoretical knowledge and practical skills, providing students with a strong foundation in construction methods, materials, equipment, project management, and structural analysis. Students also learn about the legal and ethical aspects of construction, as well as the importance of sustainability and safety. The program curriculum is designed to meet the needs of the construction industry, and graduates are highly sought after by employers.",
        "program website url": "https://www.uakron.edu/academics_majors/program_detail.dot?programId=5635031d-b80c-4860-af84-180b7201389c",
        "Accreditation status": "Accredited by the Engineering Technology Accreditation Commission of ABET.",
        "Program name": "Bachelor of Science in Construction Engineering Technology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The A.A.S. in Construction Field Operations program is designed to meet the growing need for skilled workers in the construction industry, including roles such as project superintendent, field engineer, project manager, estimator, and safety officer. This program provides students with the foundational knowledge and practical skills necessary for successful entry into various construction field operations positions. Students gain an understanding of construction methods, materials, equipment, safety practices, project management principles, and relevant industry technologies. The curriculum emphasizes hands-on learning, problem-solving, and communication skills essential for effective collaboration within construction teams. Graduates will be prepared to contribute to diverse construction projects, from residential and commercial buildings to infrastructure development.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/civil-engineering/construction-field-operations-aas/",
        "Accreditation status": null,
        "Program name": "Associate of Applied Science in Construction Field Operations",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/civil-engineering/construction-field-operations-aas/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Corrosion Engineering Technology prepares students for careers in the field of corrosion, which is the degradation of materials due to their interaction with the environment. Students completing this program will have a broad understanding of the causes and effects of corrosion, as well as methods for its prevention and control. The curriculum emphasizes practical applications and hands-on experience, providing graduates with the skills necessary to analyze corrosion problems, design solutions, and implement corrosion control strategies in various industries. Topics covered include electrochemistry, materials science, corrosion mechanisms, protective coatings, cathodic protection, corrosion monitoring, and failure analysis. Graduates are prepared for roles in industries such as oil and gas, infrastructure, manufacturing, aerospace, and water treatment.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/chemical-biomolecular-corrosion-engineering/corrosion-engineering-bs/corrosion-engineering-bs.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Corrosion Engineering Technology",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/chemical-biomolecular-corrosion-engineering/corrosion-engineering-bs/corrosion-engineering-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Criminal Intelligence Analysis prepares students for careers in intelligence analysis in local, state, and federal law enforcement agencies and for similar positions in private industry. Intelligence analysis is a systematic process of collecting, analyzing, and disseminating information to provide actionable intelligence for decision-makers. Students will learn how to identify criminal activities and trends, assess threats, and develop strategies to prevent and mitigate crime. The program emphasizes critical thinking, research, data analysis, and communication skills, which are essential for success in the field of criminal intelligence. Students will also learn about intelligence ethics, legal issues, and the use of technology in intelligence operations.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/criminal-justice-studies/criminal-intelligence-analysis-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Criminal Intelligence Analysis",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/criminal-justice-studies/criminal-intelligence-analysis-bs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Criminology and Criminal Justice program at The University of Akron prepares you for a career in law enforcement, courts, corrections, juvenile justice, and more. Our curriculum includes courses in criminology, criminal justice, juvenile delinquency, policing, corrections, law and social control, research methods, and statistics. You will gain a strong foundation in theories of crime and deviance, criminal justice policies and practices, and ethical issues in the field. Our program emphasizes critical thinking, analytical skills, and effective communication, essential for success in the criminal justice system. Additionally, internship opportunities provide practical experience and networking connections.",
        "program website url": "https://www.uakron.edu/academics_majors/program.dot?id=1255",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Criminology and Criminal Justice",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Cyber Forensics program focuses on the study of criminal behavior in cyberspace and the methods for the collection, preservation, and analysis of digital evidence. Students will learn how to identify, acquire, analyze, and report on digital evidence using forensically sound methods. In addition, students will learn to manage information security risks and incidents. The Cyber Forensics program prepares students for careers as cyber forensics analysts, digital forensics examiners, incident responders, e-discovery specialists, information security analysts, and IT auditors. Students completing the program will be prepared to take industry standard certifications such as CompTIA A+, Network+, Security+, CyberSecurity Analyst (CySA+), PenTest+, and EC-Council Certified Ethical Hacker (CEH).",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Cyber Forensics",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/health-professions/health-professions.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Dance, offered through The University of Akron’s School of Dance, Theatre, and Arts Administration (DTAA), is dedicated to preparing students for a diverse range of opportunities in the ever-evolving field of dance. Our program provides a comprehensive and balanced curriculum, fostering artistic excellence, critical thinking, and a deep understanding of dance as an art form and a cultural phenomenon. Students engage in rigorous technical training in various dance forms, including ballet, modern, jazz, and improvisation. Beyond technique, the curriculum delves into the history, theory, and cultural contexts of dance, equipping students with a holistic perspective. Our faculty, comprised of experienced professionals and scholars, are committed to nurturing each student's unique artistic voice and intellectual growth. Through a combination of studio practice, academic study, and performance opportunities, students develop not only their physical prowess and artistry but also their research, analytical, and communication skills. The program emphasizes creativity, collaboration, and community engagement, preparing graduates to excel as performers, choreographers, educators, scholars, arts administrators, and advocates in the local, national, and international dance landscape.",
        "program website url": "https://www.uakron.edu/dtaa/prospective-students/index.dot",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Dance",
        "Program Page url": "https://www.uakron.edu/dtaa/prospective-students/index.dot"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Dance",
        "Program Page url": "https://www.downtownakron.com/newsitem/the-university-of-akron-school-of-dance-theatre-and-arts-administration-proudly-presents-uadc-fall-2025"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Data Science, Statistics is designed to train students to work as data scientists, statisticians, and data analysts. This program is offered by the Department of Statistics, which is housed in the College of Engineering and Polymer Science. Students completing this degree will be well prepared to enter the workforce or pursue a graduate degree in data science, statistics, or a related field. The demand for data scientists continues to grow, so career prospects are very good.",
        "program website url": "https://www.uakron.edu/academics_majors/data-science-statistics",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Data Science, Statistics",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Geology or Earth Science provides a flexible program of study for students interested in careers where a broad background in Earth science is an advantage. These careers include environmental law, environmental policy, business, technical writing, scientific illustration, and high school teaching. This program is particularly suitable for students who wish to combine Earth Science with a minor or second major in another field. The course of study provides a background in Earth science that helps students understand societal issues that are often related to the environment, Earth resources and natural hazards, and to appreciate the scientific method.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/geosciences/geology-earth-science-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Earth Science",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/geosciences/geology-earth-science-ba/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (B.A.) in economics provides a solid liberal arts education with a focus on analytical skills, critical thinking, problem-solving and communication. Through the study of economics, you will gain an understanding of how individuals, businesses, and governments make decisions when faced with scarcity. The program emphasizes the development of quantitative and qualitative reasoning skills crucial for success in a wide variety of career paths and graduate studies. The B.A. in economics can prepare you for careers in business, finance, government, or law, as well as for graduate work in economics, law, or public policy. We are proud to offer an interdisciplinary approach to understanding the world around us, and our faculty are dedicated to helping students achieve their academic and professional goals.",
        "program website url": "https://www.uakron.edu/academics_majors/economics/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Economics",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Electrical and electronic engineering technology is a field dedicated to the application of electrical, electronic, and computer science principles to solve real world problems. Electrical and Electronic Engineering Technology graduates are well-prepared to enter the technical workforce as engineering technicians. The Electrical and Electronic Engineering Technology program leads to an Associate of Applied Science Degree.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/electrical-computer/",
        "Accreditation status": null,
        "Program name": "Associate of Applied Science in Electrical and Electronic Engineering Technology",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/electrical-computer/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor of Science in Electrical and Electronic Engineering Technology",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/electrical-computer/electronic-engineering-technology-aas/electronic-engineering-technology-aas.pdf"
    },
    {
        "Concentration name": null,
        "description": "The electrical engineering program prepares students for a dynamic career in a field where technology is always advancing. From small, intricate microchips to large-scale power systems, electrical engineers are at the forefront of innovation.\nOur program provides a robust foundation in areas such as circuit analysis, digital systems, electromagnetics, and control systems. Students gain hands-on experience through labs, projects, and design courses, preparing them for real-world challenges.\nElectrical engineers play a crucial role in designing, developing, and maintaining electrical systems and electronic devices across various industries, including telecommunications, aerospace, automotive, energy, and healthcare.\nGraduates of our program are well-prepared for diverse roles in industry, government, and research, or for advanced studies in graduate school. With a strong emphasis on problem-solving, critical thinking, and practical application, our students are equipped to lead in a rapidly evolving technological landscape.",
        "program website url": "https://www.uakron.edu/engineering/electrical/bs-ee",
        "Accreditation status": "The Bachelor of Science in Electrical Engineering program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Electrical Engineering",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": "Emergency Management, Homeland Security, Fire Protection Technology",
        "description": "The Bachelor of Science (B.S.) in Emergency Management and Homeland Security (EMHS) program is designed to prepare students for a wide range of career opportunities in public and private sector emergency management and homeland security. The program focuses on the entire spectrum of disaster preparedness, response, recovery, and mitigation. Students will learn how to plan for and manage natural disasters, technological hazards, and human-caused threats. The curriculum emphasizes critical thinking, problem-solving, and communication skills essential for effective leadership in dynamic and high-pressure environments. Graduates will be equipped to protect communities, critical infrastructure, and national security interests.",
        "program website url": "https://www.uakron.edu/academics_majors/detail.dot?pID=183&pName=Emergency%20Management%20and%20Homeland%20Security",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Emergency Management and Homeland Security",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Emergency Medical Services Technology is designed for paramedics who have completed an associate’s degree or other post-secondary education. The program provides the necessary education for graduates to serve in leadership, supervisory and administrative positions in emergency medical services organizations, industry, and government. The curriculum prepares students to provide comprehensive, quality, compassionate, evidence-based pre-hospital care to patients of all ages, as well as to develop the critical thinking, communication, problem-solving, and decision-making skills required for complex emergency care and administration. Graduates are eligible to pursue master's degrees.",
        "program website url": "https://www.uakron.edu/dses/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Emergency Medical Services Technology",
        "Program Page url": "https://www.uakron.edu/dses/"
    },
    {
        "Concentration name": null,
        "description": "Upon completion of the English B.A. program, students will be able to:\n*   Analyze and interpret various types of texts and genres using appropriate methodologies and critical theories.\n*   Conduct research and integrate sources effectively, ethically, and responsibly.\n*   Write clearly, effectively, and persuasively for diverse purposes and audiences.\n*   Demonstrate knowledge of literary and rhetorical traditions, historical contexts, and cultural perspectives.\n*   Engage in critical self-reflection and collaborative work.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/english/english-ba/english-ba.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in English",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/english/english-ba/english-ba.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Entrepreneurship enables students from any major to gain valuable skills in entrepreneurial thinking and new venture creation. Students learn how to identify opportunities, develop innovative solutions, secure resources, and launch successful ventures, whether in a startup, corporate, or social setting. This minor complements any degree by fostering a mindset of creativity, problem-solving, and resilience essential for navigating today's dynamic professional landscape. It's an excellent choice for students looking to start their own businesses, innovate within existing companies, or drive social change.\n\nThe Minor in Entrepreneurship is a 15-credit-hour program designed to provide students with the foundational knowledge and practical skills needed to pursue entrepreneurial endeavors. The curriculum covers key areas such as idea generation, business model development, market analysis, financial planning, and strategic management. Through a blend of theoretical concepts and hands-on projects, students gain real-world experience and develop a comprehensive understanding of the entrepreneurial process. This minor is open to all undergraduate students regardless of their major, making it a versatile addition to any academic path.",
        "program website url": "https://www.uakron.edu/business/academics/entrepreneurship/minor-in-entrepreneurship.cms",
        "Accreditation status": null,
        "Program name": "Minor in Entrepreneurship",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Environmental science is the interdisciplinary study of how humans interact with the environment, covering topics such as air and water pollution, climate change, land use, ecosystem health, and resource management. The B.S. in Environmental Science program at The University of Akron provides students with a strong foundation in natural sciences, including biology, chemistry, geology, and physics, as well as an understanding of social, economic, and policy aspects of environmental issues. Students gain hands-on experience through field work, laboratory experiments, and research projects. Our graduates are prepared for careers in environmental consulting, conservation, government agencies, research, and further graduate studies.",
        "program website url": "https://www.uakron.edu/academics/programs/environmental-science-bs",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Environmental Science",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Exercise Science program is designed for students who enjoy helping others improve their health, fitness and sport performance. The program provides the foundational knowledge, skills and abilities in the areas of exercise science, exercise testing, exercise prescription, exercise leadership, strength and conditioning, human performance, and wellness. The curriculum prepares students for careers as exercise professionals in cardiac rehabilitation, corporate/community wellness, strength and conditioning, and personal training, as well as for graduate study in exercise science, physical therapy, occupational therapy, chiropractic and other health-related professions. The Exercise Science program is housed in the School of Nutrition and Exercise Science (SNES) in the College of Health and Environmental Sciences.",
        "program website url": "https://www.uakron.edu/academics_majors/details.dot?id=1255",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Exercise Science",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Finance is the study of how individuals, businesses, and organizations allocate and manage their financial resources. This minor will provide students with the ability to understand financial markets, analyze investment opportunities, and make informed financial decisions. The minor is a valuable addition to many business majors, especially those in Accounting, Economics, Management, Marketing, and Supply Chain Management. Students are encouraged to pursue a minor in finance to gain a competitive edge in the job market.",
        "program website url": "https://www.uakron.edu/academics_majors/detail.dot?id=1214",
        "Accreditation status": null,
        "Program name": "Minor in Finance for Business Majors",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Financial Management provides a broad background in all areas of finance, including financial analysis, investment management, and corporate finance. Students learn the tools to make sound financial decisions in a variety of business and personal situations. Career opportunities for graduates in financial management are available in commercial banking, investment banking, corporate finance, insurance, real estate, and government.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/finance/financial-management-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Business Administration in Financial Management",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/finance/financial-management-bs/"
    },
    {
        "Concentration name": "Financial Planning",
        "description": "The Financial Planning program at The University of Akron is one of the oldest and most respected programs in the country. Our program is designed to educate you in all areas of financial planning. Our curriculum is recognized by the Certified Financial Planner Board of Standards, Inc. as a CFP® Board Registered Program. You will learn about topics such as: Investments, Insurance, Employee benefits, Retirement planning, Estate planning, and Income taxation. The Financial Planning program is one of a select group of programs in the United States registered with the Certified Financial Planner Board of Standards Inc. (CFP Board). The CFP Board-registered program prepares students to sit for the CFP® exam upon graduation. Financial planners help individuals and businesses to set and meet long-term financial goals through knowledgeable advice concerning investments, insurance, taxes, and retirement and estate planning. They enjoy rewarding careers that combine strong personal relationships with in-depth financial expertise.",
        "program website url": "https://www.uakron.edu/cba/departments/finance/financial-planning.dot",
        "Accreditation status": "Recognized by the Certified Financial Planner Board of Standards, Inc. as a CFP® Board Registered Program.",
        "Program name": "Bachelor of Business Administration in Financial Planning",
        "Program Page url": "https://www.uakron.edu/cba/departments/finance/financial-planning.dot"
    },
    {
        "Concentration name": null,
        "description": "Prepare yourself to work with individuals or organizations to help them plan their financial futures with a Minor in Financial Planning from The University of Akron. You will gain a strong background in investment analysis, insurance, estate planning, retirement, and tax planning. This program is an excellent complement to other business degrees, and those pursuing careers in law, public administration, or social sciences. It will also help students prepare for careers in corporate finance and financial services, including investment companies, commercial banks, and insurance companies. Students who complete the minor will have satisfied the educational requirements to sit for the CFP® Certification Examination. The Minor in Financial Planning is part of the College of Business, which is accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "program website url": "https://www.uakron.edu/academics_majors/details.dot?programid=1130",
        "Accreditation status": "AACSB International – The Association to Advance Collegiate Schools of Business",
        "Program name": "Minor in Financial Planning",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": "Didactic Program in Dietetics (DPD), Pre-Professional track",
        "description": "The Bachelor of Science in Food and Nutrition Sciences offers two tracks: The Didactic Program in Dietetics (DPD) and the Pre-Professional track. This degree prepares students for careers as Registered Dietitian Nutritionists (RDN) and nutrition and food service professionals. It also provides a solid foundation for graduate study and other health-related professional programs. Our curriculum is designed to help you develop the knowledge and skills necessary to address nutrition and health challenges faced by individuals, families, and communities. You will learn about the science of food, human nutrition, medical nutrition therapy, food service management, and public health nutrition. Our program emphasizes interprofessional collaboration, evidence-based practice, and cultural competence.",
        "program website url": "https://www.uakron.edu/nutrition/food-nutrition-sciences-bs",
        "Accreditation status": "The Didactic Program in Dietetics (DPD) at The University of Akron is currently granted accreditation by the Accreditation Council for Education in Nutrition and Dietetics (ACEND) of the Academy of Nutrition and Dietetics, 120 South Riverside Plaza, Suite 2190, Chicago, IL 60606-6995, (312) 899-0040 ext. 5400. https://www.eatrightpro.org/acend.",
        "Program name": "Bachelor of Science in Food and Nutrition Sciences",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Geology degree provides a broad education in the geosciences with maximum flexibility in electives to pursue other interests (e.g., pre-law, business, social sciences, secondary education, or additional science fields). This degree prepares students for immediate employment or graduate studies.",
        "program website url": "https://www.uakron.edu/academics_majors/program_details.dot?programId=5582",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Geology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Geology is the study of the Earth, including its composition, structure, processes and history. Geologists study natural hazards such as earthquakes, landslides, floods, and volcanic eruptions. They search for and develop natural resources, including ground water, petroleum, and mineral deposits. Geologists also study global climate change, coastal and ocean processes, and the history of life on Earth. A Bachelor of Science in Geology prepares students for careers as professional geologists, or for graduate study.",
        "program website url": "https://www.uakron.edu/academics_majors/major.dot?id=125",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Geology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Our Global Studies program is an interdisciplinary major that combines courses from a variety of academic disciplines with a focus on understanding the political, economic, social, and cultural aspects of globalization.\nStudents in Global Studies learn critical thinking skills to analyze global issues and problems from multiple perspectives and develop cross-cultural communication skills essential for success in an interconnected world.\nOur graduates are prepared for a wide range of careers in international organizations, government agencies, non-profit organizations, and multinational corporations. Many also pursue graduate studies in fields such as international relations, public policy, and law.\nAs part of the program, students are encouraged to participate in study abroad programs and internships to gain practical experience and deepen their understanding of global issues. A capstone project allows students to apply their knowledge and skills to a real-world global challenge.",
        "program website url": "https://www.uakron.edu/academics_majors/global-studies-ba",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in Global Studies",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts (BFA) in Graphic Design at The University of Akron is a professional degree that provides students with the aesthetic, practical, intellectual, and technical skills necessary for successful careers in graphic design. The curriculum emphasizes visual problem-solving, creative exploration, communication theory, design history, and professional practices. Students develop a strong foundation in typography, branding, web design, motion graphics, and print production. The program fosters critical thinking, visual literacy, and a sophisticated understanding of design principles and processes. Through studio-based courses, projects, and critiques, students build a comprehensive portfolio showcasing their abilities to generate innovative and effective design solutions. Our graduates are prepared for diverse roles in the design industry, including graphic designer, web designer, brand strategist, art director, and user experience (UX) designer.",
        "program website url": "https://www.uakron.edu/academics/programs/program.dot?id=1259",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Graphic Design",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in History provides a broad perspective on cultures and societies from around the world and across time. With a focus on critical thinking and research skills, you’ll develop an understanding of the past and its impact on the present. You’ll be prepared for careers in law, public service, journalism, research, education and more. The Bachelor of Arts in History program gives you the skills necessary to excel in a variety of exciting fields as well as pursue graduate education. You’ll learn how to conduct research, analyze evidence, and communicate effectively, preparing you for a diverse range of professions where these critical skills are highly valued. Throughout the program, you'll engage with compelling narratives, explore diverse perspectives, and develop a deeper understanding of the forces that have shaped civilizations.",
        "program website url": "https://www.uakron.edu/academics_majors/bachelor/history/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in History",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": "Human Resources Management",
        "description": "The Human Resources Management program is designed to provide students with the knowledge and skills necessary to assume human resources positions in business, industry, and government. The program will prepare students for leadership roles in human resources, including areas such as staffing, training and development, compensation, benefits, and labor relations. The Human Resources Management program also prepares students for further graduate study in human resources. The program's curriculum is aligned with the Society for Human Resource Management (SHRM) HR Curriculum Guidebook and Templates.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/management/human-resources-management-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Business Administration in Human Resource Management",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/management/human-resources-management-bs/"
    },
    {
        "Concentration name": null,
        "description": "The Human Resource Management minor is an excellent addition to any major, providing you with a strong foundation in a field that is vital to every business. The courses within this minor are designed to provide students with a comprehensive understanding of human resource management functions, including staffing, training and development, performance management, compensation and benefits, labor relations, and HR strategy. You will develop critical skills in areas such as HR analytics, legal compliance, and ethical decision-making, preparing you for a variety of roles within human resource departments or as a leader with strong people management capabilities.",
        "program website url": "https://www.uakron.edu/business/degrees/hr-management-minor",
        "Accreditation status": "The College of Business is accredited by AACSB International.",
        "Program name": "Minor in Human Resource Management",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor of Business Administration in Information Systems",
        "Program Page url": "https://guide.wisc.edu/undergraduate/business/operations-information-management/business-information-systems-bba/"
    },
    {
        "Concentration name": null,
        "description": "This minor is a great option for business and non-business students who are interested in complementing their major with courses in information systems. Information systems professionals have the skills necessary to analyze, design, and implement computer-based solutions to business problems. Students completing this minor will gain expertise in database management, systems analysis and design, and business programming.",
        "program website url": "https://www.uakron.edu/business/departments/management/degrees-programs/information-systems-minor.dot",
        "Accreditation status": null,
        "Program name": "Minor in Information Systems",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Business Administration in International Business",
        "Program Page url": "https://www.rsm.nl/education/bachelor/bsc-international-business-administration-iba/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Minor in International Business",
        "Program Page url": "https://catalog.utexas.edu/undergraduate/business/minor-and-certificate-programs/"
    },
    {
        "Concentration name": null,
        "description": "Special education teachers work with students who have a wide range of learning, mental, emotional and physical disabilities. They adapt general education lessons and teach various subjects, such as reading, writing and math, to students with disabilities. This major leads to a Bachelor of Science degree in Education with a dual licensure in Intervention Specialist (K-12) and Early Childhood Intervention Specialist (Age 3-Grade 3). You will learn to work with diverse learners from Pre-K through high school, and be prepared to take the Ohio Assessments for Educators exams required for licensure. This program is accredited by the Council for the Accreditation of Educator Preparation (CAEP). In this program, you will gain the knowledge, skills, and dispositions to work with students who have mild to moderate disabilities in grades K-12, as well as students with a range of disabilities in pre-kindergarten to third grade. You will learn to use assessment data to inform instruction, design and implement individualized education programs, collaborate with families and other professionals, and apply evidence-based practices to support student learning and development. The curriculum emphasizes practical experience through field placements in diverse educational settings.",
        "program website url": "https://www.uakron.edu/academics_majors/details.dot?id=1214088",
        "Accreditation status": "This program is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Intervention Specialist (K-12); ECIS (Age 3-Grade 3)",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/jewelry-metalsmithing-bfa/jewelry-metalsmithing-bfa.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Jewelry and Metalsmithing",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/jewelry-metalsmithing-bfa/jewelry-metalsmithing-bfa.pdf"
    },
    {
        "Concentration name": null,
        "description": "The B.S. in Surveying is an ABET-accredited program that prepares graduates to enter the surveying profession at a professional level. Surveyors are involved in a wide range of projects, including measuring and mapping the earth's surface, defining property boundaries, and designing and managing construction projects. The program provides a strong foundation in surveying principles, including geodesy, photogrammetry, remote sensing, and geographic information systems (GIS). Graduates are prepared to work in a variety of settings, including private surveying firms, government agencies, and construction companies. The program also offers opportunities for students to gain hands-on experience through internships and field work. Graduates are eligible to sit for the Fundamentals of Surveying (FS) exam, the first step toward becoming a licensed professional surveyor. This program can be completed in four years on a full-time schedule.",
        "program website url": "https://www.uakron.edu/academics/colleges-departments/college-of-engineering-and-polymer-science/civil-engineering-and-environmental-engineering/undergraduate-programs/bs-land-surveying",
        "Accreditation status": "ABET-accredited",
        "Program name": "Bachelor of Science in Land Surveying",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Marketing is the process of planning and executing the conception, pricing, promotion, and distribution of ideas, goods, and services to create exchanges that satisfy individual and organizational objectives. The Marketing Management program is designed to provide students with a broad and thorough understanding of the theory and practice of marketing. Students learn how to analyze markets and customers, develop new products, price products, communicate the value of products and services, and manage distribution channels. Students are trained in a variety of business environments through the use of marketing simulations, cases, and projects. Upon graduation, students have a strong foundation for successful careers in marketing and sales management.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/marketing/marketing-management-bs/",
        "Accreditation status": "The College of Business Administration is accredited by AACSB International.",
        "Program name": "Bachelor of Business Administration in Marketing",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/marketing/marketing-management-bs/"
    },
    {
        "Concentration name": null,
        "description": "A Minor in Marketing requires a minimum of 18 credits. The course requirements provide an overview of marketing principles, consumer behavior, and marketing research. Students will gain an understanding of how businesses identify target markets, develop marketing strategies, and implement promotional activities. This minor enhances a student's major by adding valuable skills applicable across various industries.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-schools/business-administration/marketing-minor/",
        "Accreditation status": null,
        "Program name": "Minor in Marketing",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/courses-instruction/"
    },
    {
        "Concentration name": "Aerospace Track",
        "description": "The Bachelor of Science in Mechanical Engineering (BSME) program at The University of Akron is designed to equip students with a robust understanding of how to design, analyze, manufacture, and maintain mechanical systems. Our curriculum blends theoretical knowledge with practical, hands-on experience, preparing graduates to tackle complex engineering challenges across various industries. Students gain expertise in areas such as thermodynamics, fluid mechanics, materials science, dynamics, and control systems. The program emphasizes critical thinking, problem-solving, and innovation, fostering a deep appreciation for the ethical and societal impacts of engineering. Through challenging coursework, state-of-the-art laboratory experiences, and design projects, students develop the skills necessary for successful careers in industry, government, or for further graduate studies.",
        "program website url": "https://www.uakron.edu/academics_majors/detail.dot?p=mechanical-engineering",
        "Accreditation status": "The Bachelor of Science in Mechanical Engineering program is accredited by the Engineering Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Mechanical Engineering",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Mechanical Engineering Technology students learn to apply engineering principles to the design, development, and improvement of mechanical systems, equipment and processes. Mechanical engineering technology is the largest and most diversified of the engineering technologies and offers a wide range of job opportunities. The Mechanical Engineering Technology (MET) program emphasizes product development, manufacturing processes, quality control, maintenance, design, and analysis. Students learn how to analyze and solve applied engineering problems, especially those involving mechanical components, machinery, and manufacturing systems. Hands-on laboratory work and extensive use of computers prepare graduates for immediate entry into rewarding technical careers. Our graduates are often employed in positions such as product design and testing, manufacturing, quality control, technical sales, industrial operations, and CAD/CAM.",
        "program website url": "https://www.uakron.edu/academics_majors/program_detail.dot?programId=55670&pageId=73200",
        "Accreditation status": "The Associate of Applied Science (AAS) in Mechanical Engineering Technology program is accredited by the Engineering Technology Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Associate of Applied Science in Mechanical Engineering Technology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Our ABET-accredited Bachelor of Science (B.S.) in Mechanical Engineering Technology (MET) program gives students the tools to apply scientific and engineering principles to design, develop, test and manufacture mechanical and thermal devices and systems. Students learn to apply current and emerging technologies with hands-on labs and real-world projects. The curriculum integrates mathematics, science, engineering technology and communication skills. The multidisciplinary program provides a broad understanding of the mechanical, thermal and industrial areas of mechanical engineering technology. Graduates are ready for a variety of careers in fields such as manufacturing, product design, energy, and aerospace.",
        "program website url": "https://www.uakron.edu/academics_majors/major.dot?id=125",
        "Accreditation status": "ABET-accredited",
        "Program name": "Bachelor of Science in Mechanical Engineering Technology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "This program prepares students to teach grades 4-9 in Ohio public schools. Students completing this program will be eligible for an Ohio 4-9 teaching license. Students must select two teaching fields from English Language Arts, Mathematics, Science, and Social Studies. Students who desire a foreign language teaching field should consult a faculty advisor prior to declaring. This program is designed to provide candidates with content knowledge, professional knowledge, and clinical experiences necessary to facilitate optimal learning and development for young adolescents. Candidates develop competencies that demonstrate their knowledge of adolescent development, content standards, instructional strategies, assessment techniques, and collaborative approaches to meet the needs of diverse learners. This program fulfills the requirements for the Ohio Department of Higher Education (ODHE) and the Council for the Accreditation of Educator Preparation (CAEP).",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/education/middle-level-education/",
        "Accreditation status": "This program fulfills the requirements for the Ohio Department of Higher Education (ODHE) and the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Arts in Middle Level Education (Grades 4-9)",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/education/middle-level-education/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Multidisciplinary Studies program is a highly customizable degree program designed for students who want to build a unique course of study around their interests and career goals. Students choose three academic disciplines/subject areas (called \"focus areas\") from across the College of Arts and Sciences. A minimum of 18 credits are required in each of the three chosen focus areas, with a minimum of 9 credits at the 300/400 level in each. Each focus area must be outside the major and minor fields of study. The curriculum requires 36 upper-division credits (300/400 level) for a total of 120 credits. Students work closely with a faculty advisor to craft their program plan.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Multidisciplinary Studies",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/arts-sciences.pdf"
    },
    {
        "Concentration name": null,
        "description": "The B.A. in Music is a more flexible degree program designed for students who wish to combine a strong musical background with a second major or minor in another academic discipline. This degree is typically paired with other disciplines such as business, history, pre-law, pre-med, engineering, or journalism to enable students to pursue a wider array of employment opportunities. This program requires 120 credit hours and culminates in a senior capstone project.",
        "program website url": "https://www.uakron.edu/music/",
        "Accreditation status": "The University of Akron School of Music is an accredited institutional member of the National Association of Schools of Music (NASM).",
        "Program name": "Bachelor of Arts in Music",
        "Program Page url": "https://www.uakron.edu/music/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Nursing (BSN) program at The University of Akron is designed to prepare graduates for professional nursing practice across diverse healthcare settings. This comprehensive program emphasizes critical thinking, evidence-based practice, leadership, and ethical decision-making. Students will gain theoretical knowledge and practical skills through a blend of classroom instruction, laboratory simulations, and supervised clinical experiences in various healthcare environments. Our curriculum focuses on health promotion, disease prevention, and the care of individuals, families, and communities throughout the lifespan. Graduates of the BSN program are eligible to take the National Council Licensure Examination (NCLEX-RN) to become a Registered Nurse (RN).",
        "program website url": "https://www.uakron.edu/nursing/academic-programs/undergraduate-programs/bsn.dot",
        "Accreditation status": "The baccalaureate degree program in nursing at The University of Akron is accredited by the Commission on Collegiate Nursing Education (CCNE), 655 K Street NW, Suite 750, Washington, DC 20001, 202-887-6791.",
        "Program name": "Bachelor of Science in Nursing",
        "Program Page url": "https://www.uakron.edu/nursing/academic-programs/undergraduate-programs/bsn.dot"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts in Painting and Drawing prepares students to be professional artists, to teach art at the collegiate level, and/or to pursue a graduate degree in the field. The program emphasizes both studio practice and art historical knowledge, allowing students to develop a strong artistic voice through a rigorous curriculum. Students explore a variety of traditional and contemporary approaches to painting and drawing, fostering critical thinking, technical proficiency, and creative problem-solving skills.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/painting-drawing-bfa/painting-drawing-bfa.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Painting and Drawing",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/painting-drawing-bfa/painting-drawing-bfa.pdf"
    },
    {
        "Concentration name": "Legal, Justice & Ethics, Logic & Mind, Moral & Political Philosophy, The Human Condition",
        "description": "Philosophy helps us understand ourselves and our place in the world. It provides skills vital to success in virtually any career field, including critical thinking, problem-solving, reading, writing, and logical analysis. Our department offers a Bachelor of Arts (BA) in Philosophy, which provides a comprehensive understanding of historical and contemporary philosophical debates, and a foundation in logic, ethics, and metaphysics. Our graduates go on to successful careers in law, business, education, government, and medicine.",
        "program website url": "https://www.uakron.edu/philosophy/academics/philosophy-program.dot",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Philosophy",
        "Program Page url": "https://www.uakron.edu/philosophy/academics/philosophy-program.dot"
    },
    {
        "Concentration name": "Photography",
        "description": "The Bachelor of Fine Arts (BFA) program with a concentration in Photography provides students with an in-depth understanding of the medium's history, theories, and practices. Students explore a range of photographic techniques, from traditional analog processes to contemporary digital methods, developing a comprehensive skillset for artistic expression and professional application. The curriculum emphasizes critical thinking, visual literacy, and innovative approaches to image-making, preparing graduates for diverse careers in photography, visual arts, and related fields, or for advanced graduate study.",
        "program website url": "https://www.uakron.edu/arts-sciences/fine-arts/areas/photography/",
        "Accreditation status": "The School of Art is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Program name": "Bachelor of Fine Arts in Photography",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The PK-12 Multi-age Education program prepares future educators to become highly qualified, licensed teachers in areas such as Visual Art, Music, Physical Education, or Foreign Language. With a focus on inclusive practices, diversity, and technology integration, students will learn how to create engaging and supportive learning environments for all students, including those with exceptionalities.",
        "program website url": "https://www.uakron.edu/academics/programs/pk-12-multi-age-education-bs",
        "Accreditation status": "The University of Akron’s Beeghly College of Education is nationally accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in PK-12 Multi-age Education",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Political Science is the study of governments, public policies, political processes, and political behavior within and across countries. Students gain valuable analytical, research, and communication skills necessary for careers in government, law, education, journalism, intelligence, non-profit work, and business. The major includes courses in American government, political theory, public law, international relations, and comparative government. Our faculty members provide students with a solid understanding of current political events while helping students develop the skills to analyze and understand politics more generally.",
        "program website url": "https://www.uakron.edu/academics/programs/political-science-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Political Science",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Polymer Science and Polymer Engineering (PSPE) program at The University of Akron (UA) is a unique and exciting interdisciplinary program, emphasizing the intersection of the traditional fields of chemistry, physics, and engineering. The program is designed to provide students with a fundamental understanding of polymers, their synthesis, characterization, processing, and application. Students will develop skills in polymer design, material selection, manufacturing processes, and product development, preparing them for careers in various industries such as automotive, aerospace, biomedical, consumer products, and advanced materials. The curriculum integrates theoretical knowledge with hands-on laboratory experience, ensuring graduates are well-equipped to address real-world challenges in the polymer industry. Graduates of the PSPE program will be prepared to pursue advanced degrees or enter the workforce directly, contributing to the innovation and advancement of polymer science and engineering.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/engineering-polymer-science.pdf",
        "Accreditation status": "The Bachelor of Science in Polymer Science and Polymer Engineering program is accredited by the Engineering Accreditation Commission of ABET, www.abet.org.",
        "Program name": "Bachelor of Science in Polymer Science and Polymer Engineering",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/engineering-polymer-science.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Early Childhood Inclusive Teacher Preparation program prepares individuals to teach young children, including those with and without disabilities, across the birth to age 8 spectrum. This program leads to an Ohio four-year resident educator license for teaching Pre-Kindergarten, Kindergarten, and grades 1-5, and for teaching children with mild-to-moderate disabilities in Pre-Kindergarten, Kindergarten, and grades 1-5.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/education/early-childhood-inclusive-teacher-preparation-bs/early-childhood-inclusive-teacher-preparation-bs.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Primary Inclusive Teacher Preparation (Age 3 thru Grade 5)",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/education/early-childhood-inclusive-teacher-preparation-bs/early-childhood-inclusive-teacher-preparation-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "Printmaking is a lively and versatile art form. As a printmaker, you will learn to create images through a variety of processes that transfer images from one surface to another. These processes include etching, lithography, silkscreen, woodcut and digital printmaking. The School of Art is equipped with excellent facilities for these processes. Printmaking majors are encouraged to develop a personal aesthetic in their artwork while learning the craft and techniques necessary to become a skilled printmaker. Additionally, students develop an understanding of historical and contemporary trends in the printmaking field. Graduates from the Printmaking program have a professional foundation for careers as artists, studio assistants, educators and exhibition preparators. Some students choose to continue their studies in graduate school and pursue careers as university professors or museum professionals.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/printmaking-bfa/",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Printmaking",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/printmaking-bfa/"
    },
    {
        "Concentration name": null,
        "description": "The Minor in Professional Selling offers an opportunity for students to complement their major with the important functional area of professional selling. This minor prepares students for entry-level sales positions, as well as provides them with skills necessary to be successful in many different fields.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/marketing/marketing.pdf",
        "Accreditation status": "AACSB International accreditation for the College of Business Administration.",
        "Program name": "Minor in Professional Selling",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/marketing/marketing.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (B.A.) in Psychology at The University of Akron provides a robust education in the scientific study of human behavior and mental processes. This program offers a strong foundation for students pursuing careers in human services, education, business, or those planning to continue their education in graduate programs such as counseling, social work, law, and medicine. Students explore diverse areas including cognitive psychology, developmental psychology, social psychology, abnormal psychology, and research methods. The curriculum emphasizes critical thinking, research skills, and ethical considerations in psychological practice, preparing graduates to understand and address complex human issues effectively.",
        "program website url": "https://www.uakron.edu/academics_majors/program_view.dot?programId=563",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Psychology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "Respiratory therapists provide care for patients with heart and lung diseases, including premature infants, children, and adults. They are part of the health care team and provide life support and ventilator management in critical care settings, including emergency rooms and intensive care units. This program, offered by the School of Allied Health Sciences, combines the advantages of a full-service university with the extensive clinical resources of Akron-area health care facilities. Upon graduation, you are eligible to sit for the National Board for Respiratory Care (NBRC) Therapist Multiple-Choice and Clinical Simulation examinations. As a student in the Bachelor of Science in Respiratory Therapy program, you will develop the specialized skills needed to assess, treat, and manage patients with cardiopulmonary problems. You will learn to perform various diagnostic tests and therapeutic procedures, including mechanical ventilation, oxygen therapy, aerosol treatments, and cardiopulmonary resuscitation (CPR). The program also emphasizes critical thinking, problem-solving, and communication skills essential for effective patient care and collaboration within a healthcare team.",
        "program website url": "https://www.uakron.edu/health-sciences/programs/respiratory-therapy/",
        "Accreditation status": "The Bachelor of Science in Respiratory Therapy program at The University of Akron is accredited by the Commission on Accreditation for Respiratory Care (COARC).",
        "Program name": "Bachelor of Science in Respiratory Therapy",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": "Risk Management and Insurance",
        "description": "The BBA in Risk Management and Insurance at The University of Akron is a well-established and highly respected program, known for its strong industry connections and successful alumni. Risk management and insurance professionals analyze and manage various risks facing businesses and individuals, including financial, operational, strategic, and hazard risks. They design and implement strategies to mitigate these risks, protect assets, and ensure financial stability. This program prepares students for various careers in the risk management and insurance industry. You will develop a strong foundation in business principles and specialized knowledge in risk assessment, insurance policies, claims management, and financial planning. Our curriculum is designed to be comprehensive and practical, preparing you for immediate entry into the industry.",
        "program website url": "https://www.uakron.edu/academics/colleges/business/risk-management-insurance",
        "Accreditation status": "The College of Business is accredited by AACSB International.",
        "Program name": "Bachelor of Business Administration in Risk Management and Insurance",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": "Sales Management",
        "description": "The Bachelor of Business Administration, Sales Management program focuses on the sales function of an organization. This degree will prepare students to be successful as professional salespeople and sales managers in today’s dynamic business environment. Students learn how to identify customer needs, present solutions, manage accounts, and develop strong relationships. Graduates will have the knowledge and skills necessary to be successful in a variety of sales and sales management positions in business-to-business and business-to-consumer settings across various industries. Students gain an understanding of sales strategies, sales operations, and sales leadership. An emphasis is placed on developing professional selling skills, ethical decision making, and the use of technology in sales. In addition, students complete an internship to gain real-world experience.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/marketing/sales-management-bs/sales-management-bs.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Business Administration in Sales Management",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/marketing/sales-management-bs/sales-management-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/sculpture-bfa/sculpture-bfa.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Sculpture",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/art/sculpture-bfa/sculpture-bfa.pdf"
    },
    {
        "Concentration name": null,
        "description": "At The University of Akron, the Bachelor of Arts in Social Work (BASW) program prepares students for beginning professional social work practice in a variety of settings. Students will acquire the generalist knowledge, skills, and values to work with individuals, families, groups, organizations, and communities. The curriculum emphasizes social justice, diversity, and evidence-based practice within a strengths-based, ecological framework. Graduates are prepared for direct service roles, advocacy, community engagement, and further education in social work.",
        "program website url": "https://www.uakron.edu/academics/colleges-departments/cas/social-work/",
        "Accreditation status": "The BASW program is fully accredited by the Council on Social Work Education (CSWE).",
        "Program name": "Bachelor of Arts in Social Work",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": "Polymer Option",
        "description": "The B.S. in Chemistry with Polymer Option is designed to provide students with a solid foundation in the core chemistry disciplines in addition to a substantial background in polymer science. The curriculum includes course work in organic chemistry, inorganic chemistry, analytical chemistry, physical chemistry, biochemistry and polymer chemistry. Students are required to complete a minimum of 13 credit hours of polymer-related courses. Students are also required to complete a 3-credit hour research experience or co-op experience. All students in this program are encouraged to engage in undergraduate research with a faculty member in the Department of Chemistry or the School of Polymer Science and Polymer Engineering. The Polymer Option is an excellent choice for students interested in graduate studies in polymer science and engineering or for students interested in working in the polymer industry.",
        "program website url": "https://www.uakron.edu/chemistry/undergraduate/bs-chemistry-polymer",
        "Accreditation status": "Approved by the American Chemical Society (ACS).",
        "Program name": "Bachelor of Science in Chemistry with a Polymer Option",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": "BS",
        "Program name": "Bachelor of Science in Mild/Moderate Intervention Specialist (Grades K - 12)",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/arts-sciences.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Intervention Specialist (K-12) prepares students to teach individuals with moderate/intensive needs in grades K-12. The program also leads to eligibility for the Ohio moderate/intensive intervention specialist teaching license. The program integrates general education and specialized instruction in pedagogy, curriculum, assessment, technology, classroom management, and professional collaboration to maximize learning for students with disabilities. This program prepares candidates to work with students who have moderate to intensive learning and/or behavioral disabilities. Throughout the program, you will learn to implement evidence-based practices for academic, social-emotional, and behavioral instruction, manage a classroom with diverse learners, and collaborate with families and other professionals. In addition to a comprehensive curriculum, the program offers extensive fieldwork experiences, including diverse classroom settings and a full-time student teaching experience.",
        "program website url": "https://www.uakron.edu/education/programs/intervention-specialist-bs-k12/",
        "Accreditation status": "The baccalaureate degree program in education at The University of Akron is accredited by the Council for the Accreditation of Educator Preparation (CAEP). The University of Akron’s professional education programs are approved by the Ohio Department of Higher Education (ODHE).",
        "Program name": "Bachelor of Science in Moderate/Intensive Intervention Specialist (Grades K - 12)",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Early Childhood Intervention Specialist program leads to a Bachelor of Science degree in Education and an Ohio teaching license for Early Childhood Intervention Specialist (Age 3 – Grade 3). It prepares teachers of young children with disabilities in a variety of educational settings. The program provides a foundation in theories of child development and learning, curriculum methods, assessment, teaching strategies, working with families and other professionals, and legal issues. Students complete extensive field experience, including student teaching, in diverse settings.",
        "program website url": "https://www.uakron.edu/education/programs/undergraduate/early-childhood-intervention-specialist.dot",
        "Accreditation status": "Approved by the Ohio Department of Higher Education (ODHE) and accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Early Childhood Intervention Specialist (Age 3 - Grade 3)",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The University of Akron's Bachelor of Arts in History/Juris Doctor 3+3 program allows high-achieving undergraduate students to earn both their bachelor's and law degrees in just six years, rather than the traditional seven. This program is an excellent opportunity for students who are committed to pursuing a career in law. You will gain a strong foundation in history, critical thinking, research, and writing skills, all of which are essential for success in law school and beyond. The 3+3 program not only saves you a year of tuition and living expenses but also accelerates your entry into the legal profession. Upon completion of the three-year undergraduate portion of the program, you will matriculate to the School of Law, where your first year of law school credits will count towards both your bachelor's degree and your Juris Doctor.",
        "program website url": "https://www.uakron.edu/academics_majors/detail.dot?majorId=789827a44f530e37014f53580456012c",
        "Accreditation status": "The University of Akron and all of its programs are accredited by the Higher Learning Commission.",
        "Program name": "Bachelor of Arts in History/Law 3+3",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Philosophy/Law 3+3 program allows high-achieving undergraduate students to earn a Bachelor of Arts degree in Philosophy and a Juris Doctor (JD) degree in six years. Students complete their undergraduate studies in three years (90 credits) and then matriculate to the School of Law. Upon successful completion of their first year in the School of Law (30 credits), the JD credits are applied toward the Bachelor of Arts degree in Philosophy. Students then complete their remaining two years of law school to earn the Juris Doctor degree. This accelerates the process of earning both degrees by one year, saving time and tuition expenses.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/philosophy/philosophy.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Philosophy/Law 3+3",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/philosophy/philosophy.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (BA) in Political Science/National Security is a multidisciplinary program offered by the Department of Political Science. It addresses the growing need for a national security workforce capable of addressing the complex challenges facing the United States in the 21st century. The program is designed to provide students with a strong foundation in political science, international relations, and security studies, preparing them for careers in government, intelligence, defense, and international organizations. Students will develop critical thinking, analytical, and communication skills essential for understanding and responding to national security threats and challenges.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/political-science/political-science-national-security-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Political Science/National Security",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/political-science/political-science-national-security-ba/"
    },
    {
        "Concentration name": null,
        "description": "Earn your bachelor's degree in political science and your Juris Doctor (J.D.) in only six years instead of seven with this joint accelerated program. As a part of this program, you will gain hands-on experience through internships and mock trials to give you a strong foundation for your future career. You will learn skills in critical thinking, writing, and analysis to help you become a successful attorney. We also offer a 4+3 program that allows you to earn both degrees in seven years, where you will complete your undergraduate degree in four years and your J.D. in three.",
        "program website url": "https://www.uakron.edu/political-science-law-3-3-ba",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Political Science/Law 3+3",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Philosophy, Political Science, and Economics (PPE) provides students with a multidisciplinary understanding of these three intertwined fields. This degree is designed to give students a comprehensive liberal arts education that focuses on critical thinking, ethical reasoning, and analytical skills. The program prepares students for a wide range of careers in law, public service, business, and non-profit organizations, as well as for advanced studies in law, public policy, or academic fields. The PPE program offers: A broad foundation in philosophical thought, political systems, and economic principles. The ability to analyze complex social, political, and economic issues from multiple perspectives. Strong skills in critical thinking, problem-solving, and ethical decision-making. Preparation for leadership roles in various sectors. Opportunities for internships, research, and study abroad experiences.",
        "program website url": "https://www.uakron.edu/academics_majors/info?programid=629&majorid=560",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Philosophy, Political Science, and Economics",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The B.A. in Philosophy, Sociology and Psychology is a uniquely interdisciplinary program focused on the study of human beings and the ways in which individuals and groups interact in a diverse and complex world. This program provides students with a broad and rigorous exposure to the foundational theories and methods within the fields of Philosophy, Sociology, and Psychology, helping them to develop critical thinking, communication, and research skills applicable to a wide variety of careers and post-graduate study.\nStudents in the program examine topics such as:\n*   Ethics, values, and morality\n*   Social justice and inequality\n*   Human behavior and cognition\n*   Cultural diversity\n*   Critical reasoning and argumentation\nThe interdisciplinary nature of the program encourages students to analyze complex problems from multiple perspectives, fostering a holistic understanding of societal challenges and human experience. Graduates are prepared for careers in fields such as social work, counseling, education, public policy, human resources, law, and research, or for advanced studies in any of the three disciplines or related interdisciplinary fields.",
        "program website url": "https://www.uakron.edu/academics_majors/info.dot?u=6920f66e-eb2f-488d-a41e-62d294025114",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Philosophy, Sociology and Psychology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (B.A.) degree in sociology provides you with the intellectual tools to understand the social world. Sociology is the scientific study of human society and social behavior. Sociologists examine the organization of social groups, institutions, and societies; patterns of social inequality; the causes and consequences of social change; and the relationships between individuals and society. The sociology major at UA emphasizes critical thinking, scientific inquiry, and social justice. Sociology majors learn to think critically about society, conduct research, and analyze data using both qualitative and quantitative methods. A B.A. in sociology also provides an excellent liberal arts background for students planning on pursuing graduate or professional training in law, social work, business, public administration, or other fields.",
        "program website url": "https://www.uakron.edu/sociology/academics/bachelor-of-arts",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Sociology",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "PROGRAM GOALS: Provide students with a solid foundation in the Spanish language. Familiarize students with the cultural, social, and political contexts of Spanish-speaking peoples. Help students develop an understanding of literary traditions and critical approaches to Hispanic literatures. Foster students' critical thinking, analytical, and communication skills. Prepare students for careers in diverse fields that require proficiency in Spanish and cultural competence. Cultivate in students an appreciation for global citizenship and intercultural understanding.\n\nSTUDENT LEARNING OUTCOMES: Students will demonstrate advanced proficiency in oral and written communication in Spanish. Students will analyze and interpret literary and cultural texts in Spanish. Students will evaluate the social, political, and historical contexts of Spanish-speaking communities. Students will apply critical thinking skills to current events and global issues concerning the Hispanic world. Students will articulate the relevance of Spanish language and culture in a globalized world.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/modern-languages/spanish-ba/spanish-ba.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Spanish",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/modern-languages/spanish-ba/spanish-ba.pdf"
    },
    {
        "Concentration name": null,
        "description": "Corrosion is the destructive attack of a metal by reaction with its environment. It affects almost every industry, causing significant economic losses, safety issues and environmental damage. Corrosion engineers are critical in understanding, preventing and controlling corrosion to extend the life of materials, ensuring safety and minimizing costs in many fields including infrastructure, biomedical, aerospace, oil and gas, manufacturing, and defense.\n\nThe University of Akron’s Bachelor of Science in Corrosion Engineering program is the first and only one of its kind in the United States. Our graduates are highly sought after by industry, government and graduate schools. Students in the program develop a strong background in materials science, electrochemistry and corrosion control engineering principles. The program emphasizes hands-on experience, with students participating in co-op work experiences, undergraduate research, and laboratory-intensive courses.\n\nOur graduates are prepared to address real-world corrosion challenges by applying engineering principles to design, evaluate and implement corrosion prevention and control strategies. They gain expertise in:\n\n*   Understanding the fundamentals of corrosion mechanisms and material degradation processes.\n*   Designing and implementing corrosion control strategies, including material selection, protective coatings, cathodic protection, and inhibitors.\n*   Utilizing advanced analytical techniques to diagnose corrosion problems and assess material performance.\n*   Applying economic and environmental considerations in corrosion engineering solutions.\n*   Collaborating effectively in multidisciplinary teams to solve complex engineering challenges.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/chemical-biomolecular-corrosion-engineering/corrosion-engineering-bs/",
        "Accreditation status": null,
        "Level": "BS",
        "Program name": "Bachelor of Science in Corrosion Engineering",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/engineering-polymer-science/chemical-biomolecular-corrosion-engineering/corrosion-engineering-bs/"
    },
    {
        "Concentration name": null,
        "description": "The minor in Business Data Analytics (BDA) prepares students with fundamental knowledge and skills in data analytics that are applicable to most fields of business and management. By working with real-world data, students develop valuable skills in collecting, processing, analyzing and interpreting large data sets with the goal of making better, more informed business decisions. Skills include data visualization, statistical analysis, database management, and more.",
        "program website url": "https://www.uakron.edu/academics_majors/detail.dot?programId=1327&type=Minor",
        "Accreditation status": null,
        "Program name": "Minor in Business Data Analytics",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The minor in economics is designed for students of any major who want to develop a deeper understanding of current economic issues without committing to a full major. Understanding economics helps students make better decisions in their personal, professional, and civic lives. It provides a solid analytical framework for a wide array of career options, including law, business, journalism, public policy, healthcare, and foreign service. It also provides excellent preparation for graduate study in business, law, and other fields.",
        "program website url": "https://www.uakron.edu/academics_majors/program-details.dot?programId=558",
        "Accreditation status": null,
        "Program name": "Minor in Economics",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Leadership and Human Resources minor is designed to help students acquire a foundation of knowledge and skills in organizational behavior and human resource management (HRM). Students will learn about topics such as motivation, teamwork, leadership, training and development, performance management, and compensation. This minor is an excellent complement to many majors across campus.",
        "program website url": "https://www.uakron.edu/business/academics/management/management-minor-lhr.dot",
        "Accreditation status": null,
        "Program name": "Minor in Leadership and Human Resources",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/business-administration.pdf",
        "Accreditation status": "Accredited by AACSB International – The Association to Advance Collegiate Schools of Business (AACSB).",
        "Program name": "Minor in Information Systems Management",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/business-administration/business-administration.pdf"
    },
    {
        "Concentration name": null,
        "description": "Risk is a part of our personal and professional lives. Risk management and insurance professionals analyze, measure and treat risks. Their job is to protect people and organizations from financial losses stemming from property, casualty, liability, and other risks. They protect assets such as homes, cars, businesses and even lives. The risk management and insurance minor prepares students to analyze and evaluate risk, assess risk financing options, and implement risk solutions. Graduates are prepared for careers in risk management and insurance. Students are prepared to take the AIDA and AINS exams.",
        "program website url": "https://www.uakron.edu/business/departments/finance/finance-major-minor/risk-management-and-insurance-minor.html",
        "Accreditation status": "The College of Business at The University of Akron is accredited by AACSB International, the premier accrediting agency for business schools worldwide.",
        "Program name": "Minor in Risk Management and Insurance",
        "Program Page url": "https://www.odu.edu/academics/programs/minor/risk-management-insurance"
    },
    {
        "Concentration name": null,
        "description": "Enhance your business education by adding a minor in Supply Chain/Operations Management. This minor will give you a fundamental understanding of critical business functions such as purchasing, logistics, inventory management and operations planning. Graduates with this minor will acquire the skills needed to manage the flow of goods and services from suppliers to customers.\nWhat You'll Learn\n* Recognize and apply best practices in purchasing, logistics, inventory management, production and process improvement.\n* Understand the strategic importance of operations and supply chain management within an organization.\n* Develop analytical and problem-solving skills for effective decision-making in operations and supply chain management environments.",
        "program website url": "https://www.uakron.edu/academics_majors/colleges-programs/business/supply-chain-operations-management-minor/",
        "Accreditation status": "AACSB International – the Association to Advance Collegiate Schools of Business (AACSB) accreditation for the College of Business Administration.",
        "Program name": "Minor in Supply Chain/Operations Management",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Applied AI & Information Systems",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/courses-instruction/ism/"
    },
    {
        "Concentration name": null,
        "description": "Students pursuing the Associate of Arts in Communication Option are exposed to a broad knowledge of communication theory and practice. The program helps students develop a foundational knowledge of communication, strengthen analytical and critical thinking, and foster an appreciation for diverse cultures and backgrounds. The curriculum prepares students for entry-level positions in communication-related fields or transfer to a bachelor's degree program.",
        "program website url": "https://www.uakron.edu/academics_majors/program.dot?id=1255523",
        "Accreditation status": null,
        "Program name": "Associate of Arts in Communication Option",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The Humanities Divisional Major is for students who want to develop their own interdisciplinary major in the Humanities, focusing on topics, periods, or areas of interest that do not fit into traditional departmental majors. To declare the Humanities Divisional major, students must consult with the chair of the Department of Philosophy to design a proposal for their program. The Divisional Major in Humanities consists of 30 credits above the 100-level approved by the chair of the Department of Philosophy, with no more than 15 credits from any one department. For additional information, contact the Department of Philosophy at 330-972-7078.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/arts-sciences.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Humanities Divisional",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/arts-sciences.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Associate of Science in Construction Management (ASCM) provides students with the foundational knowledge and skills required for careers in the construction industry. This program focuses on project management, construction methods, cost estimating, safety, and sustainable building practices. Graduates are prepared for entry-level positions in residential, commercial, and industrial construction, or for seamless transfer into a related bachelor's degree program. The University of Akron's ASCM program stands out due to its hands-on learning approach, experienced faculty, and strong industry connections. Students benefit from practical training through labs, site visits, and internship opportunities, ensuring they gain real-world experience. Our curriculum is regularly updated to reflect current industry trends and technologies, providing graduates with a competitive edge.",
        "program website url": "https://www.uakron.edu/academics_majors/construction-management-as",
        "Accreditation status": null,
        "Program name": "Associate of Science in Construction Management Option",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": "Divisional PPE Track",
        "description": "The Bachelor of Arts in Social Sciences with a Divisional PPE Track (Philosophy, Politics, and Economics) is an interdisciplinary program focusing on the intersection of these three critical areas. This track provides students with a robust understanding of social, political, and economic systems, emphasizing critical thinking, analytical reasoning, and ethical decision-making. Students explore fundamental questions related to justice, governance, markets, and human behavior through a comprehensive curriculum that integrates perspectives from philosophy, political science, and economics. This rigorous program prepares graduates for diverse careers in public service, law, business, non-profit organizations, and advanced academic pursuits by developing strong communication skills, problem-solving abilities, and a global perspective.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-programs/social-science-divisional-ppe-track-ba/social-science-divisional-ppe-track-ba.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Social Sciences, Divisional PPE Track",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-programs/social-science-divisional-ppe-track-ba/social-science-divisional-ppe-track-ba.pdf"
    },
    {
        "Concentration name": "Divisional PSP Track",
        "description": "This interdisciplinary major is designed for students with strong academic records who are interested in pursuing graduate or professional education. The Divisional PSP (Pre-Service Preparation) Track is a challenging major tailored for students who intend to enter a professional Master’s program (such as law, social work, public administration, public policy, or business) or a doctoral program (such as in economics, political science, sociology, psychology, or history). The Divisional PSP Track is housed within the Buchtel College of Arts and Sciences in Interdisciplinary Programs. Its students receive intensive advising, take courses that encourage critical thinking, quantitative literacy, and analytical abilities, complete a capstone seminar, and participate in an internship or research experience.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-programs/social-sciences-divisional-psp-track-ba/social-sciences-divisional-psp-track-ba.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Social Sciences, Divisional PSP Track",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-programs/social-sciences-divisional-psp-track-ba/social-sciences-divisional-psp-track-ba.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Social Sciences with a divisional major is designed for students interested in a broad-based education covering multiple areas within the social sciences, rather than focusing on a single discipline. This program offers a flexible curriculum that allows students to explore various fields such as anthropology, economics, political science, sociology, and psychology. Students gain a comprehensive understanding of human behavior, societal structures, and cultural dynamics, preparing them for a wide range of careers or further graduate studies. This program stands out for its interdisciplinary approach, fostering critical thinking, analytical skills, and a global perspective. Students benefit from the expertise of faculty across multiple departments, engaging in diverse topics and research methodologies. The flexibility of the divisional major allows students to tailor their coursework to their interests, creating a personalized academic journey. Graduates are well-equipped for roles in government, non-profit organizations, research, education, and various private sector industries requiring strong analytical and communication skills.",
        "program website url": "https://www.uakron.edu/academics/programs/social-sciences-ba-divisional",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Social Sciences, Divisional",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "This accelerated baccalaureate degree program is designed for individuals who hold a bachelor's degree in another field and want to become a registered nurse. This fast-paced program provides students with the opportunity to complete the BSN in 12 months in a full-time, rigorous, face-to-face format. Students are admitted once a year in May and follow a prescribed course of study designed to lead to successful completion of the NCLEX-RN and entry into professional nursing practice. Graduates are prepared for leadership roles, graduate study, and a variety of practice settings within the healthcare system.",
        "program website url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/health-professions/nursing/accelerated-nursing-bsn/",
        "Accreditation status": "The School of Nursing offers degree programs accredited by the Commission on Collegiate Nursing Education (CCNE).",
        "Program name": "Bachelor of Science in Nursing (Accelerated)",
        "Program Page url": "https://bulletin.uakron.edu/undergraduate/colleges-programs/health-professions/nursing/accelerated-nursing-bsn/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Nursing (for LPNs)",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    },
    {
        "Concentration name": null,
        "description": "The online RN to BSN program at The University of Akron is designed for registered nurses who have an associate degree in nursing or a hospital diploma and want to earn their Bachelor of Science in Nursing (BSN) degree. The program provides the knowledge and skills necessary for the professional nurse to meet the health care needs of diverse populations. The curriculum emphasizes critical thinking, leadership, evidence-based practice, and community health. The RN to BSN program is taught by experienced faculty who are dedicated to helping students succeed. The program is flexible and can be completed at a pace that fits your busy schedule. Courses are offered online, allowing you to learn from anywhere, anytime.",
        "program website url": "https://www.uakron.edu/nursing/undergraduate/rn-bsn.dot",
        "Accreditation status": "The baccalaureate degree program in nursing at The University of Akron is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Bachelor of Science in Nursing (RN to BSN)",
        "Program Page url": "https://www.uakron.edu/academics_majors/"
    }
]