[
    {
        "Concentration name": null,
        "description": "The Master of Accountancy (MAcc) Program at Minnesota State University, Mankato is designed to meet the needs of both career-changers and those already in the accounting profession seeking to fulfill the 150-credit hour requirement to be licensed as a CPA in Minnesota and other states. The MAcc program has a strong reputation for providing a high-quality, affordable, and convenient way for you to achieve your professional and academic goals. Courses in the MAcc program are offered on-campus, online, and in a hybrid format. All required courses for the program are offered online. Students may complete the MAcc degree fully online, on campus, or in a combination that best meets their needs.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-programs/graduate/accountancy-macc/",
        "Accreditation status": "The College of Business is accredited by AACSB International, which represents the highest standard of achievement for business schools worldwide. Less than 5% of the world's 13,000 business programs have earned AACSB Accreditation. AACSB-accredited schools produce graduates that are highly skilled and more desirable to employers than other non-accredited schools. The Department of Accounting has also been granted separate AACSB Accreditation, a distinction that only 186 universities worldwide have achieved.",
        "Level": "MAcc",
        "Program name": "Master of Accountancy (MAcc)",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Ceramics, Drawing, Fibers, Graphic Design, Painting, Printmaking, Sculpture",
        "description": "The Master of Arts in Art and Design degree is for students who want to continue their studies in art and design in a scholarly direction. It is a one-year program that prepares students for further graduate study in art history or for a variety of professional opportunities in museums and galleries. The program does not require a studio emphasis, as the MFA degree does. It is designed to further develop a student's critical, analytical, and writing skills as well as to increase their knowledge and understanding of historical and contemporary art. It is the appropriate degree for graduates who do not intend to teach at the university level.",
        "program website url": "https://www.mnsu.edu/programs/art-design/",
        "Accreditation status": "Minnesota State University, Mankato is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Art and Design",
        "Program Page url": "https://www.mnsu.edu/programs/art-design/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Communication and Media provides students with a program of study focused on human and technologically-mediated communication. This program is for students interested in advanced study and professional growth in communication and media. Our MA students engage with the complex and evolving media and communication environment of the 21st century through innovative instruction, creative activity, and original research. The program emphasizes critical thinking, communication and media theory, diverse research methods, and media production. Our graduates have pursued further graduate education at the Ph.D. level or entered careers in strategic communication, public relations, integrated marketing, media industries, higher education, non-profit, consulting, and management.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/communication-and-media-ma/",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Communication and Media",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": [
            "Literature and Critical Theory",
            "Teaching Writing and Literature",
            "Creative Writing"
        ],
        "description": "The Master of Arts in English is designed for students who want to deepen their skills of literary and cultural interpretation, written and oral communication, critical thinking, and advanced research. The MA in English is an excellent credential for teaching at the community-college level, for applying to PhD programs, and for a wide range of other professions requiring advanced skills in reading, writing, and research, such as publishing, technical writing, professional writing, and public relations.",
        "program website url": "https://www.mnsu.edu/academics/college-of-humanities-and-social-sciences/departments/english/english-ma/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in English",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in English Education provides students the opportunity for advanced study in the fields of language, literature, writing, and pedagogy, enabling them to expand and deepen their expertise as teachers and scholars. Students work with committed and nationally recognized faculty to further develop their expertise in the field of English education. Many of our students are practicing teachers in K-12 and post-secondary settings, while others are recent graduates seeking more experience and knowledge before entering the teaching profession. The program offers face-to-face, hybrid, and online options that meet the needs of a variety of student schedules. All students will work on an individual basis with a graduate advisor to develop a course of study best suited to their individual goals and interests.",
        "program website url": "https://www.mnsu.edu/academics/english/graduate-programs/ma-in-english-education-studies/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in English Education",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Gender & Women's Studies is an interdisciplinary program designed to provide students with a comprehensive and in-depth understanding of the complex intersections of gender, sexuality, race, class, and other social categories. The program offers a rigorous academic curriculum that combines theoretical foundations with practical applications, preparing graduates for a wide range of careers in academia, advocacy, non-profit organizations, and public service. Students will explore a diverse range of topics, including feminist theory, queer theory, transnational feminism, gender and globalization, and social justice. The program is committed to fostering a supportive and inclusive learning environment where students can engage in critical dialogue, research, and community activism. Students can choose between a Thesis or an Alternate Plan Paper (APP) to complete their degree.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/graduate/college-of-social-and-behavioral-sciences/gender-and-womens-studies/gender-and-womens-studies-ma/",
        "Accreditation status": null,
        "Program name": "Master of Arts in Gender and Women's Studies",
        "Program Page url": "https://catalog.aucegypt.edu/preview_program.php?catoid=39&poid=6921&returnto=1977"
    },
    {
        "Concentration name": null,
        "description": "The Industrial-Organizational (I-O) Psychology graduate program is a rigorous Master of Arts degree designed to prepare students for careers in I-O related fields in a variety of organizations or to enter a doctoral program. Our program follows the scientist-practitioner model of I-O psychology, which emphasizes the connection between scientific principles and professional practice. Our students receive strong foundational coursework in I-O psychology, research methods and statistics, with an emphasis in the application of this knowledge to real-world problems. The program typically requires two years of full-time study and students complete an applied research-based thesis as the capstone requirement. The program does not offer distance education options.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/industrial-organizational-psychology-ma/",
        "Accreditation status": null,
        "Program name": "Master of Arts in Industrial-Organizational Psychology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Literature and English Studies is an innovative, flexible graduate program that emphasizes multiculturalism and interdisciplinary studies. Students choose from a range of courses in literary and cultural studies, creative writing, linguistics, literature, rhetoric, and writing studies to suit their scholarly, professional, and personal goals. The program has particular strengths in American multicultural literatures, children's and young adult literature, creative writing, cultural studies, contemporary literary theory, linguistics, and rhetoric and composition. The program offers a thesis and an alternate plan paper option. Recent graduates have pursued PhDs and MFAs at programs across the country; have taught at the secondary and postsecondary levels; have become professional writers, editors, and librarians; and have assumed positions in a range of public and private sector jobs.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/literature-and-english-studies-ma/",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Literature and English Studies",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Teaching English to Speakers of Other Languages (MA in TESOL) is a professional degree designed for those who wish to teach English to speakers of other languages in a variety of settings in the United States or abroad. The program provides a strong foundation in the theoretical and pedagogical aspects of second language acquisition, linguistics, cross-cultural communication, and language teaching methodology. Graduates are prepared for careers as ESL/EFL teachers, curriculum developers, program administrators, and teacher trainers in K-12 public and private schools, community colleges, universities, and private language institutes.",
        "program website url": "https://www.mnsu.edu/programs/teaching-english-to-speakers-of-other-languages/teaching-english-to-speakers-of-other-languages-ma/",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Teaching English to Speakers of Other Languages",
        "Program Page url": "https://www.mnsu.edu/programs/teaching-english-to-speakers-of-other-languages/teaching-english-to-speakers-of-other-languages-ma/"
    },
    {
        "Concentration name": [
            "Academic and Behavioral Strategist",
            "Agriculture",
            "Art",
            "Business",
            "Chemistry",
            "Communication Arts & Literature",
            "Developmental Disabilities",
            "Early Childhood",
            "Earth & Space Science",
            "Emotional Behavioral Disorders",
            "Family and Consumer Science",
            "Health",
            "Learning Disabilities",
            "Life Science",
            "Mathematics",
            "Music",
            "Physical Education",
            "Physics",
            "Social Studies",
            "Spanish",
            "TESL",
            "Technology Education",
            "Theatre Arts"
        ],
        "description": "The Master of Arts in Teaching (MAT) is an initial teacher licensure program for individuals with a bachelor's degree who want to become a K-12 or secondary teacher. Students can choose from a number of different licensure areas. The coursework is delivered in a blended format - a mix of online and face-to-face instruction - and field experiences take place in K-12 schools. Once accepted into the MAT program, faculty will review your transcripts to develop a course of study for you to meet the Minnesota licensure requirements and complete the MAT degree. Our MAT students have a broad range of life experiences and education that lead them to become teachers. The MAT program values these different experiences and the variety of perspectives students bring to the program and to the classroom.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/master-of-arts-in-teaching-k-12-and-secondary-programs-mat/",
        "Accreditation status": "The College of Education at Minnesota State University, Mankato is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master's",
        "Program name": "Master of Arts in Teaching: K-12 and Secondary Programs (MAT)",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Minnesota State Mankato MBA is a 30-credit graduate program that offers an innovative approach to business education within a flexible format that allows students to enroll part-time or full-time. Classes are a mixture of online and synchronous remote, which provides flexibility along with interaction and networking with faculty and classmates. The curriculum is designed to provide a broad-based, cross-functional understanding of business principles and their application in a global context.",
        "program website url": "https://mankato.mnsu.edu/academics/college-of-business/master-of-business-administration/",
        "Accreditation status": "AACSB-International",
        "Level": "MBA",
        "Program name": "Master of Business Administration (MBA)",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "fiction, creative nonfiction, and poetry",
        "description": "The Master of Fine Arts in Creative Writing at Minnesota State University, Mankato, is a three-year, 48-credit-hour program offering concentrations in fiction, creative nonfiction, and poetry. MFA candidates take a variety of specialized workshops and literature courses and typically complete a creative thesis of high literary merit. The MFA program is home to the Blue Earth Review, a national literary journal; the Good Thunder Reading Series, which brings a diverse roster of professional writers to campus each year; and it is an AWP-certified program. Students receive full financial support in the form of teaching assistantships, which include a full tuition waiver and a competitive stipend. Our program prides itself on giving students substantial pedagogical training and diverse teaching experiences. All of our graduate assistants have the opportunity to teach first-year composition and creative writing.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-programs/english/creative-writing-mfa/",
        "Accreditation status": "AWP-certified program",
        "level": "MFA",
        "Program name": "Master of Fine Arts in Creative Writing",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "acting, directing, costume design, scenic design, lighting design, and sound design",
        "description": "The Master of Fine Arts (MFA) in Theatre Arts is a terminal degree program, providing students with pre-professional training in one of six areas of emphasis: acting, directing, costume design, scenic design, lighting design, and sound design. The MFA degree is designed to provide students with the highest level of training possible in a particular area of theatre, while also providing a well-rounded education in the art of theatre. Graduate students work with faculty on a one-to-one basis and have the opportunity to showcase their work through a variety of production opportunities both on and off campus.",
        "program website url": "https://www.mnsu.edu/programs/theatre-arts/theatre-and-dance-mfa/",
        "Accreditation status": "The Department of Theatre and Dance is an accredited institutional member of the National Association of Schools of Theatre (NAST).",
        "Program name": "Master of Fine Arts in Theatre Arts",
        "Program Page url": "https://www.mnsu.edu/programs/theatre-arts/theatre-and-dance-mfa/"
    },
    {
        "Concentration name": "Community Health Education, Public Health Practice",
        "description": "The Master of Public Health (MPH) degree at Minnesota State University, Mankato is designed for students from a variety of undergraduate disciplines who are looking for a career in public health. The program provides the foundational knowledge, skills, and abilities to be a successful public health professional. The MPH program has two concentrations, Community Health Education and Public Health Practice. The program is offered online in an asynchronous format and can be completed in as few as 1.5 years of full-time study. Students in the program must complete 42 credits including 24 core credits, 12 concentration credits, and 6 culminating credits. The Community Health Education concentration has a curriculum designed to provide graduates with the skills to sit for the Certified Health Education Specialist (CHES) exam. The Public Health Practice concentration allows students to select 12 credits of graduate elective courses based on professional interests.",
        "program website url": "https://www.mnsu.edu/academics/college-of-allied-health-and-nursing/school-of-nursing/departments/health-science/public-health-mph/",
        "Accreditation status": "The Master of Public Health program at Minnesota State University, Mankato is an applicant for accreditation by the Council on Education for Public Health (CEPH). The accreditation review will address the Master of Public Health program. Other degrees and areas of study offered by this institution are not included in the unit of accreditation review.",
        "Program name": "Master of Public Health (MPH)",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Advanced Dental Therapy (MSADT) is the first of its kind in the nation. This program provides access to education for licensed dental hygienists to advance their careers as dental therapists. The program is offered in a hybrid format. Most of the courses can be taken online to accommodate students anywhere in the state, nation, or world. Students attend intensive simulation and clinical skills development sessions on campus during the summer. During the second year of the program, students will practice under the supervision of a dentist at a clinical site. Graduates of the MSADT program will be eligible to be licensed as dental therapists and certified as advanced dental therapists.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/advanced-dental-therapy-ms/",
        "Accreditation status": "The Advanced Dental Therapy program is accredited by the Commission on Dental Accreditation and has been granted the accreditation status of “initial accreditation.” The Commission is a specialized accrediting body recognized by the United States Department of Education. The Commission on Dental Accreditation can be contacted at (312) 440-4653 or at 211 East Chicago Avenue, Chicago, IL 60611. The Commission’s web address is: http://www.ada.org/en/coda.",
        "Level": "Master",
        "Program name": "Master of Science in Advanced Dental Therapy",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Applied Anthropology at Minnesota State University, Mankato provides students with training in the three subdisciplines of cultural anthropology, archaeology, and biological anthropology. The program is designed to provide graduates with a balance of theoretical knowledge, methodological skills, and practical experience that prepares them to apply anthropology in a variety of career settings. Students may complete either a thesis or an alternate plan paper/project. Students may also complete a Graduate Certificate in GIS while pursuing their MS degree.",
        "program website url": "https://www.mnsu.edu/academic-catalog/graduate/applied-anthropology-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Anthropology",
        "Program Page url": "https://www.mnsu.edu/academic-catalog/graduate/applied-anthropology-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Athletic Training (MSAT) program is for students who want to become a certified athletic trainer and have a bachelor’s degree in a discipline other than athletic training. This professional program prepares students with the knowledge and skills necessary to prevent, assess, treat and rehabilitate injuries that happen to a physically active population. Upon graduation from the program, students are eligible to sit for the Board of Certification (BOC) exam.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/athletic-training-ms/",
        "Accreditation status": "The Athletic Training program is accredited by the Commission on Accreditation of Athletic Training Education (CAATE).",
        "Level": "Master's",
        "Program name": "Master of Science in Athletic Training",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science (MS) in Aviation is a fully online, 30-credit-hour program that is tailored to working professionals. This program is a collaboration between Minnesota State University, Mankato and Florida Institute of Technology. Students may apply to either institution and will graduate with a degree from their chosen institution. Coursework is designed to prepare graduates to advance within the aviation industry, in roles such as airline management, airport management, flight department management, aviation safety management and more.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/aviation-ms/",
        "Accreditation status": "The Master of Science in Aviation is accredited by the Aviation Accreditation Board International (AABI).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Aviation",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The College Student Affairs (CSA) program is a 40-credit master's degree program that prepares students to work in a variety of student affairs and student support roles at institutions of higher education. Student affairs professionals are dedicated to fostering holistic student success and development in postsecondary education. Students may take classes on a part-time or full-time basis, with most courses offered in the evenings in a face-to-face format to accommodate student schedules.",
        "program website url": "https://www.mnsu.edu/academics/college-of-allied-health-and-nursing/school-of-nursing/counseling-and-student-personnel/college-student-affairs-ms/",
        "Accreditation status": "The curriculum exceeds the standards for student affairs graduate programs jointly established by the Council for the Advancement of Standards (CAS).",
        "Level": "Master of Science",
        "Program name": "Master of Science in College Student Affairs",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Strategic Communication, Communication Studies",
        "description": "The Master of Science in Communication & Media prepares students for a wide variety of communication professions in business, industry, government, and education as well as for further graduate study. The M.S. in Communication & Media offers tracks in strategic communication and communication studies. Our curriculum blends theory and application, providing students with advanced critical thinking, research, writing, and presentation skills. Students benefit from small class sizes, personalized academic advising, and an option to complete an original thesis or a creative/professional project as a capstone experience.",
        "program website url": "https://hss.mnsu.edu/about/departments/department-of-communications-and-media/communication-and-media-graduate-programs/",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Communication and Media",
        "Program Page url": "https://hss.mnsu.edu/about/departments/department-of-communications-and-media/communication-and-media-graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science (M.S.) education program in speech-language pathology at Minnesota State University, Mankato is designed for students wishing to pursue careers as speech-language pathologists. Students have the opportunity to specialize in a variety of areas, including autism, school-based issues, voice, fluency, aural rehabilitation, adult neurogenics, traumatic brain injury, dysphagia, and augmentative/alternative communication. The M.S. program is a full-time, 2-year (5 semesters, including summer) program of study. Students complete a minimum of 52 credit hours of academic and clinical work.",
        "program website url": "https://sbs.mnsu.edu/academics/communication-sciences-and-disorders/graduate-program/",
        "Accreditation status": "The Master of Science (M.S.) education program in speech-language pathology at Minnesota State University, Mankato is accredited by the Council on Academic Accreditation in Audiology and Speech-Language Pathology of the American Speech-Language-Hearing Association, 2200 Research Boulevard, #310, Rockville, MD 20850, 800-498-2071 or 301-296-5700.",
        "Level": "Master of Science",
        "Program name": "Master of Science in Communication Sciences and Disorders",
        "Program Page url": "https://apps.asha.org/eweb/ashadynamicpage.aspx?efk=d46e010f-472c-407b-b5c9-8702b067f904&efp=160&site=ashacms&webcode=edfinddetail"
    },
    {
        "Concentration name": null,
        "description": "The MS in Computer Engineering program prepares students for leadership roles in research, development, and design positions that require skillful and imaginative solutions to complex engineering problems. It offers a choice between a Thesis or a Coursework option. The program improves the analytical skills of students by requiring a balance of theory and application in the computer engineering area. It builds a solid foundation for those students who desire to pursue a Ph.D. degree.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/computer-engineering-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Computer Engineering",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science program in Computer Science is designed to give the student advanced knowledge of the field and to provide an enduring foundation for future professional growth. The program blends theoretical foundations of computer science with the state-of-the-art in software and hardware technology. It is appropriate for students who wish to obtain a terminal degree as well as for those who wish to continue to a doctoral program. The program is flexible enough to accommodate both students with an undergraduate degree in computer science and students with an equivalent of a minor in computer science and a bachelor’s degree in some other field.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-programs/graduate/computer-science-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Computer Science",
        "Program Page url": "https://catalogs.northwestern.edu/tgs/computer-science/computer-science-ms/"
    },
    {
        "Concentration name": "Data Science",
        "description": "The Master of Science in Computer Science and Information Technology program has a strong applied/research focus. Students are trained in state-of-the-art topics and are prepared for careers in the computer industry or to pursue a Ph.D. degree. The program is flexible and allows students to specialize in areas such as artificial intelligence, software engineering, databases, networking, security, etc. The graduate program also offers a data science concentration. The College of Science, Engineering and Technology has an on-campus supercomputer, which ranks as one of the largest in the region. Graduate students from a number of disciplines may have an opportunity to conduct research using the supercomputer.",
        "program website url": "https://cset.mnsu.edu/departments/computer-information-science/computer-science-and-information-technology-ms/",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Computer Science and Information Technology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": [
            "College Student Affairs",
            "Professional School Counseling"
        ],
        "description": "The Master of Science in Counseling and Student Personnel is a graduate program that prepares students for careers in college student affairs or school counseling. Students in the Counseling and Student Personnel program are encouraged to excel academically, professionally, and personally. The program’s mission is to prepare ethical and multiculturally competent professionals who promote the academic, career, and personal/social development of the diverse individuals, families, and communities they serve.",
        "program website url": "https://ed.mnsu.edu/academic-programs/counseling-student-personnel/master-of-science-in-counseling-and-student-personnel/about/",
        "Accreditation status": "The Professional School Counseling concentration is accredited by the Council for the Accreditation of Counseling and Related Educational Programs (CACREP). The College Student Affairs concentration is nationally recognized and follows the standards of the Council for the Advancement of Standards in Higher Education (CAS).",
        "Program name": "Master of Science in Counseling and Student Personnel",
        "Program Page url": "https://ed.mnsu.edu/academic-programs/counseling-student-personnel/master-of-science-in-counseling-and-student-personnel/about/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Criminal Justice is designed for both pre-service students wishing to continue their education and in-service professionals looking for career advancement. The program provides the knowledge and skills necessary to critically analyze the criminal justice system and its policies; to evaluate and conduct research that addresses issues and problems in criminal justice; and to apply theoretical perspectives to crime and criminal justice issues. The degree provides excellent preparation for further graduate study in criminal justice and related fields.",
        "program website url": "https://www.mnsu.edu/programs/criminal-justice-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Criminal Justice",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Principal, Director of Special Education",
        "description": "The Master of Science (M.S.) degree in Educational Leadership is designed for licensed teachers who wish to pursue a career in K-12 administration. The program is designed to develop aspiring principals and directors of special education into instructional leaders with the knowledge, skills and dispositions to lead in a diverse, global society. Our program curriculum is aligned to Minnesota requirements for principal and director of special education licensure as well as the National Educational Leadership Preparation (NELP) standards for building-level leaders. Courses focus on leading learning, managing school operations, navigating school law and finance, engaging communities, understanding diversity and advocating for all students. Our graduates become principals, assistant principals, deans of students, athletic directors, community education directors, directors of special education and a variety of other school leadership positions.",
        "program website url": "https://www.mnsu.edu/programs/educational-leadership/educational-leadership-ms/",
        "Accreditation status": "Approved by the Minnesota Professional Educator Licensing and Standards Board (PELSB). Aligned with National Educational Leadership Preparation (NELP) standards.",
        "Program name": "Master of Science in Educational Administration",
        "Program Page url": "https://www.mnsu.edu/programs/educational-leadership/educational-leadership-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Educational Leadership program at Minnesota State University, Mankato offers a master's degree (M.S.), a specialist degree (Ed.S.), a doctorate (Ed.D.), a principal licensure, a superintendent licensure, and a director of special education licensure. The Department of Educational Leadership is committed to developing innovative and transformative leaders through a supportive, flexible, and rigorous curriculum. The M.S. is a 34-credit program that prepares future administrators with a core of knowledge, skills and dispositions necessary to be effective as school leaders and administrators in K-12 school systems.",
        "program website url": "https://www.mnsu.edu/programs/educational-leadership/educational-leadership-ms/",
        "Accreditation status": "The Educational Leadership program is accredited through the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Educational Leadership",
        "Program Page url": "https://www.mnsu.edu/programs/educational-leadership/educational-leadership-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Educational Technology program meets the needs of educators who wish to further develop their professional capabilities in the integration of technology into teaching and learning. The program goals include enabling educators to advance their skills in the effective use of educational technology, preparing them to assume leadership roles in their schools/districts and providing a solid foundation for those wishing to continue their graduate studies. This program is available online only. All of the programs in the department require applicants to pass a criminal background check before they may be fully admitted.",
        "program website url": "https://www.mnsu.edu/academics/academic-catalog/graduate-catalog/college-of-education/educational-studies-k-12-and-secondary-programs/educational-technology-ms/",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Educational Technology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Electrical and Computer Engineering Department offers a Master of Science degree in Electrical Engineering. The MSEE Program has been offered since 1984. The program of study is structured to serve both full-time and part-time students. The main objective of the program is to provide graduate students with the opportunity for advanced study and research in a number of specialty areas in electrical engineering. The MSEE program strengthens the student’s fundamental knowledge, and provides an opportunity for in-depth studies in a major field and related minor fields. The graduate courses are taught by faculty who are actively pursuing research and have developed a reputation in their areas of research expertise. The graduate program provides a balance between theory and practice, and prepares the graduate student for an advanced career in industry as well as for further study for a Ph.D. degree.",
        "program website url": "https://cset.mnsu.edu/departments/ece/programs/msee/",
        "Accreditation status": null,
        "Program name": "Master of Science in Electrical Engineering",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Elementary Education is a 34-credit graduate program designed to meet the needs of elementary teachers who desire to continue their professional growth. Teachers will focus on reflective practice and research to gain knowledge, skills, and dispositions to make a positive impact on student learning. A K-6 academic and behavior interventionist certificate may also be earned concurrently or after completion of the degree.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/elementary-education-ms/",
        "Accreditation status": "The Elementary Education MS program is accredited under Minnesota State University, Mankato's NCATE/CAEP accreditation and by the Minnesota Professional Educator and Licensing Standards Board (PELSB).",
        "Program name": "Master of Science in Elementary Education",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Elementary Teaching Master of Science is designed for people who have a bachelor’s degree from an accredited university in a major other than elementary education. The program leads to a Minnesota K-6 Elementary Teaching License. The program is offered fully online except for face-to-face field experience/student teaching. The purpose of this program is to prepare culturally responsive teachers who can work effectively in elementary schools with diverse student populations. The mission of the Department of Elementary and Literacy Education is to promote equity and excellence in education by preparing knowledgeable, reflective, and caring practitioners who are informed by theory and research.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/elementary-teaching-ms/",
        "Accreditation status": "The professional education programs in the College of Education at Minnesota State University, Mankato are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master's",
        "Program name": "Master of Science in Elementary Teaching",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": [
            "Automotive Engineering",
            "Manufacturing Engineering",
            "General Engineering",
            "Engineering Management"
        ],
        "description": "The mission of the Master of Science in Engineering (MSE) is to serve the needs of engineers in the region and beyond by preparing them for advanced practice-oriented careers. The program will provide graduate students with advanced engineering topics in emerging cross-disciplinary areas. The faculty will mentor graduate students in conducting research projects with direct application to product development and design/process improvement, and to advance their career development.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/engineering-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Engineering",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Literature",
        "description": "The MA in English: Literature provides students with advanced knowledge of literary history and theory and prepares them for further graduate study in literature or for careers requiring advanced literary and cultural expertise. Students pursue a broad range of interests, from ancient to contemporary literature in a variety of genres. The program culminates in a traditional research-based thesis, a creative thesis, or an alternate plan paper.",
        "program website url": "https://www.mnsu.edu/programs/english/literature-ma/",
        "Accreditation status": null,
        "Program name": "Master of Science in English",
        "Program Page url": "https://www.mnsu.edu/programs/english/literature-ma/"
    },
    {
        "Concentration name": null,
        "description": "The English Language Studies M.S. focuses on developing students’ research, writing, and presentation skills within a specialized curriculum. Students will be able to apply their advanced knowledge of the English language to a variety of educational and professional contexts. The program provides advanced training for students interested in studying the English language from a variety of perspectives. In particular, it combines general and applied linguistics with literary and composition studies. The program prepares students who want to continue their graduate education and those who intend to enter the work force.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/english-language-studies-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in English Language Studies",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Ethnic and Multi-Cultural Studies graduate program is an interdisciplinary program that provides students with an intellectually rigorous and compassionate space for the critical study of race, ethnicity, class, gender and sexuality as they intersect and shape the lives of individuals and groups around the world. The graduate program provides students with knowledge about the interdisciplinary fields of Ethnic Studies, Gender and Women’s Studies, and LGBTQ Studies as well as a range of research methods, approaches and theories. Our curriculum focuses particularly on issues of power and social justice. Students develop the skills to analyze, articulate, and write about complex intersectional identities, systems of oppression and strategies of resistance. Students develop their particular research and professional interests through specialized courses, an internship or thesis, and an extended research project.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/ethnic-and-multi-cultural-studies-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Ethnic and Multi-Cultural Studies",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Ethnic Studies master's program at Minnesota State University, Mankato is the oldest and only stand-alone graduate program in the state and region. We are an innovative, interdisciplinary, and critical program committed to social justice. Our program is nationally-recognized for its excellence and for producing outstanding students that have gone on to doctoral programs and to work in a variety of fields including student affairs, non-profit management, and community organizing. We offer a 30-credit thesis plan and a 34-credit alternate plan paper/creative project. Our curriculum explores the intersections of race, class, gender, and sexuality with a focus on African American, American Indian, Asian American and Latinx Studies. Students are encouraged to develop their own area of emphasis. Recent graduate research has examined environmental racism, social movements, indigenous education, hip hop culture, and critical mixed-race studies.",
        "program website url": "https://www.mnsu.edu/academics/ethnic-studies-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Ethnic Studies",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science degree in Exercise Physiology is designed to provide students with a comprehensive understanding of the physiological responses and adaptations to exercise. The curriculum is divided into two parts: a 21-credit core curriculum and a 12-credit choice of either a thesis or alternate plan paper (APP) research option. Students will be well-prepared to successfully take one or both of the top two certifications in the field through the American College of Sports Medicine (ACSM), the Certified Exercise Physiologist (EP-C) and the Certified Clinical Exercise Physiologist (CEP). This program prepares students for a variety of careers in academic, clinical, corporate, and athletic settings, or for further graduate study in doctoral or other professional programs.",
        "program website url": "https://cah.mnsu.edu/departments/human-performance/academic-programs/exercise-physiology-ms/",
        "Accreditation status": "The graduate program in Exercise Physiology at Minnesota State University, Mankato is accredited by the Commission on Accreditation of Allied Health Education Programs (www.caahep.org) upon the recommendation of the Committee on Accreditation for the Exercise Sciences (CoAES).",
        "Program name": "Master of Science in Exercise Physiology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Exercise Science provides an opportunity for students to acquire cognitive knowledge, research tools, and laboratory skills in preparation for careers in the exercise sciences as well as for entrance into post-graduate studies (e.g. physical therapy, occupational therapy, medical school, Ph.D. programs). The program prepares students as scientists and practitioners who are able to apply scientific principles to the study of human movement in both clinical and athletic settings. The program is flexible in that it allows students to take courses in several different areas based on their interests. With the guidance of an advisor, students create a program of study in areas such as exercise physiology, clinical exercise physiology, cardiac rehabilitation, biomechanics, and strength and conditioning. The MS in Exercise Science is completed with either a thesis or an alternate plan paper. Our program provides ample opportunities for hands-on research and applied experiences. Students have the opportunity to work alongside faculty on a variety of research topics. These experiences often lead to presentations at regional and national conferences, as well as publications in peer-reviewed scientific journals. The program works closely with Campus Recreation, the Maverick Sports Medicine Program, and local partners to offer a number of graduate assistantships. Students have an opportunity to participate in hands-on clinical and sport performance experiences through the Human Performance Lab. Students can gain experience by: Working with patients in our Phase II Cardiac Rehabilitation program. Performing exercise testing (e.g., VO2max, anaerobic power, etc.) on athletes and general population clients. Working with athletes in the Maverick Sports Performance Program. Performing body composition assessments (e.g., DEXA, BodPod, skinfolds). Participating in community engagement activities, such as health and fitness fairs.",
        "program website url": "https://www.mnsu.edu/hp/exsc/ms-in-exercise-science/",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Exercise Science",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science degree in Gender and Women's Studies is an interdisciplinary program designed to provide students with a deep understanding of the complex ways in which gender and other social identity categories shape the human experience. The program provides a substantial and rigorous course of study that enables students to critically examine gender as it intersects with other categories of difference such as race, ethnicity, class, sexuality, and disability. The graduate program also trains students to apply intersectional feminist analysis to a variety of social issues and problems. The program prepares students for a variety of careers in human services, advocacy, education, non-profit organizations, and social justice activism. It also prepares students who wish to pursue a doctoral degree. Gender and Women's Studies offers two capstone options for students: thesis and alternate plan paper (APP).",
        "program website url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2024-2025-academic-catalog/graduate/gender-and-womens-studies-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Gender and Women's Studies",
        "Program Page url": "https://mankato.mnsu.edu/academics/academic-catalog/all-active-catalogs/2024-2025-academic-catalog/graduate/gender-and-womens-studies-ms/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Geography is a versatile degree, designed to meet the career needs of students from a wide array of undergraduate backgrounds. With thesis and alternate plan paper options, the program offers a graduate-level curriculum that includes a wide array of courses covering the major sub-fields of geography. This degree option can also serve students seeking a PhD in Geography. A Master of Science in Geography also prepares students to enter the job market with an advanced set of geographical and technical skills.",
        "program website url": "https://cahss.mnsu.edu/departments/geography/academics/ms-in-geography/",
        "Accreditation status": null,
        "Program name": "Master of Science in Geography",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "U.S. History, European History, Non-Western History",
        "description": "The Master of Science in History provides students with an advanced understanding of the human past. The program is designed to meet the needs of a wide range of students, from those who want to teach in community colleges, to those who want to enhance their careers as high school teachers, to those who plan to pursue a PhD in history. Students may tailor their programs of study to fit their academic and career interests. All students complete a common core of courses that introduce them to the practice of history at the graduate level. Students then work with their advisors to develop an area of concentration in either U.S., European, or non-western history and a minor field. Students have the option of completing their program with a thesis, an alternate plan paper, or a comprehensive written exam.",
        "program website url": "https://www.mnsu.edu/programs/history-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in History",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Information Technology (MSIT) program at Minnesota State University, Mankato is a 30-credit graduate program that prepares students for advanced careers in the dynamic and ever-evolving field of information technology. The MSIT program is designed for individuals who have an aptitude for applying computing to business problems. The program is specifically designed to bridge the gap between information technology and business, giving students a unique blend of technical and management skills. Students enrolled in the MSIT program benefit from an innovative curriculum and state-of-the-art facilities. They have access to courses in areas such as software engineering, database management, project management, business intelligence and data analytics. Students can also specialize their degree through a choice of electives, which allows them to explore their individual interests and career goals. Throughout the program, students have numerous opportunities to participate in real-world projects and internships, which provides them with hands-on experience and a chance to build their professional network. Graduates of the MSIT program are well-equipped to take on leadership roles in the IT industry. They possess the knowledge, skills, and experience to design, develop, and manage complex IT systems, and they are prepared to tackle the challenges of the rapidly changing technological landscape. Our graduates go on to successful careers in a variety of industries, including healthcare, finance, manufacturing, and consulting.",
        "program website url": "https://cset.mnsu.edu/departments/computer-information-science/ms-in-information-technology/",
        "Accreditation status": null,
        "Program name": "Master of Science in Information Technology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "mechatronics, lean manufacturing, or quality management",
        "description": "The Manufacturing Engineering Technology program provides students with the advanced skills to develop and transform new materials into products. The curriculum provides a broad background in manufacturing processes, lean manufacturing, quality control, digital manufacturing, robotics, automation, and manufacturing management. The program offers a hands-on learning environment where students apply their learning to real-world projects. Students will also be able to work with state-of-the-art software and tools in their coursework. The program requires 30-34 graduate credits depending on the student’s choice of completing a thesis or an alternate plan paper. Students can choose a specialization in mechatronics, lean manufacturing, or quality management.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/manufacturing-engineering-technology-ms/",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Manufacturing Engineering Technology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": [
            "Mathematics Emphasis",
            "Applied Statistics Emphasis"
        ],
        "description": "Minnesota State Mankato's Mathematics and Statistics M.S. program features a large and diverse faculty offering a broad spectrum of advanced topics. The flexible curriculum is tailored to the student's career objectives and is ideal for working professionals. Students also gain experience using sophisticated mathematical and statistical software. Choose a Thesis Plan or an Alternate Plan Paper. Research and scholarly activities abound. Students often present their scholarly work at regional conferences.",
        "program website url": "https://www.mnsu.edu/math-and-stats-ms",
        "Accreditation status": null,
        "Program name": "Master of Science in Math and Stats",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Master of Science in Mental Health Counseling",
        "Program Page url": "https://www.tc.columbia.edu/counseling-and-clinical-psychology/counseling/degrees--requirements/psychological-counseling-mental-health-counseling-edm/"
    },
    {
        "Concentration name": null,
        "description": "The Recreation, Parks, and Leisure Services department is committed to educating professionals who enhance the quality of life for all people through the provision of recreation, parks, and leisure services. The Department of Recreation, Parks, and Leisure Services at Minnesota State Mankato is a nationally recognized leader and is one of the largest and most established programs in the United States. We seek students who are excited to grow as leaders and committed to becoming outstanding professionals.",
        "program website url": "https://www.mnsu.edu/programs/recreation-and-parks-leadership-studies/",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Parks, Recreation and Leisure Studies",
        "Program Page url": "https://www.mnsu.edu/programs/recreation-and-parks-leadership-studies/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Reading program is designed to meet the Minnesota requirements for the K-12 Reading Teacher license and to prepare reading specialists for a variety of educational settings. All graduate students seeking a Master of Science in Reading will gain expertise in literacy processes and instruction for all students, including those who are culturally and linguistically diverse. Students receive advanced preparation in literacy foundations, theory, research, assessment and instruction. The program emphasizes the use of evidence-based practices to develop, implement, and evaluate literacy instruction. It is grounded in a socio-psycholinguistic and sociocultural perspective of literacy that focuses on comprehension as the center of all reading and writing processes. The M.S. in Reading has two options: Option 1: K-12 Reading Teacher Licensure & Option 2: Non-Licensure. The M.S. in Reading is a fully online program. Students may be admitted any term. All coursework is designed to support practicing educators. Assignments are job-embedded and require access to K-12 students. Most students take 1-2 courses per term and complete the program in two years.",
        "program website url": "https://ed.mnsu.edu/academic-programs/reading/masters-of-science-in-reading/",
        "Accreditation status": null,
        "Program name": "Master of Science in Reading",
        "Program Page url": "https://ed.mnsu.edu/academic-programs/reading/masters-of-science-in-reading/"
    },
    {
        "Concentration name": [
            "Academic & Behavioral Strategist (ABS)",
            "Autism Spectrum Disorders (ASD)",
            "Developmental Disabilities (DD)",
            "Emotional/Behavioral Disorders (EBD)",
            "Learning Disabilities (LD)"
        ],
        "description": "The Master of Science (MS) degree in Special Education is designed to develop leaders in special education who possess the knowledge and skills to improve the lives of individuals with disabilities. The MS degree will prepare you to work in schools, community-based programs, residential treatment centers, and other settings where services are provided to children and youth with disabilities. Our programs also may lead to a Minnesota teaching license. Minnesota State Mankato's Special Education Master's degree is a 34-credit program. If you are seeking initial or additional licensure, your credit total may exceed 34 credits.",
        "program website url": "https://www.mnsu.edu/academics/special-education-ms/",
        "Accreditation status": "Accredited by the Council for the Accreditation of Educator Preparation (CAEP)",
        "Program name": "Master of Science in Special Education",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Academic Behavioral Strategist (ABS), Autism Spectrum Disorders (ASD), Special Education MS (non-licensure)",
        "description": "The Master of Science in Special Education and Teaching is a fully online graduate degree program in special education that provides advanced professional training for special educators and other professionals working with individuals with disabilities. The program offers tracks for candidates seeking initial licensure in special education or for those who are already licensed in the field and are seeking an advanced degree. Special education licenses are offered in Academic Behavioral Strategist (ABS) and Autism Spectrum Disorders (ASD).",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/special-education-ms/",
        "Accreditation status": "The College of Education at Minnesota State University, Mankato is accredited by the Council for the Accreditation of Educator Preparation (CAEP). This program is also approved by the Minnesota Professional Educator Licensing and Standards Board (PELSB).",
        "Program name": "Master of Science in Special Education and Teaching",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Technical Communication program offers a comprehensive curriculum that prepares students for careers in the dynamic and growing field of technical communication. This program is designed to equip students with the advanced skills and knowledge needed to effectively communicate complex technical information to diverse audiences. Key areas of focus include user experience (UX) design, content strategy, instructional design, information architecture, and digital media production. Students will learn to create and manage various forms of technical content, such as user manuals, online help systems, training materials, and website content. The program emphasizes a hands-on, project-based learning approach, allowing students to build a professional portfolio that showcases their abilities. Graduates are well-prepared for leadership roles in industries such as software development, healthcare, engineering, and education, working as technical writers, content strategists, UX researchers, instructional designers, and information architects.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate-programs/technical-communication/",
        "Accreditation status": null,
        "Program name": "Master of Science in Technical Communication",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Teaching (MST) Elementary Education is a rigorous and highly-esteemed program for individuals who have previously earned a bachelor’s degree in a field other than education and who wish to become an elementary classroom teacher. The MST program has a hybrid delivery, on-campus in Mankato or online. Upon successful completion of the program, students graduate with a Master of Science in Teaching degree and an initial Minnesota teaching license to teach children in grades kindergarten through sixth (K-6). The program requires 36 graduate credits for the master's degree and can be completed in as little as 15 months (one summer and two semesters).",
        "program website url": "https://www.mnsu.edu/academics/college-of-education/departments/elementary-and-literacy-education/mst-elementary-education/",
        "Accreditation status": "Minnesota State University, Mankato is accredited by the Higher Learning Commission. All educator preparation programs are accredited by the Minnesota Professional Educator Licensing and Standards Board (PELSB). In addition, the college is a member of the American Association of Colleges of Teacher Education (AACTE) and programs are reviewed by a number of specialized professional organizations. We are currently a CAEP candidate for accreditation.",
        "Program name": "Master of Science in Teaching: Elementary Education",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": [
            "Academic and Behavioral Strategist",
            "Art Education",
            "Chemistry",
            "Communication Arts and Literature",
            "Dance",
            "Developmental Disabilities",
            "Early Childhood Education",
            "Earth and Space Science",
            "Elementary Education",
            "English as a Second Language",
            "Health",
            "Instrumental Music",
            "Life Science",
            "Mathematics",
            "Physical Education",
            "Physics",
            "Social Studies",
            "Spanish",
            "Vocal Music",
            "World Languages and Cultures"
        ],
        "description": "The Master of Science in Teaching (MST) degree is designed for individuals who hold an undergraduate degree in a discipline other than education and wish to pursue a teaching license and a master's degree simultaneously. Candidates pursue one of the following licensure areas and complete coursework in that licensure area in addition to foundational coursework and a final research project.\nProgram Highlights:\n- Flexible learning formats (online, on campus, hybrid)\n- Licensure-only option\n- Part-time or full-time enrollment\n- Financial aid available\n- Master's degree may lead to a salary increase\n- Dedicated faculty advisors",
        "program website url": "https://ed.mnsu.edu/academic-programs/K12-secondary-programs/",
        "Accreditation status": "All of our educator preparation programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP) and approved by the Minnesota Professional Educator Licensing and Standards Board (PELSB).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Teaching: K-12 and Secondary Programs",
        "Program Page url": "https://ed.mnsu.edu/academic-programs/K12-secondary-programs/"
    },
    {
        "Concentration name": "Academic and Behavioral Strategist (ABS)",
        "description": "The Master of Science in Teaching (MST): Special Education is a 34-credit online graduate program designed for individuals who hold a bachelor’s degree in a field other than education who wish to become a licensed special education teacher in Minnesota in the area of Academic and Behavioral Strategist (ABS). Graduates of this program will be well-prepared to serve K-12 students with a broad range of mild to moderate disabilities (learning disabilities, emotional and behavioral disorders, developmental cognitive disabilities, other health disabilities, and autism spectrum disorders).",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/teaching-special-education/",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Teaching: Special Education",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Social Work (MSW) Program is a professional degree that provides advanced social work knowledge and skills to students. The program is designed to develop students’ commitment to social work values and ethics, and to prepare them for advanced generalist social work practice with individuals, families, small groups, organizations, and communities. The MSW Program is committed to preparing social workers who will provide services that are responsive to the needs of the diverse populations of Minnesota and the surrounding region. The program emphasizes the provision of services in a rural human service environment and is committed to promoting human rights and social, racial, economic and environmental justice.",
        "program website url": "https://mankato.mnsu.edu/academics/academic-programs/graduate-programs/master-of-social-work/",
        "Accreditation status": "The Minnesota State University, Mankato Master of Social Work program is fully accredited by the Council on Social Work Education’s Commission on Accreditation.",
        "Program name": "Master of Social Work (MSW)",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": [
            "Computer Science",
            "Information Technology"
        ],
        "description": "The Professional Science Master's (PSM) in Computer Science and Information Technology is a 30-credit graduate program that prepares students for rewarding careers in the fast-paced technology sector. This program offers a unique blend of technical expertise and professional skills, making graduates highly sought-after by employers. The PSM in CSIT program has two emphasis areas, Computer Science and Information Technology, each with a required internship course.",
        "program website url": "https://cset.mnsu.edu/departments/computer-information-science/psm-in-csit/",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Professional Science Master's in Computer Science and Information Technology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "K-12 Principal, Superintendent, Director of Special Education",
        "description": "The Specialist Degree in Educational Leadership is for those students who want to become a licensed principal, superintendent, and/or director of special education. The program has three strands of licensure: K-12 Principal, Superintendent, and Director of Special Education. It is a 34-credit program beyond a master’s degree. Students may pursue licensure in a single area or in a combination of areas. The Specialist program is also intended for those who already have a principal license and want to earn their superintendent and/or director of special education license.",
        "program website url": "https://www.mnsu.edu/academics/academic-affairs/colleges/education/educational-leadership/programs/specialist-in-educational-leadership/",
        "Accreditation status": "The Educational Leadership programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP) and approved by the Minnesota Professional Educator Licensing and Standards Board (PELSB).",
        "Level": "Specialist",
        "Program name": "Specialist in Educational Leadership",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "Minnesota State University, Mankato’s Ed.D. in Educational Leadership program is designed for P-12 educational leaders. The program aims to prepare skilled, ethical and socially responsible leaders who can create and renew educational settings that promote learning, development, and achievement for all students. Cohorts for the program begin each summer.\n\nGraduates of the program will be able to:\n1. Conduct and consume quantitative, qualitative and mixed methods research for data-driven decision making.\n2. Understand and respond to the complex issues impacting diverse communities in the 21st century.\n3. Apply ethical frameworks to the practice of educational leadership.\n4. Communicate with clarity, purpose, and sophistication in written, oral, and digital forms.\n5. Demonstrate advanced proficiency in leadership through an individually designed residency/internship.\n6. Examine and apply current and emerging theory to issues of school system practice.",
        "program website url": "https://www.mnsu.edu/academics/college-of-education/departments/educational-leadership/doctor-of-education-in-educational-leadership/",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Education in Educational Leadership",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Doctor of Education in Educational Leadership program is designed for students who already have a master’s degree and a principal’s license and aspire to become a superintendent or an educational leader in a school district, regional or state organization. The Ed.D. is a cohort-based program with a focus on preparing scholarly practitioners in the field of educational leadership. Graduates of the program are prepared to serve as educational leaders who can apply current research and theory to the solution of problems faced by schools today. The coursework has an emphasis on the superintendency and district-level leadership. The program includes the coursework needed to obtain a Minnesota superintendent license. The program culminates in a scholarly dissertation, or capstone, which is intended to be a culminating experience in the doctoral program where the candidate applies the knowledge and skills they have learned to a meaningful problem of practice.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/educational-leadership-edd/",
        "Accreditation status": "All programs in the College of Education are accredited by the National Council for Accreditation of Teacher Education (NCATE) and approved by the Minnesota Professional Educator Licensing and Standards Board (PELSB).",
        "Level": "Doctoral",
        "Program name": "Doctorate in Educational Administration",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Post-Baccalaureate to DNP, Post-Masters to DNP",
        "description": "The Doctor of Nursing Practice (DNP) degree is a practice doctorate that prepares advanced practice nurses to be clinical scholars and leaders. The focus of the DNP is on the translation of research into practice with the goal of improving patient outcomes. The degree may be obtained post-baccalaureate or post-master's. The post-baccalaureate DNP program prepares students for certification in an advanced practice nursing specialty role as a Family Nurse Practitioner (FNP). The Post-Master's DNP program is for certified advanced practice registered nurses (APRNs).\n\nAll courses are delivered online with the exception of on campus intensives. Students will also be required to complete practice/clinical hours within their own communities. Students typically attend part-time, taking six credits a semester. Full-time study is also an option.\n\nThe School of Nursing is a part of the College of Allied Health and Nursing.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/nursing-practice-dnp/",
        "Accreditation status": "The Doctor of Nursing Practice program at Minnesota State University, Mankato is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Doctorate",
        "Program name": "Doctorate in Nursing Science, Education, and Practice",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The doctoral degree in Counselor Education and Supervision requires 60 semester credits beyond the master’s degree. Students are typically licensed school counselors with at least three years of experience. The degree prepares graduates for careers as counselor educators in university settings, as school counseling program leaders, and as supervisors in school or community agencies. The program is offered via a cohort model and has an approximate three-year completion time.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/school-counseling-and-guidance-services-doctorate/",
        "Accreditation status": "The School Counseling program at Minnesota State University, Mankato is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "Level": "Doctorate",
        "Program name": "Doctorate in School Counseling and Guidance Services",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Psy.D. in School Psychology program at Minnesota State University, Mankato is designed to produce graduates who are health service psychologists and who function as practitioners within the specialty of school psychology. The program is committed to a practitioner-scholar model of training. The program is designed to provide students with a strong theoretical and practical foundation on which to base their professional work. The program also offers students the opportunity to integrate their knowledge and skills through a sequence of practica and internship experiences. The curriculum includes coursework in psychological foundations, research and evaluation methods, professional school psychology, and intervention strategies. The doctoral program is designed to be a full-time, five-year program. The first four years of the program are spent on campus, and the fifth year is spent in an internship. The program is designed to be sequential and developmental, so students should plan to take courses in the order they are offered. Students are admitted to the program once a year, in the fall semester.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate-studies/doctorate-in-school-psychology/",
        "Accreditation status": "The Doctorate (Psy.D.) in School Psychology program is accredited by the American Psychological Association (APA). The program is also approved by the National Association of School Psychologists (NASP).",
        "Level": "Doctoral",
        "Program name": "Doctorate in School Psychology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The 18-credit Applied Health Science graduate certificate program is designed for students from a variety of backgrounds who want to focus on a particular area of health science. The curriculum includes course offerings from the following programs: athletic training, communication sciences and disorders, community health education, exercise physiology, health care administration, nursing, psychology, recreation, parks and leisure services, social work and sociology. A faculty advisor works with the student to create a personalized plan of study based on the student’s professional and educational goals.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/applied-health-science-certificate/",
        "Accreditation status": null,
        "Program name": "Certificate in Applied Health Science",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Educational Technology Certificate prepares educators to integrate technology into their teaching. The program aligns with the International Society for Technology in Education (ISTE) standards for educators. Courses address technology integration, instructional design, assistive technology, and trends in the field. Graduates will learn to choose, use, and apply educational technology to promote learning.\nAfter completion of the Educational Technology Certificate, graduates will be able to:\n- Select and use a variety of technologies.\n- Apply learning theory to instructional design.\n- Design inclusive online learning environments.\n- Use a variety of assistive technologies.\n- Design and deliver professional learning experiences.",
        "program website url": "https://cah.mnsu.edu/departments/library-media-education/graduate-programs/educational-technology-certificate/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Educational Technology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Accounting provides a focused, 12-credit graduate-level curriculum in accounting for individuals who have already earned an undergraduate degree in accounting or an MBA and wish to pursue additional educational opportunities in accounting. The certificate will provide additional accounting knowledge and skills that complement the student’s business experiences and prior education. It will also help students meet the educational requirements for CPA licensure. Students are advised to check with the Board of Accountancy in the state where they intend to seek a license to determine the educational requirements to sit for the CPA exam and for licensure. The certificate is a credential that may be earned on its own or it may be pursued in conjunction with a Minnesota State Mankato MBA degree.",
        "program website url": "https://www.mnsu.edu/academics/college-of-business/departments-and-programs/accounting-and-business-law/graduate-certificate-in-accounting/",
        "Accreditation status": "Accredited by AACSB International",
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Accounting",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Aging Studies program is designed to provide students with an interdisciplinary approach to aging and is appropriate for students planning careers working with or for older adults. You'll gain broad-based knowledge of aging, skills and professional competencies in gerontology and be well-prepared for entry-level positions in the aging network. Students currently enrolled in a Minnesota State Mankato graduate program can incorporate the certificate into their curriculum. Professionals already in the field may want to enroll to enhance or update their gerontological knowledge and skills.",
        "program website url": "https://www.mnsu.edu/academics/college-of-social-behavioral-sciences/departments/sociology-corrections/aging-studies-program/aging-studies-graduate-certificate/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Aging Studies",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The certificate is designed for students seeking to update and enhance their strategic communication and media knowledge and skills. It will serve individuals who have already earned an undergraduate degree in communication and media (or related area) and are looking for professional development or a bridge to our master’s programs in communication and media. Students will tailor their elective course work to focus on one of three areas: Communication education, strategic communication, or media studies. The certificate requires 15 credits. Nine of the 15 credits may be applied to a Master of Science or Master of Fine Arts degree in Communication and Media at Minnesota State University, Mankato.",
        "program website url": "https://hss.mnsu.edu/academic-programs/communication-media/communication-and-media-graduate-programs/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Communication and Media",
        "Program Page url": "https://hss.mnsu.edu/academic-programs/communication-media/communication-and-media-graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Computer Science and Information Technology will provide students with the most current and relevant skills and knowledge necessary for professionals working with information systems in organizations. The goal of the graduate certificate is to prepare information technology professionals with a bachelor's degree for graduate studies in computer science and information technology and to provide an opportunity for professionals to acquire and update their knowledge and skills in specific areas in computer science and information technology. The graduate certificate is composed of 12 graduate credits (four 3-credit courses). An individual can pursue the certificate while working full time. All courses for the certificate can be completed in two to three semesters. Courses in the graduate certificate may be transferred to the Master of Science in Information Technology (MSIT) or the Master of Science in Computer Science (MSCS) degrees after formal admission to the MSIT or MSCS program (subject to the graduate transfer policies).",
        "program website url": "https://cset.mnsu.edu/cs/graduate-programs/graduate-certificate/",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Computer Science and Information Technology",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "College Student Affairs",
        "description": "The College Student Affairs (CSA) graduate certificate is a 12-credit certificate program designed to provide students with the foundational knowledge and skills in college student affairs work. This certificate is intended for graduate students in other programs or working professionals interested in learning more about the college student affairs field or looking for a 'stackable' credential in the field. This certificate is not a professional counseling licensure program. Credits earned can be applied towards the College Student Affairs Master's of Science (MS) program.",
        "program website url": "https://www.mnsu.edu/programs/counseling-and-student-personnel/college-student-affairs-gc/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Counseling and Student Personnel",
        "Program Page url": "https://www.mnsu.edu/programs/counseling-and-student-personnel/college-student-affairs-gc/"
    },
    {
        "Concentration name": null,
        "description": "The online Criminal Justice Graduate Certificate is designed to provide students with a broader understanding of law enforcement, corrections and the court system. This certificate is a pathway for students to continue on to the Criminal Justice Master of Science program. This certificate program does not accept PSEO or undergraduate students. The program is offered fully online.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/criminal-justice-certificate/",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Criminal Justice",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Racially Conscious School and Systems Leadership",
        "description": "The 12-credit, fully online Racially Conscious School and Systems Leadership graduate certificate program is designed for current and aspiring school and systems leaders who are invested in leading for racial equity. Through coursework and a culminating project, students will demonstrate mastery of the following competency areas: Leadership for Racial Equity, Racially Conscious Instructional Leadership, Racially Conscious Relational Leadership, and Racially Conscious Systems Leadership.",
        "program website url": "https://www.mnsu.edu/programs/educational-leadership/racially-conscious-school-and-systems-leadership-gc/",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Educational Leadership",
        "Program Page url": "https://www.mnsu.edu/programs/educational-leadership/racially-conscious-school-and-systems-leadership-gc/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Graduate Certificate in English",
        "Program Page url": "https://english.as.virginia.edu/applicants"
    },
    {
        "Concentration name": null,
        "description": "The Teaching English to Speakers of Other Languages (TESOL) graduate certificate provides post-baccalaureate students and community members a program of study in the theory and practice of second language teaching. The TESOL certificate is an excellent option for those who wish to enhance their professional credentials for teaching English as a second or foreign language in the U.S. or abroad. The certificate may be completed on its own or concurrently with a Master's degree. Students who complete the certificate gain a background in linguistic theory, second language acquisition research, and teaching methodologies.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate-programs/teaching-english-to-speakers-of-other-languages-graduate-certificate/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Teaching English to Speakers of Other Languages",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Communication Arts and Literature (grades 5-12), Mathematics (grades 5-12), Science (grades 5-8), Chemistry (grades 9-12), Earth Science (grades 9-12), Life Science (grades 9-12), Physics (grades 9-12), Social Studies (grades 5-12)",
        "description": "The K-12 and Secondary Programs (KSP) department provides instruction for undergraduate and graduate teacher candidates pursuing a teaching license in a variety of content areas at the middle and high school levels. Our teacher candidates complete content coursework in their major department, and pedagogy coursework in our department. Upon graduation, our teacher candidates have earned a bachelor’s degree in their content area, as well as a Minnesota teaching license. The Graduate Certificate in Teaching (GCT) is a 24-credit graduate level program leading to a Minnesota teaching license in one of the following content areas: Communication Arts and Literature (grades 5-12), Mathematics (grades 5-12), Science (grades 5-8), Chemistry (grades 9-12), Earth Science (grades 9-12), Life Science (grades 9-12), Physics (grades 9-12), Social Studies (grades 5-12). This program is intended for those individuals who already possess a Bachelor’s degree and are seeking a teaching license. Coursework is determined through a transcript analysis and is unique to each student. The graduate certificate requires a minimum of 24 graduate credits.",
        "program website url": "https://www.mnsu.edu/academics/college-of-education/departments/elementary-and-literacy-education/k-12-and-secondary-programs/",
        "Accreditation status": "The K-12 and Secondary Programs department is part of the College of Education which is accredited by the Council for the Accreditation of Educator Preparation (CAEP). Our programs are also approved by the Minnesota Professional Educator Licensing and Standards Board (PELSB).",
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Teaching: K-12 and Secondary Programs",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Teaching: Reading Graduate Certificate Program is designed for teachers who hold a bachelor’s degree from an accredited institution. This graduate certificate provides an emphasis area in reading and leads to the K-12 Reading Teacher licensure. It does not lead to a master's degree. Students may opt to complete a master's degree by applying certificate credits to the Master of Science in Reading program. Courses in this certificate may be applied to the Master of Science in Reading degree program.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate/teaching-reading-graduate-certificate/",
        "Accreditation status": "The Teaching: Reading Graduate Certificate Program is part of the College of Education which is accredited by the National Council for Accreditation of Teacher Education (NCATE).",
        "Program name": "Graduate Certificate in Teaching: Reading",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": "Academic and Behavioral Strategist (ABS), Developmental Disabilities (DD), Emotional/Behavioral Disorders (EBD), and Learning Disabilities (LD)",
        "description": "The Graduate Certificate in Teaching: Special Education program is intended for individuals who hold an unexpired Minnesota teaching license and are interested in earning an initial or additional teaching license in one of the following special education licensure areas: Academic and Behavioral Strategist (ABS), Developmental Disabilities (DD), Emotional/Behavioral Disorders (EBD), and Learning Disabilities (LD). The program offers both initial and additional licensure pathways at the graduate level. Those who complete the certificate will meet the coursework requirements for licensure in one of the four licensure areas. They will also meet the state requirement of having a core skill set in the other three disability categories, as well as meeting the reading requirement for licensure in special education. The certificate leads to eligibility for a teaching license upon meeting all Minnesota Professional Educator Licensing and Standards Board (PELSB) requirements, including student teaching and passing the required exams.",
        "program website url": "https://www.mnsu.edu/academics/special-education/academic-programs/graduate-certificate-in-teaching-special-education/",
        "Accreditation status": "All of our programs are accredited by the Minnesota Professional Educator Licensing and Standards Board (PELSB).",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Teaching: Special Education",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The 12-credit online Technical Communication Graduate Certificate program has been designed for working professionals who want to enhance their careers with advanced communication skills. Coursework is focused on the knowledge and skills needed to design, compose, and edit technical and professional documents.",
        "program website url": "https://www.mnsu.edu/academics/academic-programs/graduate-programs/technical-communication-graduate-certificate/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Technical Communication",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Postgraduate Certificate in Aging Studies provides an opportunity for individuals who have already earned a bachelor's degree to complete a specialized interdisciplinary course of study in aging. The program is specifically tailored for individuals who are either currently working with or who plan to work with older adults. The program offers maximum flexibility as it is offered completely online. The certificate consists of 12 credits including 3 required credits (Aging and the Life Course) and 9 elective credits. No other certificate program in aging studies is available in Minnesota, and few are available in neighboring states. Students who have completed or who are concurrently completing a graduate degree at Minnesota State Mankato are not eligible for the post-graduate certificate in aging studies.",
        "program website url": "https://www.mnsu.edu/academics/college-of-social-and-behavioral-sciences/departments-and-programs/sociology/programs-offered/aging-studies-postgraduate-certificate/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Postgraduate Certificate in Aging Studies",
        "Program Page url": "https://www.mnsu.edu/find-a-program/graduate-programs/"
    }
]