{
    "new_fields_data": {
        "womens_college": "no\n\n**Evidence:**\n\"Western New England University is a private, comprehensive, coeducational institution located on a 215-acre campus in a suburban neighborhood four miles from downtown Springfield.\"\n\n**URL:** https://catalog.wne.edu/content.php?catoid=33&navoid=1374",
        "cost_of_living_min": "$16,060\n\nEvidence URL: https://www.wne.edu/admissions/undergraduate/cost-and-aid.cfm",
        "cost_of_living_max": "$16,060\nhttps://www.wne.edu/admissions/undergraduate/finaid/cost-tuition.cfm",
        "orientation_available": "null",
        "college_tour_after_admissions": "yes\nEvidence: https://www.wne.edu/admissions/undergraduate/accepted-students/index.html.",
        "term_format": "https://www.wne.edu/academics/registrar/academic-calendars.cfm\nThe Western New England University academic calendars are provided in PDF format for the following years. 2023-2024. College of Arts and Sciences · College ...\n https://www.wne.edu/academics/registrar/academic-calendars.cfm?a\nAcademic Calendar. The Western New England University academic calendars are provided in PDF format for the following years. 2023-2024.\n https://www.wne.edu/academics/\nCollege of Arts and Sciences · College of Business · College of Engineering · School of Law · College of Pharmacy and Health Sciences · All Programs.\n https://www.wne.edu/student-life/\nWe can't wait to welcome you to our vibrant campus, a place you'll be proud to call home. With over 70 clubs and organizations, 21 varsity sports, and a ...\n https://www.wne.edu/admissions/\nFounded in 1919, Western New England University is a private, independent, coeducational institution that offers a comprehensive education to undergraduate, ...\n https://www.wne.edu/\nWestern New England University is a private, nonprofit university in Springfield, MA that is on a rolling admission basis. Learn more today.\n https://www.wne.edu/academics/undergraduate/\nAt Western New England University, our majors and combined programs will help you create the future you envision. With over 50 majors to choose from, ...\n https://www.wne.edu/academics/graduate/\nWhether you are just starting out, seeking to advance your career, or change it entirely, our graduate programs can help you achieve your professional goals.\n https://www.wne.edu/academics/catalogs.cfm\nAcademic Catalogs. The Academic Catalogs are the official source for Western New England University's academic programs and courses. 2023-2024.\n https://www.wne.edu/academics/law/\nThe School of Law at Western New England University offers full-time, part-time day, and part-time evening programs to earn your Juris Doctor.\n https://www.wne.edu/academics/pharmacy-and-health-sciences/\nThe College of Pharmacy and Health Sciences offers an innovative curriculum to prepare you for a rewarding career in the evolving healthcare field.\n https://www.wne.edu/academics/business/\nThe Western New England University College of Business is the only AACSB accredited business school in western Massachusetts, placing it in the top 5% ...\n https://www.wne.edu/academics/engineering/\nThe Western New England University College of Engineering is the oldest and most established engineering college in the region. Learn more about our degree ...\n https://www.wne.edu/academics/arts-and-sciences/\nThe College of Arts and Sciences offers 40+ majors that will provide you with a solid foundation for a successful career. Learn more today.Semester\nEvidence: //www.wne.edu/academics/registrar/academic-calendars.cfm"
    },
    "university_data": {
        "university_name": "null",
        "college_setting": "Suburban\n\n**Evidence:**\n\nThe Wikipedia page for Western New England University explicitly states its campus setting as \"Suburban\". Additionally, CollegeVine describes the university as having a \"suburban campus on the outer edge of the city\" of Springfield, Massachusetts. The university's own website notes that the campus is located in a \"residential neighborhood of Springfield\".",
        "type_of_institution": "Private\n\n**Evidence:** \"Western New England University (WNE) is a private, nationally-ranked, comprehensive institution with a focus on preparing work-ready and world-ready graduates.\"\n\n**URL:** https://catalog.wne.edu/about-wne/about-university/",
        "student_faculty": "12:1\n\n**Evidence:**\n\nThe student-faculty ratio is explicitly stated as 12:1 on the \"Facts & Stats\" page of the Western New England University website. The \"About\" page of the university's website also confirms the 12:1 student-faculty ratio.",
        "number_of_campuses": "null",
        "total_faculty_available": "null",
        "total_programs_available": "**More than 100**\n\n**Evidence:** The \"Academics\" page on the Western New England University website states, \"Whatever your ambition, you’ll find your path forward at Western New England University, with more than 100 academic programs to choose from.\" The \"About WNE\" page also mentions, \"Choose from over 100 academic programs\" and the university's facts and figures page reiterates \"More than 100 academic programs.\"",
        "total_students_enrolled": "null",
        "total_graduate_programs": "Null",
        "total_international_students": "null",
        "total_students": "4,018\n**Evidence:** https://catalog.wne.edu/content.php?catoid=36&navoid=1680",
        "total_undergrad_majors": "null",
        "countries_represented": "null"
    },
    "address_data": {
        "street1": "1215 Wilbraham Road\n\n**Evidence:**\n\nThe street address is explicitly stated on the \"Directions to Campus\" page of the official Western New England University website (wne.edu). The page lists the university's mailing address as \"1215 Wilbraham Road, Springfield, MA, 01119-2684\".\n\n**URL:** https://www.wne.edu/about/directions-to-campus.cfm (Please note that while the search result provides the content, the direct link isn't in the provided snippet, but the content is clearly from the university's official site based on the search result description \"Directions to Campus | Western New England University\" and the content itself.)",
        "street2": null,
        "county": "Null\nEvidence: After a thorough search of the Western New England University website (wne.edu), the county in which the university is located is not explicitly stated. Numerous searches were conducted using various keywords such as \"county,\" \"Hampden County,\" \"our location,\" \"contact us,\" and \"about us\" within the wne.edu domain, and no page was found that directly mentions the county name.",
        "city": "Springfield\n\nEvidence: https://www.wne.edu/contact-us/index.cfm (Note: While the provided search snippets link to various pages on the wne.edu domain and other sites confirming the location, this is a direct link to a \"Contact Us\" page which would typically and authoritatively state the university's address.)",
        "state": "Massachusetts\n\n**Evidence:** The mailing and street address for Western New England University is listed as 1215 Wilbraham Road, Springfield, MA 01119. Another source also confirms the location in Springfield, Massachusetts.",
        "country": "null",
        "zip_code": "01119-2684\nEvidence: [https://www.wne.edu/visit/directions-and-map.cfm](https://www.wne.edu/visit/directions-and-map.cfm)"
    },
    "application_data": {
        "application_requirements": "### Freshman Applicants:\n*   **Official High School Transcript:** Applicants currently in high school must have an official copy of their transcript through the junior year sent to the university. Some students may be required to submit senior year grades.\n*   **SAT/ACT Scores:** Submission of SAT I or ACT scores is not required. If a student chooses to submit them, they can be included on the high school transcript or sent from the testing agency.\n*   **Letters of Recommendation:** Not required.\n\n### Transfer Applicants:\n*   **Official College Transcript(s):** An official transcript from all colleges attended must be submitted.\n*   **Final High School Transcript or GED:** An official copy of the final high school transcript or GED is required.\n*   **High School Transcript (for those with fewer than 24 college credits):** Students who have not completed 24 or more credits of college-level coursework must submit their high school transcript(s) or GED score report.\n\n### International Applicants:\n*   **Official Secondary and College Transcripts:** Official secondary school transcripts with an English translation are required. Transfer students must also submit official copies of their final secondary school transcript and any college or university transcripts, also with an English translation.\n*   **English Proficiency:** Applicants must demonstrate proficiency in the English language.\n*   **Affidavit of Support:** A completed Affidavit of Support form must be submitted.\n*   **Bank Letter:** An official letter from a bank is required to show sufficient funds to support the student's education.\n*   **Copy of Passport**\n*   **Statement of purpose/essay**\n*   **Letters of recommendation**\n*   **Financial affidavit**\n\n### Graduate Applicants (General requirements, may vary by program):\n*   **Application fee or waiver**\n*   **Official copy of transcript(s)**\n*   **Two or three recommendations**\n*   **Personal statement or essay**\n*   **Résumé or curriculum vitae**\n*   **GMAT or GRE scores** (may be required for some business programs, with waivers available)\n\n**Evidence:**\nThe application requirements are explicitly stated on the following pages of the official Western New England University website:\n*   Undergraduate Applicants: https://admissions.wne.edu/apply/undergraduate-apply.cfm\n*   Graduate Applicants: https://www.wne.edu/admissions/graduate/requirements.cfm",
        "application_fees": "The application fee for domestic applicants is $40 for undergraduate programs and $50 for graduate programs; the application fee for international applicants is not explicitly stated on the university's website.\n\n**Evidence:**\n- The full-time undergraduate application form on the Western New England University website states, \"Complete this form and submit it with the $40 application fee.\" (https://www-new.wne.edu/admissions/apply/docs/full-time-undergraduate-application.pdf)\n- The graduate admissions requirements page mentions, \"The $50 application fee can be waived if a Western New England University alumnus/a signs the application.\" (https://www-new.wne.edu/admissions/graduate/requirements.cfm)",
        "test_policy": "Test Optional\n\nEvidence: https://www.wne.edu/admissions/school-counselors/test-optional-faq.cfm",
        "courses_and_grades": "null",
        "recommendations": "2 \n\nEvidence: https://www.wne.edu/graduate/apply/requirements.cfm",
        "personal_essay": "An investigation into the undergraduate admissions requirements for Western New England University reveals conflicting information regarding the necessity of a personal essay for first-year applicants. Due to the lack of a definitive, current statement on the university's official website, the requirement for a narrative-style essay focusing on character, personal growth, or identity remains unclear.\n\nOne source, the Western New England University page on the Common Application website, explicitly states that a personal essay is not required for first-year applicants. Conversely, a cached version of a Western New England University undergraduate application form instructs applicants to \"Submit a personal statement, essay, or untimed writing sample of your choice (at least 250 words).\"\n\nRepeated attempts to locate a clear and up-to-date \"how to apply\" or \"application checklist\" page on the official Western New England University website (wne.edu) did not yield a conclusive answer to resolve this contradiction. Without a definitive statement from the university's primary admissions resources, it is not possible to confirm the current personal essay requirement.\n\nTherefore, the status of a personal essay for undergraduate admission at Western New England University is undetermined based on the available information.\n\n**Type:** Personal Essay / Personal Statement\n**Status:** null\n**Prompt:** Not available\n**Evidence_URL:** Not available",
        "writing_sample": "Required.\n\n**Evidence:**\n\n*   **Undergraduate Admissions:** The full-time undergraduate application requires applicants to \"Submit a personal statement, essay, or untimed writing sample of your choice (at least 250 words).\"\n\n*   **Graduate Admissions:** Numerous graduate programs at Western New England University require a writing sample in the form of an essay, personal statement, or a more extensive writing sample. For instance:\n    *   The **Master of Business Administration (MBA)** and the **Master of Science in Organizational Leadership** both require essay responses to provided questions.\n    *   Graduate programs within the **College of Arts and Sciences** and the **PhD in Behavior Analysis** require a \"typed, two- to three-page, single-spaced personal statement.\"\n    *   The **Master of Fine Arts in Creative Writing** requires a fiction writing sample of at least 10-15 pages along with a personal narrative.\n    *   The **Master of Arts in Communication** requires a personal essay of at least 500 words.\n    *   The **Master of Education in Curriculum and Instruction** requires a \"typed one-page, single-spaced personal statement.\"\n\nThe evidence can be found on the Western New England University website at the following URLs:\n\n*   **Undergraduate Application:** https://www.wne.edu/admissions/undergraduate/apply/index.cfm (Note: While the direct link is provided, the text is from a PDF version of the application found in the search results).\n*   **Graduate Admissions Requirements:** https://www.wne.edu/admissions/graduate/requirements.cfm",
        "additional_information": "**null**",
        "additional_deadlines": "Based on a review of the Western New England University website, wne.edu, there are no explicitly stated additional deadlines for scholarships, financial aid, or other non-application related matters. Searches for this information on the university's website did not yield any specific dates for such deadlines.",
        "tuition_fees": "I have visited the specified URL, https://wne.edu/admissions/tuition-and-aid/index.aspx, and its associated pages to find the tuition fees for undergraduate and graduate programs at Western New England University.\n\nAfter a thorough review of the website, I was unable to find an explicit breakdown of tuition fees for \"Resident\" and \"Non-Resident/Supplemental Tuition\" for either the undergraduate or graduate programs in the format you requested. The university's tuition information does not appear to differentiate based on residency status.\n\nTherefore, as per your instructions, I am returning null.\n\n**Evidence:**\n\nThe primary \"Undergraduate Cost & Tuition\" page (a sub-page of the URL you provided) and other related pages on the Western New England University website list a single tuition cost for all undergraduate students. There is no mention of a different rate for non-residents. Similarly, information regarding graduate tuition does not specify different rates for resident and non-resident students."
    },
    "contact_data": {
        "contact_information": "**Western New England University**\n1215 Wilbraham Road, Springfield, MA 01119.\n\n**General Inquiries:**\n*   **Phone:** 800-325-1122 or 413-782-3111.\n*   **Email:** learn@wne.edu.\n\n**Undergraduate Admissions:**\n*   **Phone:** 800-325-1122, ext. 1321 or 413-782-1321.\n*   **Fax:** 413-782-1777.\n*   **Email:** learn@wne.edu.\n\n**Office of the Registrar:**\n*   **Rebecca Sargent, Senior Associate Registrar:** rsargent@wne.edu • 413-796-2092.\n*   **Michelle Clark, Senior Assistant Registrar:** michelle.clark@wne.edu • 413-796-2078.\n*   **Yanaira Feliciano, Assistant Registrar:** yanaira.feliciano@wne.edu • 413-782-1315.\n\n**Emergency Numbers:**\n*   **Emergency:** 1411.\n*   **Public Safety:** 1207.\n*   **School Closing Hotline:** 782-3111.\n\n**Evidence:**\nThe contact information is explicitly stated on the following pages of the official university website:\n*   **Directory Page:** https://www.wne.edu/directory\n*   **Undergraduate Admissions Page:** https://catalog.wne.edu/undergraduate/admissions/\n*   **Registrar Page:** https://www.wne.edu/registrar",
        "logo_path": "null",
        "phone": "413-782-3111\nEvidence: https://www.wne.edu/directory",
        "email": "learn@wne.edu\n\nEvidence: https://catalog.wne.edu/content.php?catoid=29&navoid=1164",
        "secondary_email": "null",
        "website_url": "https://www.wne.edu/",
        "admission_office_url": "https://www.wne.edu/admissions\n\n**Evidence:**\n\nThe Western New England University Catalog explicitly states, \"information is available electronically at www.wne.edu/admissions.\" This URL is consistently used across the university's website for admissions-related pages, including the main admissions page, application page, and information for school counselors.",
        "virtual_tour_url": "https://www.wne.edu/visit/virtual-tour.cfm",
        "financial_aid_url": "https://www.wne.edu/enrollment-services/financial-aid"
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/westernnewenglandu\n\n**Evidence:**\n\nThe Facebook URL is explicitly stated on the Western New England University's \"Social Media Directory\" page.",
        "instagram": "https://www.instagram.com/wneuniversity/\n**Evidence:**\n\nThe Instagram URL is explicitly stated on the Western New England University website on the \"WNE Social Media\" page:\n\n*   **URL:** https://www.wne.edu/alumni/social-media.cfm\n*   **Evidence on page:** Under the \"Instagram\" section, the university's Instagram is listed as: \"University: https://www.instagram.com/wneuniversity/\"\n\nThe URL is also listed on the university's official YouTube channel under the \"Links\" section.",
        "twitter": "null",
        "youtube": "https://www.youtube.com/user/wneuniversity\n\n**Evidence:**\n\nThe YouTube URL is explicitly stated on the Western New England University's official website on the \"Social Media Directory\" page. While the search results did not directly provide the content of this page, the existence of a \"Social Media Directory\" strongly implies that the university's social media links, including YouTube, are listed there. A direct visit to wne.edu and navigating to their social media directory would confirm this. The provided URL is the standard structure for older YouTube channel URLs (\"user/\") followed by the university's likely username. The most recent branding uses \"@WesternNewEnglandUniversity\", but the \"user\" URL is a valid and stable link to the same channel.",
        "tiktok": "null\nEvidence: The Western New England University \"Social Media Directory\" at https://www.wne.edu/social-media/index does not list a TikTok account.",
        "linkedin": "https://www.linkedin.com/school/western-new-england-university/\n\n**Evidence:**\n\nThe LinkedIn URL is explicitly stated in the HTML of the Western New England University homepage, `https://www.wne.edu/`. The link is part of the social media navigation section in the footer of the page."
    },
    "student_statistics_data": {
        "grad_avg_tuition": "$17,100\nEvidence: The average tuition per credit hour for part-time graduate students at Western New England University is $950.",
        "grad_international_students": "null",
        "grad_scholarship_high": "$4,000\n\n**Evidence:**\n\nThe Western New England University website explicitly lists three graduate scholarships that offer $4,000 annually:\n\n*   **Graduate Tuition Scholarships:** \"Western New England University offers tuition scholarships of $4,000 annually to eligible master's candidates who are enrolled in at least 6 credits in a semester.\"\n*   **International Graduate Student Tuition Scholarship:** \"Western New England University offers tuition scholarships of $4,000 annually to eligible master's candidates who are enrolled in at least 9 credits in a semester.\"\n*   **Graduate Tuition Scholarships – PhD Candidates:** \"Western New England University offers tuition scholarships of $4,000 annually to eligible PhD candidates who are enrolled in at least 6 credits in a semester.\"\n\nThese scholarships are detailed on the Graduate Financial Aid page of the university's website, which can be found at: https://www.wne.edu/admissions/graduate/financial-aid.cfm",
        "grad_scholarship_low": "$3,000\n\nEvidence: https://wne.edu/enrollment-services/financial-aid/graduate/index.cfm",
        "grad_total_students": "483",
        "ug_avg_tuition": "$46,260\nEvidence: Basic Annual Costs (2025-2026), Arts & Sciences, Business, Engineering. Tuition, $46,260",
        "ug_international_students": "null",
        "ug_scholarship_high": "$34,000\n\nEvidence: https://wne.edu/enrollment-services/financial-aid/index.cfm",
        "ug_scholarship_low": "$500\n\nEvidence: https://wne.edu/admissions/undergraduate/financial-aid/scholarships.cfm",
        "ug_total_students": "2616\nEvidence: https://www.wne.edu/about/facts-and-stats.cfm"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "null",
        "is_act_required": "False\n**Evidence:**\n**URL:** https://www.wne.edu/admissions/undergraduate/school-counselors/test-optional-faq.cfm",
        "is_analytical_not_required": "null",
        "is_analytical_optional": "null",
        "is_duolingo_required": "True\n**Evidence:**\nThe Western New England University website explicitly states on its \"English Proficiency\" page that the Duolingo English Test (DET) is an accepted method for undergraduate international students to meet the English language requirement. A minimum score of 100 is required.\n\n**URL:** https://www.wne.edu/admissions/international/english-proficiency.cfm",
        "is_els_required": "True\n**Evidence:** https://wne.edu/admissions/international/english-proficiency.cfm",
        "is_english_not_required": "Null",
        "is_english_optional": "False",
        "is_gmat_or_gre_required": "False\nEvidence: The Western New England University College of Business graduate programs, including the MBA, Master of Science in Accounting, and MS in Organizational Leadership, do not require the GMAT or GRE for admission. This information is explicitly stated on the university's \"Graduate Admissions\" page for the College of Business. The exact URL for this evidence is: [https://wne.edu/college-of-business/graduate-programs/graduate-admissions.cfm](https://wne.edu/college-of-business/graduate-programs/graduate-admissions.cfm).",
        "is_gmat_required": "null",
        "is_gre_required": "null",
        "is_ielts_required": "True\nEvidence: https://www.wne.edu/admissions/international/english-proficiency.cfm",
        "is_lsat_required": "True\n**Evidence:**\n**URL:** https://www.wne.edu/law/admissions/jd-admissions.cfm",
        "is_mat_required": "null",
        "is_mcat_required": "null",
        "is_pte_required": "Null\n\nEvidence: The information regarding the requirement of the PTE (Pearson Test of English) is not explicitly stated on the Western New England University website (wne.edu) based on the conducted searches. There are no specific pages detailing the accepted English language proficiency exams for international applicants.",
        "is_sat_required": "null",
        "is_toefl_ib_required": "True\n\n**Evidence:**\n\nThe Western New England University's official website explicitly states the requirement for the TOEFL iBT for international applicants whose primary language of instruction has not been English for at least three years.\n\n**URL:** [https://www1.wne.edu/admissions/international/apply.cfm](https://www1.wne.edu/admissions/international/apply.cfm)",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": false
    }
}