[
    {
        "Concentration name": "Financial Accounting/Auditing Track, Taxation Track",
        "description": "The Master of Accountancy (M.Acc.) program at Northern Kentucky University is designed for students with an undergraduate degree in accounting who want to pursue a graduate business degree with a specialization in accounting. Our M.Acc. program provides students with the advanced knowledge and skills necessary to succeed in today’s competitive business environment and to help them meet the 150-hour requirement to sit for the CPA exam in Kentucky, Ohio, and most other states.",
        "program website url": "https://www.nku.edu/academics/cob/programs/graduate/macc.html",
        "Accreditation status": "The Haile College of Business is accredited by AACSB International - The Association to Advance Collegiate Schools of Business. Additionally, the Department of Accounting and Business Law has earned a separate accounting accreditation from AACSB.",
        "Level": "Master's",
        "Program name": "Master of Accountancy",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Athletic Training (MSAT) program provides students with the required knowledge, skills and abilities to be eligible for national certification and state licensure as an athletic trainer. The MSAT is a full-time, two-year program that prepares students for a career in athletic training through a combination of didactic, laboratory and immersive clinical education experiences. The comprehensive didactic curriculum is based in evidence-based practice and includes courses in injury and illness prevention, wellness promotion, emergent care, examination and clinical diagnosis, therapeutic intervention and rehabilitation of injuries and medical conditions. A total of five immersive clinical education experiences provide students the opportunity to practice and apply the skills they learn in the classroom to a wide variety of patient populations under the direct supervision of a preceptor. All clinical experiences meet the requirements of the Commission on Accreditation of Athletic Training Education (CAATE) and will be in one of the following settings: college/university athletics, secondary school athletics, professional sports, orthopedic and primary care physician offices, outpatient rehabilitation clinics, industrial medicine, and performing arts. Students will also be required to complete a research project and successfully defend the results prior to graduation. Once certified and licensed, athletic trainers provide comprehensive patient care in a variety of settings. Athletic trainers (ATs) are health care professionals who collaborate with physicians to provide preventative services, emergency care, clinical diagnosis, therapeutic intervention and rehabilitation of injuries and medical conditions. ATs work with patients of all ages and abilities in a variety of settings including: hospitals, physician clinics, sports medicine clinics, secondary schools, colleges and universities, professional sports, performing arts, industrial settings, and military.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4546&returnto=4572",
        "Accreditation status": "The Master of Science in Athletic Training program is accredited by the Commission on Accreditation of Athletic Training Education (CAATE).",
        "Program name": "Master of Science in Athletic Training",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4546&returnto=4572"
    },
    {
        "Concentration name": [
            "Leadership",
            "Data Analytics",
            "Finance",
            "Marketing",
            "Innovation & Entrepreneurship",
            "Health Care Administration"
        ],
        "description": "The online Master of Business Administration (MBA) from Northern Kentucky University is a nationally ranked program designed to broaden your knowledge, skills and abilities in key areas of business and management. Taught by the same world-class faculty who teach on campus, our program provides you with a rich, rewarding academic experience that integrates real-world business challenges into the curriculum. Our online MBA program prepares you to navigate the business world from a management perspective and to overcome the challenges of an evolving global economy. With a focus on strategic leadership, management and decision-making, you will learn to utilize your business expertise to influence, lead and excel in any industry. In this program, you will develop the analytical skills to strategically manage a team, evaluate risk and opportunity, and understand how to drive your organization’s growth and profitability. You will emerge from our online MBA program as an innovative business leader, ready to create value for your organization and advance your career.",
        "program website url": "https://onlinedegrees.nku.edu/programs/business/mba/",
        "Accreditation status": "Northern Kentucky University's Haile/US Bank College of Business is accredited by the Association to Advance Collegiate Schools of Business (AACSB). Fewer than 5 percent of business schools worldwide have earned this hallmark of excellence in business education.",
        "Level": "MBA",
        "Program name": "Master of Business Administration",
        "Program Page url": "https://onlinedegrees.nku.edu/programs/business/mba/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Business Leadership and Innovation (MBLI) is a 30-credit hour online program for working professionals who want to sharpen their leadership and innovation skills. In this program, students develop strategic leadership, problem-solving, and decision-making skills that can be directly applied to their careers.",
        "program website url": "https://www.nku.edu/academics/cob/programs/graduate/mbli.html",
        "Accreditation status": "The Haile College of Business is accredited by AACSB International.",
        "Program name": "Master of Business Leadership & Innovation",
        "Program Page url": "https://www.youtube.com/watch?v=jvJe85nZuuE"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Cardiovascular Perfusion at Northern Kentucky University is a 21-month, 77-credit hour program that provides students with the didactic and clinical experience needed to become a certified clinical perfusionist. Students are educated in all aspects of cardiopulmonary bypass and related technologies such as extracorporeal membrane oxygenation (ECMO) and ventricular assist device (VAD) management. Graduates of the program are eligible for board certification through the American Board of Cardiovascular Perfusion.",
        "program website url": "https://inside.nku.edu/chhs/departments/allied-health/cvp.html",
        "Accreditation status": "The Northern Kentucky University Cardiovascular Perfusion Program has been granted initial accreditation by the Commission on Accreditation of Allied Health Education Programs (www.caahep.org) upon the recommendation of the Accreditation Committee for Perfusion Education (AC-PE).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Cardiovascular Perfusion",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "NKU's Master of Science in Clinical Mental Health Counseling is a 60-credit hour program accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP). The program is designed to prepare compassionate and self-reflective counselors to work with diverse clients in a variety of community and clinical settings. Students who complete the program are eligible for counseling licensure in Kentucky, Ohio, Indiana, and many other states. All courses in the counseling program are taught by core faculty who have professional experience as licensed counselors. The program has three main components: a core of counseling classes, including a practicum of at least 100 hours in the field; specialization classes that develop specific knowledge and skills; and an internship of at least 600 hours in a clinical setting.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/counseling.html",
        "Accreditation status": "Accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Clinical Mental Health Counseling",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in computer science program is a 30-credit-hour program that builds on a bachelor’s degree in computer science to provide students with advanced knowledge and skills in the computing discipline. The program helps prepare students for a career in the computing field as well as for further study at the doctoral level. Students receive a broad background in the areas of algorithms, computer architecture, operating systems, and programming languages, and they also have the opportunity to take a variety of electives in areas such as artificial intelligence, computer vision, data science, database systems, high performance computing, networks, and security.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4533",
        "Accreditation status": null,
        "Program name": "Master of Science in Computer Science",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4533"
    },
    {
        "Concentration name": "Cybersecurity Management, Cybersecurity Technology",
        "description": "Cybersecurity professionals are in high demand as technology continues to evolve and businesses and organizations adapt to a changing global climate. Northern Kentucky University's online Master of Science in Cybersecurity program prepares you to meet that need, whether you are seeking a career in the field or an advanced role in your current organization. Designed for working professionals, this 100% online program is flexible, convenient, and affordable. You will gain in-demand skills in cybersecurity and technology that you can apply right away in your career. Our M.S. in Cybersecurity online program provides you with in-depth knowledge of all aspects of cybersecurity, including the latest techniques, policies, ethical and legal issues, and risk assessment and management. You will gain a clear understanding of the full scope of security issues from different points of view and learn to think on a higher level as you design complete information security systems. In this cybersecurity master's program, you will: Learn to secure data and information, protect networks, and assess system vulnerabilities. Gain practical skills in risk management and threat analysis, network security, computer forensics, and cryptography. Prepare for professional certification exams such as CISSP®, CEH, and CHFI. Discover how to create and implement security plans and disaster recovery plans.",
        "program website url": "https://onlinedegrees.nku.edu/programs/technology/ms-cybersecurity/",
        "Accreditation status": "Earn your degree from a National Center of Academic Excellence in Cyber Defense Education (CAE-CDE), a designation awarded by the National Security Agency and the Department of Homeland Security.",
        "Program name": "Master of Science in Cybersecurity",
        "Program Page url": "https://onlinedegrees.nku.edu/programs/technology/ms-cybersecurity/"
    },
    {
        "Concentration name": "Curriculum and Instruction, Educational Leadership (Principal Program), Gifted and Talented Education, Instructional Computer Technology, Literacy P-12, Reading/Literacy Specialist P-12, School Librarian, Special Education - Learning and Behavior Disorders P-12, Teacher as Leader in a Culturally and Linguistically Diverse World",
        "description": "The Master of Arts in Education (M.A.Ed.) degree program is designed to meet the advanced professional needs of P-12 teachers and other school personnel. The program supports the professional growth of educators and helps them expand their knowledge and skills in specific areas of education. The M.A.Ed. is an all-online program and is offered in nine different concentrations, and also includes additional endorsements and a certificate. The M.A.Ed. can be completed in as few as 18 months.",
        "program website url": "https://nku.edu/academics/coe/programs/graduate/master-of-arts-in-education.html",
        "Accreditation status": "Northern Kentucky University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate, baccalaureate, masters, and doctorate degrees. Questions about the accreditation of Northern Kentucky University may be directed in writing to the Southern Association of Colleges and Schools Commission on Colleges at 1866 Southern Lane, Decatur, GA 30033-4097, by calling (404) 679-4500, or by using information available on SACSCOC’s website (www.sacscoc.org).\n\nThe College of Education at Northern Kentucky University is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Master of Arts in Education",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Educational Leadership (principal preparation) program is a 30-credit hour, fully online program that leads to a recommendation for principal certification in Kentucky. The program combines core educational leadership content with field-based experiences to prepare candidates with the knowledge, skills, and dispositions to be highly effective school leaders.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/edleadership.html",
        "Accreditation status": "Northern Kentucky University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC). The College of Education programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Educational Leadership",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in English at Northern Kentucky University offers students the opportunity to deepen their skills in close reading, critical thinking, and written expression in small, seminar-style classes taught by an award-winning faculty of active scholars and creative writers. Our M.A. in English program helps students expand their knowledge of the diverse traditions of literature in English. The program also provides excellent preparation for doctoral study in English or a related field; for a teaching career, including at the community college level; and for professions that require advanced skills in research, analysis, and communication, such as law, editing, public relations, technical writing, and marketing.",
        "program website url": "https://www.nku.edu/academics/artsci/programs/graduate/english.html",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in English",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Exercise Science program at Northern Kentucky University is designed to prepare highly-qualified professionals to work in athletic, clinical, and industrial settings. This is a 100% online program and consists of a 30-33 credit hour curriculum depending on whether the student chooses to pursue a thesis, an internship, or a capstone project. The Master of Science in Exercise Science online program is dedicated to developing exercise science professionals who are leaders in their respective fields through demonstrated evidence-based knowledge and skills. Our program also provides students with the prerequisite coursework to sit for certifications offered by the American College of Sports Medicine (ACSM), the National Strength & Conditioning Association (NSCA), and the National Academy of Sports Medicine (NASM).",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/exercise-science.html",
        "Accreditation status": "NKU’s online master’s in exercise science program is accredited by the Commission on Accreditation of Allied Health Education Programs (CAAHEP).",
        "Level": "Master",
        "Program name": "Master of Science in Exercise Science",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Health Informatics (MSHI) program is an interdisciplinary program that includes courses in health care, information systems, computer science, and business. It is a graduate program that is 100 percent online. The program is designed to meet the growing need for informatics professionals in the health care industry. It provides students with specialized skills and knowledge in health informatics. Health informatics professionals are skilled in the capture, management and use of health care data and information to improve the process and outcomes of patient care. In this program, students develop the skills to be leaders in the new information-intensive health care environment. The curriculum has a strong focus on project management, systems analysis, and data analytics. Students have an opportunity to personalize their program through their choice of practicum experience and capstone project. In addition, students can take approved electives. The program offers flexible options for completing both the practicum and the capstone project. Evidence-based practice, professionalism, communication, and leadership skills are integrated in all courses throughout the curriculum.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4536&returnto=4572",
        "Accreditation status": "The Health Informatics accreditor of Northern Kentucky University is the Commission on Accreditation for Health Informatics and Information Management Education (CAHIIM). The College’s accreditation for Master degree in Health Informatics has been reaffirmed through 2029-2030. All inquiries about the program’s accreditation status should be directed by mail to CAHIIM, 200 East Randolph Street, Suite 5100, Chicago, IL, 60601; by phone at (312) 235-3255; or by email at info@cahiim.org.",
        "Level": "Masters",
        "Program name": "Master of Science in Health Informatics",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4536&returnto=4572"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Industrial-Organizational (I-O) Psychology program is a 39-42 credit hour program designed to prepare students for careers in business, industry, government, and other organizational settings. The program is designed in accordance with the training guidelines set forth by the Society of Industrial and Organizational Psychology (SIOP). The I-O psychology program is a full-time program with a fall admission only. All classes are held in the evenings to accommodate both traditional students and students who wish to maintain full-time employment while completing their degree. The typical student enrolled full-time will complete the program in two years. I-O psychology is the scientific study of the workplace and the application of psychological principles to workplace issues. I-O psychologists are scientist-practitioners who are trained to be competent in both research and application. They use the scientific method to better understand human behavior at work, and then they apply that knowledge to real-world organizational problems. I-O psychologists focus on a wide variety of issues. For example, I-O psychologists help organizations hire qualified and suitable employees, train and develop employees, manage and appraise employee performance, ensure fair and equitable treatment of employees, create and implement effective organizational development and change interventions, and promote employee health, safety, and well-being. The I-O psychology program at NKU provides students with a comprehensive understanding of I-O psychology theories, methods, and research. Our program is designed to develop students’ applied skills through coursework, a required practicum, and opportunities for applied research experience (e.g., student consulting projects, thesis). Our students are trained to be both critical consumers and producers of I-O psychology research.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4495&returnto=4572",
        "Accreditation status": null,
        "Program name": "Master of Science in Industrial-Organizational Psychology",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4495&returnto=4572"
    },
    {
        "Concentration name": "Business Analytics, Business Informatics, Cybersecurity",
        "description": "The Master of Science in Information Systems (MSIS) program prepares students for leadership positions in the information systems/technology field. The program is designed for students who desire to update and enhance their skills and knowledge in the analysis, design, development, and management of information systems. The program provides a balance between technical and managerial concepts. In addition to advanced technical topics such as systems analysis and design, database management, and data communications, the curriculum addresses key management issues such as project management, technology management, and information security. Students may choose from one of three concentrations: Business Analytics, Business Informatics, or Cybersecurity.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=30&poid=5115&returnto=5175",
        "Accreditation status": null,
        "Program name": "Master of Science in Information Systems",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=30&poid=5115&returnto=5175"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Interdisciplinary Studies (MAIS) program is designed for students whose academic interests cross traditional disciplinary boundaries. It allows students to create an individualized and flexible program of graduate study by drawing on coursework from across the university. Students complete 33 hours of graduate coursework from two to three different academic disciplines and write a master’s thesis. The master’s thesis allows students to engage in an in-depth study of a topic from an interdisciplinary perspective. The MAIS program attracts a wide array of students, from recent college graduates to working professionals and lifelong learners. The program allows students to customize a plan of study that suits their interests and needs. Students acquire skills in critical thinking and writing that can be transferred across an array of employment sectors. Students graduate with a deeper and richer understanding of their chosen topics of study, which prepares them for a variety of pursuits as they advance their personal and professional goals.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=30&poid=5091&hl=%22interdisciplinary+studies%22&returnto=search",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Interdisciplinary Studies",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=30&poid=5091&hl=%22interdisciplinary+studies%22&returnto=search"
    },
    {
        "Concentration name": "General, Business Law, Compliance, Health Care Law",
        "description": "The Master of Legal Studies (MLS) degree is for individuals who want to obtain a deeper understanding of the law but do not want to practice it. Students learn how to identify and address legal issues through course work covering a broad base of legal topics. The 30 credit-hour degree can be completed entirely online in as few as two years. Students are taught by the same law professors who teach Juris Doctor students, and they have the same academic support services.",
        "program website url": "https://www.nku.edu/academics/chase/programs/masters/legal-studies.html",
        "Accreditation status": "The NKU Chase College of Law MLS program has received acquiescence from the American Bar Association (ABA) and is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC).",
        "Level": "Master",
        "Program name": "Master of Legal Studies",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": [
            "Adult-Gerontology Nurse Practitioner (AGNP)",
            "Family Nurse Practitioner (FNP)",
            "Nurse Educator (NED)",
            "Nursing Executive Leadership (NEL)",
            "Psychiatric Mental Health Nurse Practitioner (PMHNP)"
        ],
        "description": "The Master of Science in Nursing (M.S.N.) program prepares graduates for advanced roles in nursing. The M.S.N. program is designed for the registered nurse who has a Bachelor of Science in Nursing degree and is ready to advance his or her career.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4519&returnto=4577",
        "Accreditation status": "The baccalaureate degree program in nursing, master’s degree program in nursing, and doctor of nursing practice program at Northern Kentucky University are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Master of Science in Nursing",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4519&returnto=4577"
    },
    {
        "Concentration name": null,
        "description": "The MPA program prepares a diverse student body to be leaders in public service by providing the knowledge, skills and abilities to ethically and effectively address critical community issues. The program prepares students through an applied academic course of study which supports their professional careers as leaders and managers in government, and in nonprofit agencies at the local, regional, state and national levels.\n\nThe MPA program offers a 36 credit hour generalist curriculum for pre-service students and those individuals already employed in the public and non-profit sectors who wish to advance in their careers. The core courses emphasize skills and knowledge appropriate for leaders in the public and nonprofit sectors in the areas of public management, policy analysis and evaluation, budgeting and financial management, public personnel management, legal issues and research and quantitative methods. A required internship or research project provides a culminating experience through which students can apply the knowledge they have gained.\n\nA variety of elective choices allow students to pursue areas of interest. Electives may be chosen from graduate courses offered in the MPA program, from other related graduate programs at NKU, or from courses offered by our partner institutions in the Greater Cincinnati Consortium of Colleges and Universities.",
        "program website url": "https://www.nku.edu/academics/artsci/mpa.html",
        "Accreditation status": "The Northern Kentucky University Master of Public Administration Program is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA) Commission on Peer Review and Accreditation and is listed on the Annual Roster of Accredited Programs in conformity with NASPAA standards.",
        "Level": "Masters",
        "Program name": "Master of Public Administration",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4501"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Public History at NKU is an innovative, nationally recognized program that combines traditional historical study with hands-on, real-world experiences through internships, service-learning opportunities, and class projects for local museums, archives, and other non-profits. The program prepares students for history-related careers at museums, archives, libraries, cultural agencies, and in historic preservation, heritage tourism, documentary filmmaking, corporate history, and policy analysis.\n\nThe program is small (usually 25-30 students), providing a high degree of student-faculty interaction. We offer small graduate seminars, a flexible curriculum that allows students to choose their own course of study, and a variety of career-building activities, including conferences, workshops, and guest lectures.\n\nStudents may pursue the degree on a full- or part-time basis. Full-time students can finish in two years. Part-time students typically finish in three-four years. Courses are offered on a rotating basis, usually in the evenings, to accommodate working professionals.",
        "program website url": "https://www.nku.edu/academics/artsci/programs/graduate/public-history.html",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Public History",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The School Counseling Program at Northern Kentucky University prepares counselors to work in a variety of school settings, elementary, middle, and high school. In addition to the required core classes, students are trained in developmental counseling, college and career readiness, consultation, and program development and evaluation. Students complete a 100 hour practicum and a 600 hour internship in a school setting.",
        "program website url": "https://www.nku.edu/content/dam/CHHS/KCRS/COU/MA%20SC.pdf",
        "Accreditation status": "The School Counseling program is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP) and The Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master of Arts",
        "Program name": "Master of Arts in School Counseling",
        "Program Page url": "https://www.nku.edu/content/dam/CHHS/KCRS/COU/MA%20SC.pdf"
    },
    {
        "Concentration name": "Clinical Social Work, Community and Organizational Practice Social Work",
        "description": "Northern Kentucky University's Master of Social Work is a graduate program that focuses on community based practice to address the needs of the Northern Kentucky and Greater Cincinnati region. It is designed to prepare social workers to practice with individuals, families,groups, organizations, and communities through a curriculum focused on community based practice. The program encourages a learning environment in which students can develop the required skills and knowledge for effective practice through course work and internships. The NKU MSW program offers a generalist year curriculum (foundation) and a specialized year curriculum (advanced). Students may be eligible for advanced standing if they have a bachelor's degree in social work from a Council on Social Work Education accredited program.",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/social-work.html",
        "Accreditation status": "Northern Kentucky University's Master of Social Work program is accredited by the Council on Social Work Education (CSWE).",
        "Program name": "Master of Social Work",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": [
            "Elementary Education (P-5)",
            "Middle Grades Education (5-9) in English, mathematics, science, and social studies",
            "Secondary Education (8-12) in English, mathematics, social studies, biology, chemistry, earth science, and physics",
            "P-12 in art, music, physical education, Spanish, French, German, and theatre"
        ],
        "description": "The Master of Arts in Teaching (MAT) program is for individuals who have a bachelor's degree in a field other than education and want to become a certified teacher. The program offers several certification options in elementary, middle grades, secondary, and P-12 education. The program can be completed in as little as 12 months in an accelerated format or at a more traditional pace to allow for continued employment. Program faculty work closely with students to create a plan that fits their needs and goals.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/mat.html",
        "Accreditation status": "The teacher education programs at Northern Kentucky University are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master's",
        "Program name": "Master of Arts in Teaching",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "Northern Kentucky University's Doctor of Occupational Therapy (OTD) program is the first of its kind in the Commonwealth of Kentucky, as it is the only entry-level doctoral program offered by a public university. The OTD Program prepares students to be evidence-based, occupation-centered practitioners, leaders, and advocates. The curriculum is built on a strong foundation of knowledge in the science of occupation. Students learn to implement the occupational therapy process with individuals, groups, and populations in a variety of practice settings. Throughout the program, students have multiple opportunities to learn by doing in the classroom, in the community, and through fieldwork experiences. Two final components of the program are the capstone experience and capstone project. These components allow students to further develop skills as a leader, advocate, and practitioner.",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/otd.html",
        "Accreditation status": "The entry-level occupational therapy doctoral degree program has applied for accreditation and has been granted Candidacy Status by the Accreditation Council for Occupational Therapy Education (ACOTE) of the American Occupational Therapy Association (AOTA), located at 6116 Executive Boulevard, Suite 200, North Bethesda, MD 20852-4929. ACOTE’s telephone number c/o AOTA is (301) 652-AOTA and its Web address is www.acoteonline.org.",
        "Level": "Doctoral",
        "Program name": "Doctor of Occupational Therapy",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Doctor of Education in Educational Leadership",
        "Program Page url": "https://www.plu.edu/academic-programs/program/doctor-of-education/"
    },
    {
        "Concentration name": null,
        "description": "The Doctor of Education (Ed.D.) in Educational Leadership is an accelerated online program designed to prepare leaders who can respond to the complex problems in P-12, higher education, and other organizational settings. This cohort-based program is built on a strong foundation of social justice and equity. You’ll be prepared for administrative, academic, and research roles that improve outcomes for all learners.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/edd.html",
        "Accreditation status": "NKU's College of Education has been accredited by CAEP (and its legacy agency NCATE) for more than 60 years.",
        "Level": "Doctoral",
        "Program name": "Doctor of Education in Educational Leadership (Online Accelerated)",
        "Program Page url": "https://www.nku.edu/admissions/graduate.html"
    },
    {
        "Concentration name": "Principal Certification (Online Accelerated)",
        "description": "The Doctor of Education (Ed.D.) in Educational Leadership is designed for practicing and aspiring leaders in P-12, higher education, and related educational organizations, such as non-profits and government agencies. The program is designed to develop leaders who are capable of responding to the changing needs of our educational organizations and our diverse society. As a student in this program, you will expand your leadership capacities and learn to lead change efforts through the application of improvement science and other research and data analysis methods. The program fosters a deep understanding of equity and social justice issues and will prepare you to be an advocate for all learners. The 54-credit hour Ed.D. program can be completed in as little as 36 months and is offered in an accelerated online format, allowing you to advance your career while maintaining your work and personal life.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/edd.html",
        "Accreditation status": "The Ed.D. in Educational Leadership program is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Doctoral",
        "Program name": "Doctor of Education in Educational Leadership - Principal Certification (Online Accelerated)",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": [
            "Adult-Gero Acute Care Nurse Practitioner",
            "Family Nurse Practitioner",
            "Psychiatric Mental Health Nurse Practitioner"
        ],
        "description": "The Doctor of Nursing Practice (DNP) degree is the new standard for advanced practice nursing education. NKU offers two pathways for DNP study: the post-master’s DNP and the BSN to DNP. The BSN to DNP program prepares graduates for certification in one of three advanced practice registered nursing (APRN) roles. The post-master’s DNP program prepares those who are already certified as APRNs at the highest level of nursing practice. Our DNP graduates are leaders in advanced clinical practice, applying evidence-based knowledge to reflect and resolve clinical practice problems and to improve healthcare outcomes.",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/dnp.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and Doctor of Nursing Practice program at Northern Kentucky University are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Doctor of Nursing Practice",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "Data has become the world’s most valuable resource. Organizations of all types and sizes are looking for professionals who can interpret and analyze data and use it to help make sound business decisions. NKU’s online Graduate Certificate in Business Analytics will help you gain the most in-demand skills in a short period of time. Our curriculum is tailored for working professionals. We offer eight-week courses, with five different start dates throughout the year, so you can earn your certificate in as little as two semesters.",
        "program website url": "https://www.nku.edu/academics/cob/programs/graduate/ba-certificate.html",
        "Accreditation status": "The Haile College of Business is accredited by AACSB International, a mark of excellence achieved by less than five percent of business schools worldwide.",
        "Level": "Certificate",
        "Program name": "Business Analytics Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The online Graduate Certificate in Clinical Research (GCCR) at Northern Kentucky University is a 12-credit hour program designed for working professionals who are interested in starting or advancing their careers in clinical research. The certificate includes a comprehensive curriculum on clinical trial design and execution, regulatory issues, and the business aspects of clinical research. Students will learn the essentials needed to initiate, manage, and monitor a clinical trial. The program is offered in 8-week formats and completely online to provide flexibility for the working professional. The curriculum also serves as a bridge for students who may be interested in pursuing a Master of Science in Health Science in the future.",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/clinical-research.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Clinical Research Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The 15-hour Graduate Certificate in Composition and Rhetoric helps high school English teachers and others interested in teaching writing at the university level learn foundational concepts in the teaching of writing. This certificate prepares students for careers in community colleges and teaching-focused universities, provides dual-credit credentialing for high school teachers, and offers a concentration for students in other graduate programs.",
        "program website url": "https://www.nku.edu/academics/artsci/programs/graduate/comp-rhetoric-cert.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Composition and Rhetoric Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Creative Writing Certificate",
        "Program Page url": "https://extendedstudies.ucsd.edu/certificates/creative-writing"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Health Care Commercialization (HGC) is a unique program designed for individuals with a science background who aspire to become a part of the leadership in their business or organization. Students who earn a health care commercialization certificate will learn the business and legal aspects of taking a product from the discovery to market. Graduates will gain the skills to navigate the regulatory process, create and defend intellectual property, and to lead teams through the phases of product commercialization.",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/health-care-commercialization.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Health Care Commercialization Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The graduate certificate in Health Informatics provides an interdisciplinary approach to health informatics, combining expertise from computer science, data science, business informatics, and health sciences. Students learn to use information technology to organize and analyze health data and records to improve healthcare outcomes. The program provides the foundational knowledge and skills for a career or advancement in the field of health informatics.",
        "program website url": "https://www.nku.edu/academics/hci/programs/graduate/health-informatics-certificate.html",
        "Accreditation status": null,
        "level": "Certificate",
        "Program name": "Health Informatics Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Information Systems Certificate program is designed to provide you with a graduate level curriculum in the information systems area. The program provides the foundational knowledge to effectively integrate information technology into business strategy, business process re-design, decision-making, and organizational design. The information systems curriculum provides technical knowledge of the tools and technologies used to manage organizational data and knowledge resources. You will also develop skills in systems analysis and design to identify business problems and develop technological solutions. The program prepares you to manage information systems projects by providing knowledge of project management principles, concepts, tools, and techniques. The program can be completed in as little as three semesters, and the certificate is offered completely online. The Information Systems Graduate Certificate can serve as a stackable certificate for the MBA program.",
        "program website url": "https://www.nku.edu/academics/cob/programs/graduate/information-systems-certificate.html",
        "Accreditation status": "The Haile College of Business has AACSB International accreditation for both our business and accounting programs - a distinction held by only 1% of business schools worldwide.",
        "Level": "Certificate",
        "Program name": "Information Systems Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Literary and Cultural Studies is designed for students interested in developing the critical reading and writing skills necessary to succeed as secondary educators, doctoral students, and leaders in other professions. The certificate requires four graduate English courses (12 credit hours). Students can also choose to earn the certificate as a part of the MA in English program.",
        "program website url": "https://www.nku.edu/academics/artsci/programs/graduate/english/certificates/literary-cultural-studies.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Literary and Cultural Studies Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Nonprofit Management & Leadership Certificate is a 15-credit hour undergraduate certificate that introduces students to the essential concepts and skills necessary for managing and leading nonprofit organizations. This certificate program will teach students how to: (1) analyze the unique environment of nonprofit organizations, including their public service role, funding, and relationship with government, business, and community; (2) lead and manage staff and volunteers effectively in a nonprofit organization; (3) conduct fundraising for a nonprofit organization, and (4) analyze, develop and manage budgets and other financial documents in a nonprofit organization. The certificate is especially useful for students in a variety of fields who are interested in employment or volunteer work in the nonprofit sector, including social work, human services, public relations, business, criminal justice, organizational leadership, and fine arts.",
        "program website url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4500",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Nonprofit Management & Leadership Certificate",
        "Program Page url": "https://onlinecatalog.nku.edu/preview_program.php?catoid=28&poid=4500"
    },
    {
        "Concentration name": "Family Nurse Practitioner, Adult Gero Primary Care Nurse Practitioner",
        "description": "Northern Kentucky University's post-master's nurse practitioner advancement certificate allows master's prepared nurse practitioners to expand their scope of practice. The online coursework and clinical experience will expand your marketability to provide primary care services to a new population focus. At NKU, we offer two nurse practitioner population focus areas: Family Nurse Practitioner and Adult Gero Primary Care Nurse Practitioner. The program is flexible with full-time and part-time options. Our curriculum is tailored to your individual needs based on a gap analysis of your previous graduate coursework. The program is offered fully online with the exception of on-campus immersion events for skills training and competency validation.",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/np-certificate.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and doctor of nursing practice program at Northern Kentucky University are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Certificate",
        "Program name": "Nurse Practitioner Advancement Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": [
            "Adult-Geron Acute Care Nurse Practitioner",
            "Adult-Geron Primary Care Nurse Practitioner",
            "Family Nurse Practitioner",
            "Psychiatric Mental Health Nurse Practitioner",
            "Nurse Executive Leadership",
            "Nursing Education"
        ],
        "description": "Northern Kentucky University's online Post-Master's Certificate programs prepare you to move into a new specialty in the nursing field or advance your position where you're already working. Choose from a variety of tracks to fit your career goals. This program is for nurses who already hold a master's or doctoral degree in nursing and are nationally certified and licensed as an advanced practice registered nurse (APRN).",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/nursing-post-masters.html",
        "Accreditation status": "The post-master’s APRN certificate program at Northern Kentucky University is pursuing initial accreditation by the Commission on Collegiate Nursing Education, 655 K Street, NW, Suite 750, Washington, DC 20001, 202-887-6791. Applying for accreditation does not guarantee that accreditation will be granted.",
        "Level": "Certificate",
        "Program name": "Post-Master of Science in Nursing Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Professional Writing at Northern Kentucky University is a 15-credit-hour program that introduces students to advanced research, theory, and the practice of professional writing. Grounded in rhetorical theory, the coursework combines research with the practical application of writing and editing skills. The certificate is offered completely online, though students may opt to take some classes on campus. This certificate is a perfect fit for professionals looking to enhance their credentials and skills in business writing, scientific and technical writing, medical writing, editing, and publishing. The Graduate Certificate in Professional Writing also prepares students for graduate study in professional writing at the M.A. or Ph.D. level.",
        "program website url": "https://www.nku.edu/academics/artsci/programs/graduate/profwriting-cert.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Professional Writing Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Total Worker Health (TWH) is an innovative program that can be completed entirely online. The certificate program will train students in the principles of TWH, a holistic approach that integrates protection from work-related safety and health hazards with promotion of injury and illness-prevention efforts to advance worker well-being. TWH builds on this approach through the recognition that work is a social determinant of health, since job-related factors such as wages, hours of work, workload and stress levels, interactions with coworkers and supervisors, and access to paid leave and health-promoting workplaces can have an important impact on the well-being of workers, their families, and their communities.",
        "program website url": "https://www.nku.edu/academics/chhs/programs/graduate/total-worker-health-certificate.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Total Worker Health Certificate",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": "Learning and Behavior Disorders (LBD), Moderate to Severe Disabilities (MSD)",
        "description": "The Alternative Certification in Special Education program at Northern Kentucky University is a graduate-level program that allows a student to receive a Temporary Provisional Certificate in Learning and Behavior Disorders (LBD) or Moderate to Severe Disabilities (MSD) and teach while completing the requirements for the Professional Certificate. The program offers a non-degree option, or the student may pursue a Master of Arts in Teaching (MAT) degree. The program is specifically designed to meet the needs of those who have a bachelor's degree in a field other than education and have been hired to teach special education in a Kentucky school district.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/altcertse.html",
        "Accreditation status": "NKU's educator preparation programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP) and the Kentucky Education Professional Standards Board (EPSB).",
        "Level": "Certificate",
        "Program name": "Alternative Certification in Special Education",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Director of Pupil Personnel (DPP) certification program is designed to prepare candidates to manage attendance, accounting of all pupils, visiting teacher services, and school social work services. The DPP works with students who have problems with attendance and connects them with services both within the school system and the community to foster their academic and personal success. At NKU, this certification is a 12 credit hour online program that offers an option for candidates to earn the Supervisor of Instruction certification with the addition of one 3 credit hour course.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/dpp.html",
        "Accreditation status": "The teacher education programs at Northern Kentucky University are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Director of Pupil Personnel",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Educational Leadership program at NKU offers post-master’s certifications for school principals, supervisors of instruction, directors of special education and school superintendents. The program prepares educational leaders to be collaborative and transformative to promote the success of all students. The School Superintendent Certification prepares candidates for the district-level leadership role of the school superintendent.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/superintendent.html",
        "Accreditation status": "Northern Kentucky University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC). The Educational Leadership programs are state-approved and accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Certificate",
        "Program name": "Educational Leadership School Superintendent Certification",
        "Program Page url": "https://www.nku.edu/admissions/graduate/programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Rank I program at Northern Kentucky University offers a planned program for teachers who have a master's degree and a valid teaching certificate. The program is designed to provide teachers with a program that is specifically designed to meet their professional development goals. The Rank I program leads to a salary increase in the state of Kentucky.",
        "program website url": "https://www.nku.edu/academics/coe/programs/graduate/rank1.html",
        "Accreditation status": "The College of Education is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Rank I Teaching",
        "Program Page url": "https://research.com/rankings/education/most-popular-education-highland-heights-ky"
    }
]