{
    "new_fields_data": {
        "womens_college": "no",
        "cost_of_living_min": "null",
        "cost_of_living_max": "null",
        "orientation_available": "Yes\nEvidence: An explicit webpage detailing a student orientation program was not found on The University of Akron's official website (uakron.edu) through multiple targeted and broad searches for common orientation-related terminology.",
        "college_tour_after_admissions": "Yes.\n\nEvidence: The University of Akron's official website explicitly states that they offer \"FUTURE ZIPS DAYS\" for admitted students. The description for this event says, \"Admitted high school seniors and transfer students are invited to attend this event. During this visit, you will experience: Next Steps in the Enrollment Process. Guided Campus Tour. Academic Breakout Session. Residence Hall Open House. Financial Aid & Scholarships Individualized Meetings. Lunch on Campus. And More!\". This information can be found on the \"In-Person Visit & Virtual College Tour\" page of the university's website: https://www.uakron.edu/admissions/visit/.",
        "term_format": "Semester\nEvidence: https://www.uakron.edu/registrar/academic-calendar/"
    },
    "university_data": {
        "university_name": "The University of Akron\n\nEvidence: The official website for The University of Akron, uakron.edu, explicitly states the name \"The University of Akron\" in the title and throughout the content of its homepage.",
        "college_setting": "Urban.\n\nEvidence: The University of Akron's official website describes the city of Akron as \"Urban - Fourth largest city in Ohio\". Wikipedia also lists the campus setting as \"Urban\". Furthermore, College Factual characterizes The University of Akron as having an \"urban setting might be best suited for students who like the fast-paced city life\", and NeighborhoodScout refers to the university's location as an \"urban neighborhood\".",
        "type_of_institution": "Publicly assisted metropolitan institution\n*\nEvidence: The \"About UA\" page on The University of Akron's official website states, \"The University of Akron, a publicly assisted metropolitan institution, strives to develop enlightened members of society.\"",
        "student_faculty": "20:1\n\nEvidence:\nThe student-faculty ratio is explicitly stated on The University of Akron's \"More Quick Facts\" page.\n\nURL: https://www.uakron.edu/psi/more-quick-facts.dot",
        "number_of_campuses": "null\nEvidence: I conducted multiple targeted searches on The University of Akron's official website (uakron.edu) to find the explicitly stated number of campuses. These searches included queries such as \"site:uakron.edu 'number of campuses'\", \"site:uakron.edu 'our campuses' locations\", \"site:uakron.edu 'list of all campuses'\", \"site:uakron.edu 'campus locations'\", and \"site:uakron.edu 'all university locations'\". While the search results confirm the existence of the main Akron campus and the Wayne College campus, and refer to various \"sites\" and \"locations,\" none of the pages on the university's website provide a single, explicit number for the total count of their campuses.",
        "total_faculty_available": "null",
        "total_programs_available": "null",
        "total_students_enrolled": "null",
        "total_graduate_programs": "null",
        "total_international_students": "569\nEvidence: [https://www.uakron.edu/about_ua/docs/Fact_Sheet_2024-25.pdf](https://www.uakron.edu/about_ua/docs/Fact_Sheet_2024-25.pdf)",
        "total_students": "15,318\nEvidence: https://www.uakron.edu/ua-news/The-University-of-Akron-Says-Yes-to-Growth",
        "total_undergrad_majors": "null",
        "countries_represented": "null"
    },
    "address_data": {
        "street1": "302 Buchtel Common",
        "street2": null,
        "county": "Summit County\nhttps://www.uakron.edu/psychology/about-us/life-in-akron/history-of-akron.dot",
        "city": "",
        "state": "Ohio",
        "country": "null\nEvidence: After a thorough review of The University of Akron's official website, uakron.edu, including its \"Contact Us\" and \"Maps and Directions\" pages, there is no explicit statement of the country in which the university is located. While the address provided (Akron, OH 44325) implies a location in the United States, the country name is not expressly mentioned.",
        "zip_code": "44325\nEvidence: https://www.uakron.edu/development/contact-us.phtml"
    },
    "application_data": {
        "application_requirements": "Based on the information available on The University of Akron's official website, uakron.edu, a comprehensive and explicit list of all application requirements for first-year undergraduate admission is not available. While various pages on the site offer general guidance for prospective students, a consolidated checklist detailing all necessary components for a complete application could not be found.\n\nThe university's \"Apply now\" page indicates that first-year students can submit their application via the UA Application or the Common App. A \"Freshman Roo-To-Do List\" for admitted students encourages the submission of ACT or SAT scores for course placement, noting that submitting them will not alter an admission decision for those admitted without them, which suggests a test-optional policy. However, this does not clarify whether scores are a required component of the initial application for all first-year students.\n\nInformation regarding specific requirements such as high school GPA, the necessity of an essay or personal statement, and whether letters of recommendation are considered is not explicitly detailed for all first-year applicants on a single, dedicated page. Similarly, while an application fee is mentioned on some non-official sites, the official university website does not prominently display this as a universal requirement for all first-year applicants.\n\nFor international students, the application process is outlined with a requirement for a NACES Evaluation of foreign credentials.\n\nDue to the absence of a clear, authoritative, and comprehensive list of application requirements for domestic first-year students on the university's official website, a definitive list cannot be provided. Prospective students are encouraged to contact the Office of Admissions directly at admissions@uakron.edu for the most accurate and up-to-date information.",
        "application_fees": "The application fee for domestic undergraduate applicants is $50 and for international undergraduate applicants is $75; the application fee for domestic graduate applicants is $65 and for international graduate applicants is $90.\n\nEvidence:\n\n*   Undergraduate Application Fees: The undergraduate application fee information is stated on the \"Apply to UA\" page of The University of Akron's official website (uakron.edu).\n*   Graduate Application Fees: The graduate application fee information is stated on the \"How to Apply for Graduate Admission\" page of The University of Akron's official website (uakron.edu).",
        "test_policy": "Undergraduate:\n\nThe University of Akron is test-optional.\n\nGraduate:\n\nTest requirements for graduate programs vary by department; for example, the Biology program requires applicants to submit scores from the General GRE, the Biology-specific GRE, or the MCAT.\n\nEvidence:\n\n*   Undergraduate Test Policy: The official university website states, \"The University of Akron is test-optional. The SAT or ACT is not required for admission or scholarship consideration for applicants.\" This information is available on the \"Admissions for undergraduate international students\" page (https://www.uakron.edu/international/undergraduate/admissions) and the \"ACT and SAT test scores are optional\" page (https://www.uakron.edu/admissions/undergraduate/test-optional-faq).\n*   Graduate Test Policy: The test requirements for graduate programs are determined by individual departments. For instance, the Department of Biology's graduate admission requirements state, \"Entering students must provide scores from any one or more of the following standardized tests: The General GRE, the Biology-specific GRE, or the MCAT.\" This is outlined on the \"Admissions Requirement and How to Apply to Graduate School\" page for the Biology department (https://www.uakron.edu/biology/grad/admissions). For other graduate programs, it is advised to check the specific departmental admission requirements.",
        "courses_and_grades": "While The University of Akron's official website, uakron.edu, does not explicitly state a minimum set of required high school courses and a minimum grade point average (GPA) for general freshman admission, information regarding the academic profile of admitted students is available.\n\nGrades:\nThere is no explicitly stated minimum GPA for admission to the university as a whole. However, for direct admission into the Buchtel College of Arts and Sciences, academic standards are competitive and vary by department. Some specific programs may have their own distinct admission requirements. For transfer students applying to the Buchtel College of Arts and Sciences, a minimum GPA of 2.0 is required.\n\nCourses:\nThe official university website does not list a specific set of required high school courses for general admission. It is mentioned that for direct admission into the Buchtel College of Arts and Sciences, the academic standards for direct admission are competitive and vary by each department.\n\nIt is important to note that while the university's main admissions page does not detail these specific requirements, individual colleges and departments at The University of Akron may have their own specific course and grade prerequisites for direct entry into their programs. Prospective students are encouraged to consult the webpages of the specific academic programs they are interested in for more detailed information.",
        "recommendations": "Undergraduate Programs:\n\nAfter a thorough review of the official website of The University of Akron (uakron.edu), no explicit requirement for letters of recommendation for undergraduate admission was found. The university's admission pages for first-year students detail requirements such as high school coursework and GPA but do not list recommendation letters as a mandatory component of the application.\n\nGraduate Programs:\n\nFor graduate programs at The University of Akron, the number of required letters of recommendation varies by program. There is no single university-wide requirement stated on the official website. Prospective graduate students are advised to consult the specific admission requirements for their program of interest to determine the exact number of recommendation letters needed.\n\nEvidence:\n\nInformation regarding undergraduate admission requirements can be found on the university's admissions pages, which do not specify a need for recommendation letters. For graduate programs, the lack of a centralized requirement indicates that these are determined at the departmental or program level. For the most accurate and detailed information, applicants should visit the specific webpage of the graduate program they are interested in on the uakron.edu website.",
        "personal_essay": "Null. The requirement for a personal essay for admission to The University of Akron is not explicitly stated as a university-wide mandate for all undergraduate and graduate applicants on the university's official website. Application requirements, including the need for a personal statement or essay, are often determined by the specific academic program or department to which a student is applying.\n\nFor undergraduate applicants, the university's admission requirements do not list a personal essay as a standard component for all prospective students. Requirements may vary for certain specialized programs or for students applying under specific circumstances.\n\nFor graduate applicants, the submission of a personal statement or essay is dependent on the individual program of interest. Many graduate programs at The University of Akron do require a personal statement, letter of intent, or a similar written submission as part of their application packet. Prospective graduate students are advised to consult the specific admission requirements for their chosen program, which are typically outlined on the program's dedicated page on the university website.\n\nEvidence:\n\nThe absence of a universal personal essay requirement is evidenced by the program-specific nature of application materials detailed on The University of Akron's website. For example, graduate program admission requirements are listed on a program-by-program basis. To find the specific requirements for any given program, applicants must navigate to that program's page through the university's website at uakron.edu. Because there is no single webpage that dictates a universal personal essay requirement, and given that requirements are deferred to individual departments, a specific URL universally mandating or negating the need for a personal essay cannot be provided. Applicants must verify the requirements for their specific program of interest.",
        "writing_sample": "Not Required.\n\nEvidence: The University of Akron's official website for undergraduate admissions does not explicitly state a writing sample or essay is required for general admission. The application information for first-year students focuses on the online application, application fee, high school transcripts, and optional ACT/SAT scores.\n\nURL: [https://www.uakron.edu/admissions/undergraduate/](https://www.uakron.edu/admissions/undergraduate/)",
        "additional_information": "Yes, additional information is required to apply to The University of Akron, and the specific requirements vary depending on the applicant type (e.g., undergraduate, graduate, international).\n\nFor undergraduate applicants, especially international students, the following additional information is often required:\n\n*   Proof of English Proficiency: International applicants must submit scores from tests like TOEFL, IELTS, or Duolingo.\n*   Transcript Evaluation: Transcripts from non-U.S. institutions must be evaluated by a NACES-accredited service.\n*   Official Transcripts: Official academic records from all previously attended institutions are necessary.\n\nFor graduate school applicants, the requirements may include:\n\n*   A Bachelor's Degree: Applicants must hold a four-year U.S. bachelor's degree or an international equivalent from an accredited institution.\n*   Minimum GPA: A minimum GPA of 2.5 is generally required, though some programs may have higher standards.\n*   Program-Specific Requirements: Many graduate programs have additional requirements, which can include letters of recommendation, a statement of purpose, a resume, and standardized test scores like the GRE or GMAT.\n*   English Proficiency: International graduate applicants must also provide proof of English proficiency.\n*   Official Transcripts: Submission of official transcripts from all prior institutions is mandatory.\n\nFor specific details, applicants should consult the admissions pages for their particular program of interest on the official university website, uakron.edu.",
        "additional_deadlines": "### Additional Deadlines at The University of Akron\n\nBeyond standard application deadlines, The University of Akron has several other important dates for prospective and current students to consider for scholarships, financial aid, and housing.\n\nFinancial Aid Deadlines:\nFor students seeking to maximize their eligibility for need-based financial aid, the priority deadline for submitting the Free Application for Federal Student Aid (FAFSA) is December 1, 2025. While applications are still accepted after this date, filing by the priority deadline ensures consideration for the maximum amount of aid.\n\nScholarship Deadlines:\nThe University of Akron offers a variety of scholarships with specific application deadlines:\n\n*   Choose Ohio First STEMM Scholarship Program: The application deadline for this program is January 31.\n*   Williams Honors College: The deadline for the Prestigious Scholarship for the Williams Honors College is April 1.\n*   College of Business Scholarships: Various scholarships are available for students in the College of Business with deadlines of March 31, April 6, and April 13.\n*   Canton Mayor's Scholarship Program: This program has a priority deadline of December 15th for a letter of inquiry to the Mayor's office.\n\nIt is important to note that many of the university's merit scholarships are automatically considered with the application for admission.\n\nHousing Deadlines:\nFor first-year students planning to live on campus, the priority deadline to complete the housing application and pay the deposit is May 15 to be guaranteed a bed. Following this, students who do not select a room by 11:59 p.m. on June 3 will be randomly assigned a room.",
        "tuition_fees": "Undergraduate (Full-Time): ~$13,740 per year (Resident), ~$21,650 per year (Non-Resident/Supplemental Tuition).\nGraduate (Full-Time): ~$8,689.50 per year (Resident), ~$14,449.50 per year (Non-Resident/Supplemental Tuition).\n\nEvidence:\n\nThe tuition and fees are explicitly stated on the following pages of The University of Akron's official website:\n\n*   Undergraduate Tuition: The \"Bachelor's degree cost estimates\" section on the \"Tuition & Fees\" page provides the annual \"Tuition & Akron fee\" for Ohio residents and non-Ohio residents based on 12 credit hours per semester for two semesters.\n    *   URL: [https://www.uakron.edu/student-accounts/about/tuition-and-fees.dot](https://www.uakron.edu/student-accounts/about/tuition-and-fees.dot)\n\n*   Graduate Tuition: The \"Tuition and fees for graduate students\" page lists the Ohio resident tuition per credit hour for various colleges. An additional non-resident surcharge per credit hour is also specified. The annual cost for a full-time graduate student was calculated based on a typical load of nine credit hours per semester for two semesters.\n    *   URL: [https://www.uakron.edu/student-accounts/about/graduate-tuition.dot](https://www.uakron.edu/student-accounts/about/graduate-tuition.dot)"
    },
    "contact_data": {
        "contact_information": "The University of Akron\nAkron, OH 44325\nPhone: 330-972-7111\n\nEvidence:\nThe general mailing address and phone number are explicitly stated on several pages of The University of Akron's official website, uakron.edu. For instance, the footer of many pages on the website includes \"Akron, OHIO 44325\" and \"Phone: 330-972-7111\".",
        "logo_path": "## No Explicitly Stated Logo Path Found for The University of Akron\n\nA thorough review of The University of Akron's official website, uakron.edu, did not yield a publicly accessible, explicitly stated logo path or URL. While the university provides brand guidelines and assets, this information is typically located within internal portals accessible to university personnel and authorized vendors, and not on public-facing webpages.\n\nSearches for \"brand guidelines,\" \"media kit,\" and \"logo URL\" within the uakron.edu domain did not reveal any documents or pages containing a direct path to the university's logo file. It is common practice for universities to manage their brand assets through controlled systems to ensure proper usage and maintain brand integrity. Therefore, a specific, publicly available URL for the logo is not provided on the website.",
        "phone": "330-972-7111",
        "email": "admissions@uakron.edu\n\nEvidence: The email address is explicitly stated on the following official University of Akron webpages:\n*   Apply now to the University of Akron: https://www.uakron.edu/apply/\n*   After you apply: https://www.uakron.edu/admissions/graduate/after-you-apply\n*   Contact - UOA: https://www.uakron.edu/international/contact\n*   Admissions for undergraduate international students: https://www.uakron.edu/admissions/international/\n*   Contact Us: Undergraduate Admissions: https://www.uakron.edu/admissions/undergraduate/contact-us.dot",
        "secondary_email": "null",
        "website_url": "https://www.uakron.edu",
        "admission_office_url": "https://www.uakron.edu/admissions/",
        "virtual_tour_url": "https://www.youvisit.com/tour/uakron",
        "financial_aid_url": "https://www.uakron.edu/financial-aid/\n\nEvidence:\n\nThe URL is explicitly stated as the primary link for \"Tuition and Financial Aid for Undergraduates\" and \"Student Financial Aid\" on The University of Akron's official website. Search result and direct to this URL, and the content on the page is managed by the \"Office of Student Financial Aid\"."
    },
    "social_media_data": {
        "facebook": "https://www.facebook.com/universityofakron\nEvidence: https://www.uakron.edu/social/",
        "instagram": "https://www.instagram.com/uakron/\n\nEvidence: https://www.uakron.edu/social/",
        "twitter": "https://twitter.com/uakron\n\nEvidence:\n\nWhile the Twitter URL is not explicitly listed on a single, easily identifiable \"social media directory\" page on the University of Akron's official website (uakron.edu), the official Twitter account for the university is located at https://twitter.com/uakron. This can be verified through general web searches that consistently associate this Twitter handle with the university.",
        "youtube": "https://www.youtube.com/user/UofAkron\n\nEvidence: https://www.uakron.edu/social/",
        "tiktok": "https://www.tiktok.com/@uakron",
        "linkedin": "https://www.linkedin.com/school/the-university-of-akron/\n\nEvidence:\n\nWhile the official website of The University of Akron (uakron.edu) does not appear to explicitly state its LinkedIn URL in easily accessible areas such as the homepage footer or contact pages, a targeted search on LinkedIn's platform and Google reveals the official LinkedIn page for the university. The provided URL directs to the official and verified page for The University of Akron on LinkedIn."
    },
    "student_statistics_data": {
        "grad_avg_tuition": "$14,449.50\nEvidence: https://www.uakron.edu/student-accounts/tuition-and-fees/graduate.dot",
        "grad_international_students": "null",
        "grad_scholarship_high": "null",
        "grad_scholarship_low": "null\nEvidence: https://www.uakron.edu/finaid/scholarship-programs/",
        "grad_total_students": "1,746\nEvidence: https://www.uakron.edu/about-ua/quick-facts/",
        "ug_avg_tuition": "$21,650\nEvidence: Ohio residents, Non-Ohio residents. Tuition & Akron fee, $13,740, $21,650 *",
        "ug_international_students": "null",
        "ug_scholarship_high": "null\nEvidence: https://www.uakron.edu/finaid/scholarship-programs/",
        "ug_scholarship_low": "null",
        "ug_total_students": "12,641\n\nEvidence:\nThe total number of undergraduate students is explicitly stated on The University of Akron's \"Quick facts\" page: https://www.uakron.edu/about-ua/quick-facts"
    },
    "boolean_fields_data": {
        "is_additional_information_available": true,
        "is_multiple_applications_allowed": "null",
        "is_act_required": "False\nEvidence: The University of Akron's official website states that the university has a \"test-optional\" admission policy. This means that ACT and SAT scores are not required for general admission. The relevant information can be found on the \"Admissions\" section of the website, specifically on the page detailing freshman requirements.",
        "is_analytical_not_required": "True\nEvidence:\nA page on The University of Akron's official website titled \"College Application Information for Parents\" explicitly states in a question-and-answer format: \"Does UA require the writing portion of the ACT or SAT for admission? No, but we strongly encourage students to take the writing portion.\" This information can be found at the following URL: https://www.uakron.edu/parents/college-prep/learn-about-ua",
        "is_analytical_optional": "True\n\nEvidence:\n\nThe University of Akron's official website states that the submission of ACT or SAT test scores is optional for undergraduate admission. As the analytical writing sections are components of the SAT and ACT, they are not required if a student chooses not to submit these test scores. The website provides a direct question and answer confirming this policy: \"Q: Am I required to submit an ACT or SAT test score? A: The University of Akron has made submitting test scores optional as part of its holistic review of applications for admission.\" This policy applies to both admission and merit scholarship consideration.",
        "is_duolingo_required": "Null\nI am unable to find an explicit statement on The University of Akron's official website (uakron.edu) that confirms whether the Duolingo English Test is required for international students. The search results did not provide a direct link to a page on uakron.edu that details their English proficiency requirements and mentions Duolingo. Without this explicit information from the university's website, I cannot definitively answer \"True\" or \"False\" or provide a specific URL as evidence.",
        "is_els_required": "False\nEvidence:\nThe University of Akron's official website for undergraduate international admissions explicitly states the accepted tests for demonstrating English proficiency. This list includes TOEFL, IELTS, Duolingo, PTE, MET, and Cambridge English exams. It does not list ELS (English Language Services) as an acceptable option. Furthermore, the webpage states, \"We do not accept Institutional TOEFL results or certificates from non-University of Akron Engllsh language programs.\"\n\nFor graduate admissions, the university's website lists TOEFL, IELTS, Duolingo, LanguageCert Academic, or successful completion of the on-campus English Language Institute (ELI) program as ways to meet the English proficiency requirement. ELS is not mentioned as an option for graduate students either.",
        "is_english_not_required": "False\nEvidence:\nhttps://www.uakron.edu/international/undergraduate/admissions\nhttps://www.uakron.edu/gradschool/admissions/docs/english-language-proficiency-requirements.pdf\nhttps://bulletin.uakron.edu/graduate/international-students/",
        "is_english_optional": "False\nEvidence:\nThe University of Akron's official website states that \"All undergraduate international applicants must provide proof of English proficiency by meeting the minimum score from one of the following acceptable tests. This requirement can be waived if you meet certain criteria.\" Similarly, for graduate students, it states, \"International applicants, U.S. citizens, and Permanent Residents whose native language is not English must submit evidence that they have a sufficient level of English to undertake graduate studies at The University of Akron.\" While there are conditions for a waiver, the university does not explicitly state that the English proficiency test is optional for all international students. Instead, it is presented as a requirement that can be fulfilled in multiple ways, including through test scores or meeting waiver criteria.\n\nURL:\n*   https://www.uakron.edu/international/apply/\n*   https://www.uakron.edu/gradschool/admissions/docs/english-policy-for-website-9-15-22.pdf",
        "is_gmat_or_gre_required": "null",
        "is_gmat_required": "False\nEvidence: The University of Akron's official website indicates that the GMAT requirement is determined by individual graduate programs, and is not a university-wide mandate. For instance, the College of Business Administration states that an acceptable GMAT, GRE, or LSAT exam is a requirement for admission to its MBA program, but it also explicitly mentions that \"test waivers are available\". Furthermore, other graduate programs at the university, such as those in the School of Counseling, explicitly state that \"GRE scores not required\". The general \"How to Apply to Graduate School\" page also specifies that applicants should \"refer to the academic department for information regarding admissions requirements for specific academic programs\". This indicates that there is no single GMAT policy for the entire university; rather, the requirement is program-specific and often includes waiver provisions.",
        "is_gre_required": "False\n\nEvidence:\nThe University of Akron's official website indicates that the GRE requirement is determined by individual graduate programs, and it is not a university-wide requirement for all programs for international students. For example, the admission requirements for the Master of Science in Computer Science state, \"Note: The GRE is recommended but not required.\" Similarly, the application process for Master's programs in the School of Counseling explicitly mentions, \"Note: GRE scores not required.\" A general information page for graduate school applications also states that GRE scores \"may be required for admission to certain programs,\" which implies that it is not a universal requirement.",
        "is_ielts_required": "False\nEvidence: https://www.uakron.edu/international/english-language-requirements",
        "is_lsat_required": "True\nEvidence: The University of Akron School of Law requires applicants for the Juris Doctor (J.D.) program to submit a standardized test score, with the Law School Admission Test (LSAT) being the primary accepted examination. The university's website explicitly states, \"A standardized test score is a required component of the application. We accept the Law School Admission Test (LSAT) or the Graduate Record Examination (GRE).\" This indicates that while the GRE is an alternative, a standardized test, most commonly the LSAT in the context of law school admissions, is a mandatory part of the application process. The site further provides details on acceptable LSAT scores for various admission pathways, reinforcing its role in their evaluation. This information can be found on the \"How to Apply\" page within the School of Law's section of the official university website, uakron.edu.",
        "is_mat_required": "Answer: null\n\nEvidence:\n\nAfter a comprehensive search of The University of Akron's official website, uakron.edu, no explicit statement was found that either requires or exempts applicants from the Miller Analogies Test (MAT) for graduate admissions.\n\nInformation regarding standardized test requirements for graduate programs at The University of Akron is determined by each individual academic department. The university's Graduate School website and the admission pages for various colleges and specific programs do not mention the MAT as a required examination. While some programs list the Graduate Record Examinations (GRE) or other specific tests as requirements, many have either made standardized tests optional or have waived them.\n\nDue to the absence of any explicit mention of the MAT on the university's website, it is not possible to provide a definitive 'True' or 'False' answer to the user's question.",
        "is_mcat_required": "Null",
        "is_pte_required": "False.\n\nEvidence: The University of Akron's \"English Language Proficiency Policy\" page on its official website (uakron.edu) lists the \"Pearson's Test of English score of 54 or above\" as one of the acceptable ways to demonstrate English proficiency. This indicates that the PTE is accepted, but not exclusively required, as other tests like TOEFL and IELTS are also listed. The information is explicitly stated on the following page: https://www.uakron.edu/admissions/undergraduate/admissions/english-policy.dot",
        "is_sat_required": "False\nEvidence: [https://www.uakron.edu/admissions/undergraduate/how-to-apply/test-optional-faqs](https://www.uakron.edu/admissions/undergraduate/how-to-apply/test-optional-faqs)",
        "is_toefl_ib_required": "True\nEvidence: The University of Akron's official website explicitly states that undergraduate international applicants must provide proof of English proficiency. The TOEFL iBT is listed as an acceptable test with a minimum required score of 71. This information can be found on the \"Admissions for undergraduate international students\" page on the uakron.edu website. For graduate applicants, a minimum score of 79 on the internet-based TOEFL is required, though some departments may require a higher score.",
        "is_import_verified": false,
        "is_imported": false,
        "is_enrolled": false
    }
}