[
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Associate of Science in Culinary Arts",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "If you’re ready to start building a career in the dynamic and exciting hospitality and events industries, the University of North Alabama’s Associate of Science (AS) in Hospitality and Events Management will provide you with the foundational knowledge and skills you need. You will learn the core principles of hospitality operations, including front office management, food and beverage service, event planning, and customer relations. The curriculum is designed to equip you with the practical expertise and critical thinking abilities essential for success in entry-level and supervisory roles within hotels, resorts, restaurants, event venues, and more. With a strong emphasis on real-world application, this program prepares graduates to seamlessly transition into the workforce or continue their education at a four-year institution.",
        "program website url": "https://hospitalityprep.com/hospitality-management-degree-in-alabama/",
        "Accreditation status": null,
        "Program name": "Associate of Science in Hospitality and Events Management",
        "Program Page url": "https://hospitalityprep.com/hospitality-management-degree-in-alabama/"
    },
    {
        "Concentration name": "Accounting",
        "description": "The Bachelor of Business Administration (BBA) degree provides students with a broad knowledge of business functions and processes. Students learn to think critically, solve problems, and communicate effectively, preparing them for a wide range of career opportunities in various industries or for further graduate study.",
        "program website url": "https://www.una.edu/business/undergraduate/bachelor-of-business-administration-bba/index.html",
        "Accreditation status": "The College of Business is accredited by AACSB International, the premier accrediting body for collegiate business programs. Less than 5% of all business schools worldwide have earned AACSB accreditation.",
        "Program name": "Bachelor of Business Administration in Accounting",
        "Program Page url": "https://www.una.edu/business/undergraduate/bachelor-of-business-administration-bba/index.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor of Science in Applied Health Science",
        "Program Page url": "https://publichealth.indiana.edu/undergraduate/degrees-majors/bs-applied-health-sciences/index.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Biology degree provides students with a broad exposure to biology and allows for a greater number of elective hours than the Bachelor of Science in Biology degree. The flexibility offered by the additional elective hours in the Bachelor of Arts degree provides an excellent opportunity for students to pursue a double major or a minor in a related field such as chemistry or psychology. The Bachelor of Arts degree is an ideal choice for students interested in preparing for careers in areas such as pharmacy, medical technology, health-related fields, environmental law, forensics, scientific illustration, or science writing.",
        "program website url": "https://www.una.edu/biology/index.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Biology",
        "Program Page url": "https://www.una.edu/biology/index.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Biology is designed to provide students with a solid foundation in the biological sciences. The curriculum emphasizes critical thinking, problem-solving, and laboratory skills necessary for careers in biological research, healthcare, education, and various other fields. Students will develop a comprehensive understanding of biological principles, ranging from molecular and cellular biology to ecology and evolution. Concentrations are available in Pre-Health, Ecology and Environmental Biology, Microbiology/Cell Biology, Bioinformatics, and General Biology, allowing students to tailor their studies to specific career interests. Graduates of the program are well-prepared for entry-level positions in diverse biological fields or for further graduate or professional studies.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/biological-sciences/biology-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Cellular & Molecular Biology Option",
        "description": "This option is designed for students interested in careers or graduate studies in molecular biology, cell biology, genetics, biotechnology, microbiology, immunology, virology, and related fields. It provides a strong foundation in the molecular and cellular aspects of biology, preparing students for research, industry, and advanced academic pursuits in these dynamic fields.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-departments/arts-sciences/biology/biology-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Biology (Cellular & Molecular Biology Option)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Business Administration (Flex)",
        "description": "The Bachelor of Business Administration (B.B.A.) degree provides a strong core in business principles combined with a concentration in a specific area of business. In addition to the core, concentrations are offered in accounting, business administration (flex), economics, finance, general business, human resource management, management, and marketing. Students earning a B.B.A. degree are prepared for entry-level positions in a variety of business fields or for further study at the graduate level.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-departments/business-technology/business-administration/",
        "Accreditation status": "Accredited by AACSB International (for the College of Business and Technology)",
        "Program name": "Bachelor of Business Administration in Business Administration (Flex)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Chemistry provides a broad background in chemistry with less emphasis on advanced mathematics and physics than the Bachelor of Science programs. The degree is particularly well-suited for students wishing to combine the study of chemistry with another field through a double major or a minor, or for students interested in careers in areas such as forensic science, environmental science, secondary education, or in health-related fields. This major provides students with the background for admission to graduate programs in chemistry, biochemistry, and related fields as well as various professional schools (e.g., medical, dental, pharmacy).",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/chemistry-physics-earth-science/chemistry-ba/",
        "Accreditation status": null,
        "Level": "BA",
        "Program name": "Bachelor of Arts in Chemistry",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (B.S.) in Chemistry is one of the foundational degrees in the sciences. The B.S. in Chemistry requires 120 credit hours and a minimum of 40 credit hours in Chemistry lecture and laboratory courses. This degree program is approved by the American Chemical Society (ACS) and provides the student with a comprehensive background in all areas of chemistry, including analytical, biochemistry, inorganic, organic, and physical chemistry. The Department of Chemistry and Physics offers the B.S. in Chemistry, the B.S. in Chemistry with American Chemical Society Certification, and the B.S. in Forensic Chemistry. Students graduating with a B.S. in Chemistry are well prepared for a wide range of career opportunities including chemistry, environmental science, chemical sales, chemical information science, technical writing, and laboratory support. Those students interested in pursuing professional or graduate studies in chemistry, biochemistry, chemical engineering, forensic science, medicine, dentistry, pharmacy, or other health professions will find the curriculum beneficial.",
        "program website url": "https://www.una.edu/chemistryandphysics/index.html",
        "Accreditation status": "Approved by the American Chemical Society (ACS)",
        "Program name": "Bachelor of Science in Chemistry",
        "Program Page url": "https://www.una.edu/chemistryandphysics/index.html"
    },
    {
        "Concentration name": "Cinematic Arts Track and Theatre Track",
        "description": "The Bachelor of Fine Arts in Cinematic Arts and Theatre provides an intensive professional education and pre-professional training for students seeking careers in film, television, or theatre. Students develop strong foundations in all aspects of filmmaking and theatre, including acting, directing, producing, screenwriting, cinematography, editing, sound design, stagecraft, and design. Through a rigorous curriculum combining theory and practice, students gain hands-on experience using industry-standard equipment and software. The program emphasizes collaboration, creativity, and critical thinking, preparing graduates to contribute meaningfully to the dynamic and evolving media and performing arts industries. It culminates in capstone projects allowing students to showcase their skills and artistic vision in a professional context.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-arts/cinematic-arts-theatre/bfa/",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Cinematic Arts and Theatre",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-arts/cinematic-arts-theatre/bfa/"
    },
    {
        "Concentration name": "Strategic Communication, Public Advocacy, Visual Communication",
        "description": "The B.A. in Communication Studies is a flexible program that allows students to customize their course of study in Communication through concentrations in Strategic Communication, Public Advocacy, or Visual Communication. This major is highly interdisciplinary and provides students with skills in critical thinking, writing, public speaking, visual communication, and the latest communication technologies. As one of the largest majors in the College of Arts and Sciences, the Communication Studies major gives students the foundational knowledge and skills to successfully communicate in a variety of personal and professional contexts. The program provides a broad understanding of communication theory and practice that prepares graduates for a wide range of career paths including public relations, marketing, journalism, media production, advocacy, and education. Students gain practical experience through internships, service-learning projects, and student organizations such as the UNA PRIDE Agency, Lambda Pi Eta, and the award-winning UNA Debate Team. The curriculum emphasizes ethical communication, cultural diversity, and global perspectives, ensuring graduates are well-rounded and prepared to make a positive impact in their communities and beyond. With a strong emphasis on practical skills and theoretical knowledge, the B.A. in Communication Studies prepares students for success in a rapidly evolving communication landscape.",
        "program website url": "https://www.una.edu/communication/Degree%20Program/communications-majors/communication-studies.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Communication Arts",
        "Program Page url": "https://www.una.edu/communication/Degree%20Program/communications-majors/communication-studies.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (BA) or Bachelor of Science (BS) in Communication Arts provides students with an understanding of human communication processes, including intrapersonal, interpersonal, intercultural, small group, organizational, and public. This program is designed to develop students’ communication competencies and prepare them for careers in a variety of fields such as public relations, journalism, broadcasting, advertising, marketing, human resources, government, and non-profit organizations. It also provides a strong foundation for graduate studies in communication or related disciplines. Students choose a BA or a BS degree based on their interests and career goals. Both degrees provide an emphasis on communication theory, research, and practice. The BS degree requires additional coursework in a natural or social science discipline, providing a more quantitative and analytical focus, while the BA degree requires additional coursework in a foreign language or humanities discipline, providing a more liberal arts focus. Students will gain skills in critical thinking, research, writing, public speaking, and digital media production.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/communications/ba-bs/ba-bs.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Communication Arts",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/communications/ba-bs/ba-bs.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Business Administration in Computer Information Systems (BBA-CIS) program prepares students for a variety of entry-level business positions utilizing information technology. The curriculum focuses on business applications, including programming, systems analysis and design, database management, web applications, cybersecurity, data analytics, and networking. The program combines business courses and computer information systems courses to provide a broad understanding of how technology can be used to solve business problems and improve organizational efficiency. Upon completion of the program, students will be able to analyze, design, and implement information systems, manage data resources, develop web-based applications, and understand cybersecurity principles. Graduates are prepared for careers such as business systems analysts, database administrators, web developers, cybersecurity analysts, and data analysts.",
        "program website url": "https://catalog.una.edu/undergraduate/college-business/computer-science-information-systems/bba-computer-information-systems/",
        "Accreditation status": "AACSB International",
        "Program name": "Bachelor of Business Administration in Computer Information Systems",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (B.S.) degree in Computer Science is designed to prepare students for careers in computer science and for further study in graduate school. Computer science is a broad and rapidly changing field that includes the study of algorithms, data structures, computer organization, operating systems, programming languages, software engineering, and database systems. The program provides a strong foundation in these areas, as well as in mathematics and science. Students will develop problem-solving skills, critical thinking, and the ability to design, implement, and test complex software systems. The program also emphasizes ethical considerations in computing and the importance of lifelong learning.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/computer-science/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Computer Science",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Department of Criminal Justice offers a Bachelor of Arts degree in Criminal Justice and two minors: Criminal Justice and Forensic Science. The mission of the Department of Criminal Justice is to provide an educational program that prepares students for employment in various components of the criminal justice system at the federal, state, and local levels and to provide a foundation for graduate study. Students are provided with a comprehensive curriculum that includes theoretical and applied knowledge in criminal justice. The faculty prepares students for a diverse society through the development of critical thinking, effective communication, and problem-solving skills.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/criminal-justice/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Criminal Justice",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Criminal Justice Program at the University of North Alabama seeks to provide a high-quality educational experience for its students by providing instruction in theoretical and applied knowledge of the criminal justice system to foster career readiness for employment in criminal justice agencies or prepare students for graduate and/or law school. The program aims to provide students with the theoretical and applied knowledge of the criminal justice system, the ability to think critically and express themselves effectively, and the knowledge and skills necessary for employment in criminal justice agencies or preparation for graduate and/or law school.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/criminal-justice/criminal-justice-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Criminal Justice",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Culinary Arts Management degree provides students with an education focused on culinary skills, food safety, nutrition, and cost control for restaurants, food service businesses, and institutional kitchens. The program prepares students for leadership roles in the culinary industry including executive chef, catering director, restaurant manager, and food and beverage director. Students will gain practical experience in the commercial kitchen at the Lion’s Den, the hospitality management program’s dining lab.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/hospitality-tourism-management/culinary-arts-management-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Culinary Arts Management",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Economics",
        "description": "The Bachelor of Business Administration (BBA) degree is designed to provide graduates with a broad understanding of business principles and practices, and to prepare them for careers in a variety of business fields or for graduate study. All BBA candidates must complete the business core requirements and major-specific requirements. The BBA in Economics provides students with a broad understanding of economic principles and how they apply to a variety of business, policy, and social issues. Students will learn to analyze markets, firms, and economic policies using quantitative and qualitative methods. This program prepares students for careers in business, government, and non-profit organizations, as well as for graduate studies in economics, law, or business.",
        "program website url": null,
        "Accreditation status": "Accredited by AACSB International",
        "Program name": "Bachelor of Business Administration in Economics",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/business/business.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Engineering (B.E.) is a general engineering degree that emphasizes a broad engineering education allowing graduates to pursue various career opportunities. The program prepares graduates for further study in graduate school or for employment in the chemical, civil, computer, electrical, industrial, and mechanical engineering fields. Graduates are expected to possess a strong background in mathematics and sciences with a broad knowledge of different engineering disciplines as well as strong communication skills to be able to work in interdisciplinary teams to solve complex problems within the global economy. All concentrations within the B.E. program are accredited by the Engineering Accreditation Commission of ABET.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/engineering-be/",
        "Accreditation status": "Accredited by the Engineering Accreditation Commission of ABET.",
        "Program name": "Bachelor of Engineering",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Advanced Manufacturing, Computer-Aided Design and Drafting (CADD), Construction Management, Electrical Technology, Industrial Management, Occupational Health and Safety, Robotics and Automation",
        "description": "The Bachelor of Science in Engineering Technology program is designed to provide students with a broad and fundamental education in the applied engineering sciences and technology fields. The program emphasizes the application of scientific and engineering principles to the design, implementation, and operation of engineered systems. Students in the program will develop problem-solving skills, critical thinking, and practical expertise through hands-on experiences and theoretical coursework. Graduates will be prepared for technical and management careers in various industries, including manufacturing, automation, energy, and construction, or for further graduate studies.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/engineering-industrial-professions/bs-engineering-technology/",
        "Accreditation status": "Accredited by the Engineering Technology Accreditation Commission of ABET, https://www.abet.org.",
        "Program name": "Bachelor of Science in Engineering Technology",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/engineering-industrial-professions/bs-engineering-technology/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in English from the University of North Alabama provides students with a broad and deep understanding of literature, language, and writing. The program emphasizes critical thinking, analytical skills, and effective communication, preparing them for diverse career paths and advanced studies. Students will engage with a wide range of literary texts from various periods and cultures, develop their analytical and interpretive abilities, and refine their writing through different genres and styles. The curriculum is designed to foster intellectual curiosity, creativity, and a nuanced appreciation of the power of language. The program offers concentrations in Creative Writing, Professional Writing, Film Studies, and Literary Studies, allowing students to tailor their degree to their specific interests and career aspirations. Graduates are well-prepared for careers in fields such as education, publishing, journalism, marketing, law, and government, as well as for graduate studies in English or related disciplines.",
        "program website url": "https://catalog.una.edu/preview_program.php?catoid=40&poid=5676",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in English",
        "Program Page url": "https://catalog.una.edu/"
    },
    {
        "Concentration name": null,
        "description": "Our Bachelor of Science in English and Writing degree helps you discover your creative edge by mastering the art of the written word. This B.S. program is offered 100% online or in a residential format, so you can pursue your degree in a way that best fits your schedule and learning style. Whether you are passionate about literature, creative writing, or education, our B.S. in English and Writing program will challenge you to think critically about texts and develop a versatile skill set in communication. The B.S. in English and Writing program provides students with a Christ-centered academic experience built on a liberal arts foundation. You’ll be able to explore the art of writing while diving into some of the most prominent pieces of literature in history. You’ll also get the chance to: Become proficient in language, rhetoric, and composition; Develop advanced skills in critical thinking, research, and communication; Grow in a Christ-centered community and gain spiritual leadership skills; Receive mentorship from professors who have years of experience in their field; Study topics like fiction writing, screenwriting, poetry, and literary analysis.",
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in English",
        "Program Page url": "https://www.liberty.edu/arts-sciences/bachelors/english-writing/"
    },
    {
        "Concentration name": null,
        "description": "The Entertainment Industry program at the University of North Alabama provides students with a broad knowledge of the entertainment industry combined with focused training in one of four concentrations. The program offers both a Bachelor of Arts (BA) and a Bachelor of Science (BS) degree option for its students. Graduates of the program are prepared for a variety of careers in entertainment or to continue their education in graduate school.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-arts/entertainment-industry/ba-bs/",
        "Accreditation status": null,
        "Level": "Bachelor of Arts (BA) / Bachelor of Science (BS)",
        "Program name": "Bachelor of Arts in Entertainment Industry",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-arts/entertainment-industry/ba-bs/"
    },
    {
        "Concentration name": "Performance Emphasis, Technical/Business Emphasis",
        "description": "The Bachelor of Science in Entertainment Industry is designed to provide students with the skills and knowledge to enter the entertainment industry in a variety of capacities. This interdisciplinary program provides students with a broad understanding of the creative, technical, and business aspects of the entertainment industry. Students will gain practical experience in areas such as audio production, video production, live event management, and business practices specific to the entertainment sector. The curriculum is structured to foster critical thinking, problem-solving, and collaboration, preparing graduates for dynamic careers in fields such as music, film, television, gaming, and live performance. The program is offered through the Department of Communications and Theatre and includes courses from various disciplines including Communication, Computer Science, Marketing, and Management. It offers two areas of emphasis: Performance and Technical/Business, allowing students to tailor their studies to their career interests.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/communications-theatre/entertainment-industry-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Entertainment Industry",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Entertainment Business Option",
        "description": "The Bachelor of Arts in Entertainment Industry is designed to provide students with comprehensive skills and knowledge across various facets of the entertainment world. With concentrations in Entertainment Business, Production and Performance, and Technical Production, students can tailor their degree to their specific interests and career aspirations. Our curriculum balances theoretical knowledge with hands-on experience, preparing graduates for successful careers in dynamic fields such as music, film, television, live events, and emerging digital media.",
        "program website url": "https://www.una.edu/entertainment-industry/index.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Entertainment Industry (Entertainment Business Option)",
        "Program Page url": "https://www.una.edu/sitemap.xml"
    },
    {
        "Concentration name": "Entertainment Business Option",
        "description": "The Bachelor of Science in Entertainment Industry prepares students for a variety of careers in the music, recording, film, television, and game industries. Students gain an understanding of entertainment history, industry business, production processes, and technology. Students select from the following options: Production and Technology, Entertainment Business, or Emerging Media.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/entertainment-industry-bs/",
        "Accreditation status": null,
        "Level": "BS",
        "Program name": "Bachelor of Science in Entertainment Industry (Entertainment Business Option)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Entertainment Technology Option",
        "description": "The Entertainment Technology option provides students with the opportunity to develop skills and knowledge in the technical aspects of the entertainment industry including sound production, lighting, video, editing, and staging. Students will gain hands-on experience in various entertainment technology applications, preparing them for roles in live events, broadcasting, film, and other media-related fields. A strong emphasis is placed on practical application and industry-standard technologies.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/communication-journalism-theatre/entertainment-industry-ba/#entertainmenttechnologyoptiontext",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Entertainment Industry (Entertainment Technology Option)",
        "Program Page url": "https://catalog.una.edu/"
    },
    {
        "Concentration name": "Entertainment Technology Option",
        "description": "The Bachelor of Science in Entertainment Industry provides students with foundational knowledge of the entertainment industry, while allowing them to specialize in specific areas of the industry through selected options. The entertainment industry program embraces a hybrid approach of traditional communication and business coursework combined with hands-on, skills-based learning. Students learn practical application in music, film, television, web-based media, and other entertainment related fields in their respective option. Internship opportunities and industry-focused curriculum provide students with experience prior to graduation. Graduates are prepared for careers in a wide range of fields related to music, film, television, game development, and live event production, depending on their chosen option. The Entertainment Technology Option prepares students to be successful in the technical areas of the entertainment industry. Students learn technical skills in areas such as audio and video production, live event production, entertainment lighting, computer aided design (CAD), game development, and augmented/virtual reality technologies. Graduates are prepared for technical positions in live event production, film, television, game development, audio production, and other entertainment technology related fields.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/communication/entertainment-industry-bs/#entertainmenttechnologyoptiontext",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Entertainment Industry (Entertainment Technology Option)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Exercise Science program provides students with a strong scientific foundation related to health, human movement, and disease prevention. The Exercise Science major will provide students with the knowledge and skills necessary to prepare them for careers in a variety of health and fitness professions (e.g., strength and conditioning coach, exercise physiologist, health fitness specialist, personal trainer, clinical exercise physiologist, etc.) or for graduate study (e.g., physical therapy, occupational therapy, chiropractic, medicine, physician assistant, exercise physiology, etc.). The curriculum includes courses in anatomy and physiology, biomechanics, exercise physiology, nutrition, strength and conditioning, exercise testing and prescription, and motor learning. The program is committed to developing competent and ethical professionals dedicated to promoting healthy lifestyles and improving the quality of life for individuals across the lifespan.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/health-physical-education-recreation/bs-exercise-science/",
        "Accreditation status": null,
        "Level": "BS",
        "Program name": "Bachelor of Science in Exercise Science",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/health-physical-education-recreation/bs-exercise-science/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (B.S.) in Fashion Merchandising and Design offers students the option to focus their studies in either fashion merchandising or fashion design. Graduates of the program are prepared for a variety of careers in the fashion industry, including fashion buyer, visual merchandiser, apparel designer, textile designer, product developer, fashion illustrator, retail manager, and more. The Fashion Merchandising and Design program at the University of North Alabama offers students a comprehensive education in the dynamic and evolving fashion industry. Students gain hands-on experience through internships, study tours, and participation in fashion shows and industry events. The program emphasizes creativity, critical thinking, and practical skills development, preparing students for successful careers in various aspects of the fashion world. UNA's location in Florence, Alabama, a city known for its vibrant arts and culture scene, provides unique opportunities for students to connect with local designers, boutiques, and businesses, further enhancing their learning experience.",
        "program website url": "https://www.una.edu/art/degree/fashion-merchandising-and-design.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Fashion Merchandising and Design",
        "Program Page url": "https://www.una.edu/art/degree/fashion-merchandising-and-design.html"
    },
    {
        "Concentration name": "Finance",
        "description": "A major in Finance (FIN) will introduce students to the areas of financial management, banking, investments, financial planning, real estate, and international finance. Through a combination of general education, business core, and finance coursework, students will develop analytical skills and knowledge useful in a variety of financial careers.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/business/department-economics-finance/department-economics-finance.pdf",
        "Accreditation status": "Accredited by AACSB International",
        "Level": "Bachelor of Business Administration",
        "Program name": "Bachelor of Business Administration in Finance",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/business/department-economics-finance/department-economics-finance.pdf"
    },
    {
        "Concentration name": "Fitness Management",
        "description": "The Bachelor of Science in Health and Fitness degree with a concentration in Fitness Management prepares students for professional careers in the growing field of health and fitness. This concentration is designed to provide students with the knowledge and skills necessary to work in various settings such as corporate fitness programs, wellness centers, hospitals, community fitness programs, and sports performance facilities. Students will gain a strong foundation in exercise science, nutrition, program design, and business management principles specific to the fitness industry. The curriculum emphasizes both theoretical knowledge and practical application, preparing graduates to manage fitness facilities, develop comprehensive wellness programs, and lead clients towards healthier lifestyles.",
        "program website url": "https://www.una.edu/education/bachelor-degrees/bachelor-of-science-health-and-fitness.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Fitness Management",
        "Program Page url": "https://www.una.edu/education/bachelor-degrees/bachelor-of-science-health-and-fitness.html"
    },
    {
        "Concentration name": "French, Spanish",
        "description": "The Department of Foreign Languages provides opportunities for students to study the languages and cultures of France, Germany, and Spain/Latin America. The ability to communicate in another language is not only personally enriching but also an important asset in an increasingly global society. The Bachelor of Arts in Foreign Languages prepares students to live and work in the global community and provides the necessary foundation for students wishing to pursue graduate studies in French or Spanish. Courses in French and Spanish provide students with proficiency in the target language and a thorough understanding of the culture. Minors in French, German, and Spanish are also available. Students majoring in a foreign language should consult with the chair of the Department of Foreign Languages to plan their programs.",
        "program website url": "https://www.una.edu/academics/undergraduate-catalog/college-of-arts-and-sciences/department-of-foreign-languages.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Foreign Languages",
        "Program Page url": "https://www.una.edu/sitemap.xml"
    },
    {
        "Concentration name": null,
        "description": "The Department of Geoscience offers a Bachelor of Arts (BA) or a Bachelor of Science (BS) in Geography, a Bachelor of Science (BS) in Geology, and a Bachelor of Science (BS) in Geospatial Science. Minors are also available in Geography, Geology, and Geospatial Science. The Geoscience program explores the earth system through the disciplines of geology, geography, and geospatial science. Students learn to think critically and apply a scientific approach to understanding the physical and cultural processes that shape the earth and human society. Students learn to use various tools and techniques to analyze and interpret data, including GIS, remote sensing, and field methods. Graduates are prepared for careers in environmental consulting, natural resource management, urban and regional planning, geological mapping, hazard assessment, and various government agencies. The program also provides a strong foundation for graduate studies in geology, geography, environmental science, and related fields.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/geoscience/ba-bs-geography/ba-bs-geography.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Geography",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/geoscience/ba-bs-geography/ba-bs-geography.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Geography offers three options (Standard, Geographic Information Science, and Earth Systems Science) and prepares students for careers in diverse fields such as environmental science, city and regional planning, cartography, Geographic Information Systems (GIS), hydrology, meteorology, climatology, remote sensing, and location analysis. It also provides an excellent foundation for graduate studies in Geography and related fields. Geography is the interdisciplinary study of the Earth’s surface processes and human interactions with the natural world, focusing on spatial patterns and relationships. Geographers study the physical environment and human landscapes through qualitative and quantitative analysis, fieldwork, mapping, and the use of cutting-edge geospatial technologies (GIS, remote sensing, and GPS).",
        "program website url": "https://www.una.edu/programs/degrees/bs-geography.html",
        "Accreditation status": null,
        "Level": null,
        "Program name": "Bachelor of Science in Geography",
        "Program Page url": "https://www.una.edu/registrar/Academic%20Calendars/index.html"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Health & Fitness program prepares students for careers in the rapidly growing field of health promotion and wellness. Graduates of this program are qualified for employment in various settings, including corporate wellness programs, hospitals, community health organizations, fitness centers, and governmental agencies. Students can also pursue graduate studies in related fields such as exercise physiology, public health, and physical therapy.",
        "program website url": "https://catalog.una.edu/undergraduate/education-human-sciences/health-physical-education-recreation/health-fitness-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Health & Fitness",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor_of_Science in Health Promotion",
        "Program Page url": "https://www.fhsu.edu/hhp/academic-programs/"
    },
    {
        "Concentration name": null,
        "description": "The Hospitality and Events Management program provides students with a strong business foundation and specialized knowledge in the management of hospitality operations and events. The curriculum includes courses in hotel operations, food and beverage management, event planning and execution, tourism, and marketing, preparing students for leadership roles in various segments of the hospitality and events industry. Graduates will possess the analytical, critical thinking, and communication skills necessary to succeed in a dynamic global environment.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-departments/business-technology/management-marketing/hospitality-events-management-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Hospitality and Events Management",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts in Interior Architecture and Design is a professional degree that prepares students for careers in the dynamic and growing field of interior architecture and design. The curriculum provides a broad base of knowledge, skills, and creative problem-solving abilities necessary to become competent design professionals, providing the highest quality of design for the built environment. Students learn to critically analyze complex design problems from a variety of perspectives, including historical, theoretical, environmental, social, and cultural contexts. The program provides the foundational skills and conceptual knowledge for creating innovative and sustainable interior environments that enhance human well-being and productivity. The B.F.A. program emphasizes design studio courses that focus on both residential and commercial projects, ranging in scale from small residential spaces to large-scale public institutions. Students develop strong visual communication skills through hand sketching, digital rendering, and model making. The program also integrates professional practice courses, including business practices, project management, and ethics, preparing students for successful careers in the industry.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/visual-fine-arts/interior-architecture-design-bfa/",
        "Accreditation status": "The Bachelor of Fine Arts in Interior Architecture and Design program is accredited by the Council for Interior Design Accreditation (CIDA).",
        "Level": "BFA",
        "Program name": "Bachelor of Fine Arts in Interior Architecture and Design",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Interdisciplinary Studies (IDS) is designed for students who desire a personalized and flexible course of study. The IDS major provides students with the opportunity to synthesize courses from multiple disciplines into a cohesive program of study focused on an interdisciplinary theme, question, or problem. Students work closely with an IDS faculty advisor to create a unique course of study around an interdisciplinary focus. The IDS major offers students the opportunity to integrate knowledge from a variety of disciplines and apply it to an interdisciplinary topic of their choosing. Students learn how to analyze complex issues from multiple perspectives, develop critical thinking skills, and effectively communicate their ideas. The IDS program is especially well-suited for students who seek to combine diverse academic interests and design an academic path that is truly their own. This unique degree offers both breadth and depth through its interdisciplinary framework. Students are afforded the opportunity to gain expertise in a chosen area of interest by selecting upper-division courses from two or more departments, colleges, or programs. The IDS curriculum offers students flexibility in tailoring a program of study to meet their individual goals and professional aspirations. The IDS curriculum prepares graduates for a wide array of career options as well as graduate and professional studies. In addition to gaining expertise in a chosen area of interest, students will complete an Interdisciplinary Studies senior project/capstone. The senior project provides an opportunity for students to demonstrate their ability to integrate knowledge from across their selected disciplines, apply critical analysis, and communicate their findings effectively.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-professional-studies/interdisciplinary-professional-studies.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Interdisciplinary Studies",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/interdisciplinary-professional-studies/interdisciplinary-professional-studies.pdf"
    },
    {
        "Concentration name": null,
        "description": "Interdisciplinary Studies represents a field of study in which students learn to integrate knowledge from two or more academic disciplines to address complex problems or questions. Rather than viewing problems through the lens of a single discipline, students in Interdisciplinary Studies are taught to synthesize insights from multiple perspectives to gain a more comprehensive understanding. The Bachelor of Science in Interdisciplinary Studies (BIS) degree at the University of North Alabama allows students to design their own degree program by combining a minimum of three academic disciplines (18-36 hours) into a customized curriculum that meets their unique academic and professional goals. This program is offered completely online, making it ideal for place-bound students and working adults seeking a flexible pathway to degree completion. A BIS degree allows students to cultivate skills in critical thinking, research, communication, and problem-solving through a self-designed curriculum that aligns with their professional and personal interests. This degree helps students develop a broad and adaptable skill set that is attractive to employers in a wide range of fields. UNA's BIS program is offered completely online, allowing students to balance their education with work, family, and other commitments.",
        "program website url": "https://www.una.edu/interdisciplinary-studies",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Interdisciplinary Studies",
        "Program Page url": "https://www.una.edu/interdisciplinary-studies/docs/BIS_brochure.pdf"
    },
    {
        "Concentration name": "Accommodation and Service Industry Management",
        "description": "The Bachelor of Business Administration in Professional Management offers concentrations to prepare students to work in various business settings. The program will enhance the ability of students to develop solutions to complex organizational problems and implement various management techniques. This degree is designed to develop a comprehensive understanding of human behavior in organizations, resource management, organizational behavior and performance. The program curriculum is suitable for both traditional and non-traditional students and aims to provide students with the business skills and knowledge to succeed in diverse management fields.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/business/department-management-marketing/bba-professional-management/",
        "Accreditation status": "AACSB International (The Association to Advance Collegiate Schools of Business) accreditation",
        "Program name": "Bachelor of Business Administration in Professional Management (Accommodation and Service Industry Management Concentration)",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/business/department-management-marketing/bba-professional-management/"
    },
    {
        "Concentration name": "Digital Marketing",
        "description": "The Bachelor of Business Administration degree with a major in Professional Marketing (BBA) is an excellent choice for students who want to develop the knowledge and skills necessary to successfully compete in the rapidly evolving marketing environment. The curriculum covers a wide range of topics, including marketing principles, consumer behavior, market research, digital marketing strategies, professional selling, and international marketing. Students gain a deep understanding of how to identify target markets, develop effective marketing campaigns, and build strong customer relationships. Additionally, students have the option to specialize in either Digital Marketing or Professional Sales, allowing them to tailor their education to their specific career interests. With a strong emphasis on practical application and real-world case studies, graduates of the Professional Marketing BBA program are well-prepared for a variety of marketing roles in both corporate and non-profit organizations. Overall, this program provides a comprehensive and practical education that equips students with the skills and knowledge needed to excel in the dynamic field of marketing.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-departments/business-technology/management-marketing/professional-marketing-bba/",
        "Accreditation status": "All College of Business Administration degree programs are accredited by AACSB International.",
        "Program name": "Bachelor of Business Administration in Professional Marketing (Digital Marketing Concentration)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts (BA) and Bachelor of Science (BS) in Occupational Health Science program is designed for students seeking entry-level professional positions and/or graduate education within the fields of safety, health, and environmental (SHE) management. The degree provides an interdisciplinary approach focusing on technical skills and competencies, management, problem-solving, and communication skills necessary for addressing and preventing occupational injuries and illnesses in various industrial, governmental, and healthcare settings. Students are prepared to recognize, evaluate, and control environmental factors and stressors arising from the workplace that may cause sickness, impaired health and well-being, or significant discomfort among workers or the general public.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/engineering-industrial-professions/ba-bs-ohs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Occupational Health Science",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/engineering-industrial-professions/ba-bs-ohs/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Occupational Health Science prepares students for careers as occupational health and safety professionals. The program provides the knowledge and skills necessary to anticipate, recognize, evaluate, and control occupational health and safety hazards. Graduates are prepared for a variety of roles including safety officers, industrial hygienists, and environmental health specialists in various industries, government agencies, and consulting firms. The curriculum emphasizes both the scientific principles and practical applications of occupational health and safety, including risk assessment, regulatory compliance, ergonomics, toxicology, and emergency preparedness. Students will gain hands-on experience through laboratory work and internship opportunities, fostering a comprehensive understanding of real-world challenges in the field.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/health-human-performance/occupational-health-science-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Occupational Health Science",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "General Physics Option",
        "description": "The Physics program focuses on the principles of the universe, from the very large (cosmology) to the very small (quantum mechanics). Students in the Physics program develop critical thinking skills and problem-solving abilities that are highly sought after by employers and graduate programs. Graduates with a B.A. in Physics pursue a wide range of careers including engineering, computer science, research, education, and medicine, to name a few. The General Physics Option is designed for students seeking a broad education in physics and preparing for careers outside of pure physics research, or for those intending to pursue graduate studies in interdisciplinary fields. It provides a strong foundation in physics while allowing flexibility for students to tailor their studies with elective courses.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/chemistry-physics/physics-ba-general-physics-option/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Physics (General Physics Option)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "General Physics Option",
        "description": "The Bachelor of Science (BS) in Physics with a General Physics Option is designed to prepare students for a wide variety of career opportunities or for graduate school. The Physics curriculum provides a strong background in mathematics and physics, with additional work in areas of interest to the student, such as computer science, engineering, or research. Students are encouraged to participate in undergraduate research and to complete an internship.",
        "program website url": "https://www.una.edu/physics/bs-physics-general-physics.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Physics (General Physics Option)",
        "Program Page url": "https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQEAbvS-Cg5Hx1T7Q-LelsoTZ0bzMFL5Aj0O3_mNVljYChjdHtCTGVJyOprpeno8lOHCCocxUOecBgIGSt0FBsCsDLlKxq3cBlLHzuLf3IYFpuPPXMVeqSrZ3Rk89atrnSEMO7mls3HhtzH3kSBvnA=="
    },
    {
        "Concentration name": null,
        "description": "Political science is the systematic study of governments, public policies, political processes, and political behavior. It is a broad field, encompassing a variety of subfields including American politics, comparative politics, international relations, political theory, and public law. The Political Science program at UNA provides students with a comprehensive understanding of these areas, preparing them for careers in government, law, non-profit organizations, education, and journalism, as well as for graduate study. Our curriculum emphasizes critical thinking, analytical skills, and effective communication, essential tools for success in any field. Students will learn how to analyze political issues, evaluate policy proposals, and engage in informed civic participation. The program fosters a deep appreciation for democratic values and institutions, and encourages students to become active and responsible citizens.",
        "program website url": "https://www.una.edu/pjlp/index.html",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Political Science",
        "Program Page url": "https://www.una.edu/pjlp/index.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/pjlp/pjlp.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Political Science",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/pjlp/pjlp.pdf"
    },
    {
        "Concentration name": null,
        "description": "Psychology is a science that strives to understand human and animal behavior. Students majoring in psychology at UNA will gain knowledge of several areas of psychology, including abnormal, developmental, cognitive, social, and experimental psychology. Students will learn how to analyze and interpret psychological data, write research papers, and present psychological findings. The Bachelor of Arts (BA) degree requires 120 credit hours and a minor (18 hours) outside the department.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/psychology/psychology-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor_of_Arts in Psychology",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science (BS) in Psychology provides students with a broad and rigorous exposure to the science of behavior and mental processes. Through coursework, research opportunities, and practicum experiences, students develop critical thinking, problem-solving, and communication skills applicable to various careers and graduate programs. Graduates are prepared for entry-level positions in human services, research, and business, or for advanced study in psychology or related fields such as counseling, social work, and law.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/psychology-sociology/psychology-sociology.pdf",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Psychology",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/psychology-sociology/psychology-sociology.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Recreation program focuses on preparing students to become recreation professionals in a variety of settings. Students will develop skills in program planning, leadership, administration, and evaluation. The curriculum emphasizes experiential learning and practical application, ensuring graduates are well-equipped to meet the dynamic needs of the recreation and leisure industry. Graduates are prepared for careers in parks and recreation, community recreation, therapeutic recreation, outdoor recreation, and commercial recreation.",
        "program website url": "https://catalog.una.edu/undergraduate/health-physical-education-recreation/sport-recreation-management/recreation-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Recreation",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Social Work (BSW) program, housed in the Department of Sociology and Social Work, is designed to prepare students for generalist social work practice and for graduate study in social work. It provides students with a broad knowledge base of social work practice in a wide variety of settings. Students completing the BSW program receive a professional degree that provides a beginning level for professional employment and for entry into graduate schools of social work. The UNA BSW Program is accredited by the Council on Social Work Education (CSWE). The social work profession promotes social justice and social change with diverse populations in the pursuit of enhancing human well-being. It is founded on a core of professional values and ethics. The social work program at UNA uses experiential learning and faculty expertise to prepare students for the challenges and rewards of this profession. The curriculum includes course work in human behavior, social work practice, social welfare policy, research, and field education. The program’s mission is to prepare generalist social work students with the knowledge, values, and skills to work effectively with individuals, families, groups, organizations, and communities and to practice ethically in a diverse and complex world.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/social-work/",
        "Accreditation status": "Accredited by the Council on Social Work Education (CSWE)",
        "Program name": "Bachelor of Social Work",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/social-work/"
    },
    {
        "Concentration name": "Family Life Education",
        "description": "The Sociology program at UNA provides students with a broad and systematic study of society and human behavior. Sociology is the scientific study of the development, structure, interaction, and collective behavior of organized groups of human beings. Sociologists examine social factors, social change, and the social effects of human behavior. Sociology students analyze why and how people interact in social systems using both quantitative and qualitative techniques, while learning research, writing, critical thinking, and communication skills.\nThe Family Life Education concentration is designed to prepare students for careers in social service agencies, family support programs, and related fields. It also provides a strong foundation for graduate studies in marriage and family therapy, social work, counseling, and related areas. Students learn about family dynamics, child development, interpersonal relationships, and community resources. The curriculum emphasizes practical skills in program planning, evaluation, and client interaction.",
        "program website url": "https://www.una.edu/psychology-and-sociology/sociology-program/index.html",
        "Accreditation status": "Approved by the National Council on Family Relations (NCFR) as meeting the standards for the Provisional Certified Family Life Educator (CFLE) designation.",
        "Program name": "Bachelor of Arts in Sociology (Family Life Education)",
        "Program Page url": "https://www.una.edu/psychology-and-sociology/sociology-program/index.html"
    },
    {
        "Concentration name": "Family Life Education",
        "description": "The Family Life Education concentration leads to a Bachelor of Science degree. This concentration prepares students for careers in family life education, human services, and other professions related to family and community well-being. The curriculum is designed to meet the academic requirements for provisional certification as a Family Life Educator by the National Council on Family Relations (NCFR).",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/psychology-sociology/ba-bs-sociology/",
        "Accreditation status": "The curriculum is designed to meet the academic requirements for provisional certification as a Family Life Educator by the National Council on Family Relations (NCFR).",
        "Program name": "Bachelor of Science in Sociology (Family Life Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-humanities-social-sciences/psychology-sociology/ba-bs-sociology/"
    },
    {
        "Concentration name": null,
        "description": "The Sport and Recreation Management program in the Department of Health, Physical Education, and Recreation is committed to preparing students for successful careers in the sport and recreation industry. The curriculum focuses on developing knowledge and skills in areas such as sport marketing, facility management, event planning, finance, legal aspects of sport, and human resource management. Students gain practical experience through internships and field experiences, allowing them to apply classroom learning in real-world settings. The program emphasizes ethical leadership, critical thinking, and effective communication, preparing graduates to manage and lead various sport and recreation organizations. Career opportunities include positions in professional and collegiate sports, community recreation, event management, health and fitness clubs, and sports marketing firms.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/health-human-performance-recreation/sport-recreation-management-bs/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Sport and Recreation Management",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Sustainability provides students with the opportunity to pursue an interdisciplinary degree that explores the interdependent relationship between humans and the natural environment. Students will be introduced to issues that impact local, regional, and global sustainability efforts. The program emphasizes a holistic understanding of how environmental, economic, and social systems interact and influence each other. Students will develop critical thinking skills, problem-solving abilities, and ethical awareness to address complex sustainability challenges. The curriculum integrates knowledge from various disciplines, including environmental science, economics, political science, sociology, and ethics. Through coursework, research opportunities, and experiential learning, students will gain the expertise to contribute to sustainable development initiatives in diverse professional settings. Graduates will be prepared for careers in environmental management, urban planning, corporate social responsibility, policy analysis, non-profit advocacy, and further graduate studies in sustainability-related fields.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences-engineering/interdisciplinary-studies/sustainability-ba/",
        "Accreditation status": null,
        "Program name": "Bachelor of Arts in Sustainability",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Sustainability degree focuses on the interdisciplinary scientific and social aspects of sustainability. It provides students with the critical thinking and analytical skills to understand complex environmental, social, and economic issues and to develop innovative solutions for a sustainable future. The curriculum integrates knowledge from various fields, including environmental science, economics, sociology, political science, and ethics, to equip students with a holistic understanding of sustainability challenges and opportunities. Graduates will be prepared for careers in government agencies, non-profit organizations, and private industries, working to address sustainability issues at local, regional, and global scales, or to pursue graduate studies in sustainability or related fields.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/geoscience/bs-sustainability/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Sustainability",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-science-engineering-mathematics/geoscience/bs-sustainability/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Fine Arts (BFA) program is a professional degree in Visual Arts and Design that provides comprehensive training in various art disciplines and prepares students for careers in art, design, and related fields or for graduate study. This program focuses on developing advanced skills, critical thinking, and a professional portfolio through rigorous studio practice, art history, and theoretical studies. Students gain an in-depth understanding of artistic principles, techniques, and contemporary issues, fostering creative expression and innovative problem-solving.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences-engineering/art-design/art-bfa/",
        "Accreditation status": null,
        "Program name": "Bachelor of Fine Arts in Visual Arts and Design",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Arts in Visual Arts and Design provides students with a broad and comprehensive education in the visual arts, preparing them for a wide range of careers and further academic pursuits. This program offers a strong foundation in art history, theory, and practice, emphasizing critical thinking, creativity, and problem-solving skills. Students in the BA program will explore various artistic disciplines, including drawing, painting, sculpture, printmaking, photography, digital art, and graphic design. The curriculum is designed to foster both technical proficiency and conceptual understanding, allowing students to develop a distinctive artistic voice. Upon graduation, students will be equipped with the knowledge and skills necessary to pursue careers in areas such as art education, gallery management, museum studies, graphic design, illustration, web design, and other creative industries. The program also serves as excellent preparation for graduate studies in art and related fields.",
        "program website url": "https://www.una.edu/art/degree/bachelor-of-art.html",
        "Accreditation status": "The Department of Art and Design is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Program name": "Bachelor of Arts in Visual Arts and Design",
        "Program Page url": "https://www.una.edu/art/degree/bachelor-of-art.html"
    },
    {
        "Concentration name": "Art History, Digital Art, Graphic Design, Photography, Painting, Printmaking, and Sculpture",
        "description": "The Department of Art and Design offers two bachelor’s degree programs. The Bachelor of Science (B.S.) in Visual Arts & Design offers concentrations in: Art History, Digital Art, Graphic Design, Photography, Painting, Printmaking, and Sculpture. The Bachelor of Fine Arts (B.F.A.) in Studio Art is a professional degree in art with a focus in painting, printmaking, and sculpture. Both programs prepare students for advanced study in their respective fields or for careers in the visual arts and design.\n\nThe B.S. in Visual Arts & Design is ideal for students who wish to pursue a career in one of the many Visual Arts and Design fields. Through extensive instruction, critiques, and an internship, students develop both practical and conceptual skills. The internship provides the opportunity for students to apply their skills in real-world situations, thus gaining valuable professional experience.\n\nThe B.S. in Visual Arts and Design provides students with a broad and inclusive view of Visual Arts and Design and prepares students to:\n- Demonstrate knowledge of the historical, theoretical, and cultural context of visual arts and design.\n- Demonstrate proficiency in relevant techniques, technologies, and methodologies in their chosen concentration.\n- Critically analyze, interpret, and evaluate visual information.\n- Effectively communicate visual ideas and concepts through a variety of media.\n- Develop a professional portfolio demonstrating a strong understanding of visual arts and design principles and practices.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/art-design/visual-arts-design-bs/",
        "Accreditation status": "The Department of Art and Design is an institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Program name": "Bachelor of Science in Visual Arts and Design",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Secondary Education",
        "description": "This program of study is designed for students who want to become secondary education teachers of Biology in middle and high schools. The program combines coursework in biology, education, and general studies to provide students with a strong foundation in the biological sciences and the pedagogical skills necessary to effectively teach biology to adolescents. Students will learn about various biological topics, including cell biology, genetics, ecology, evolution, and human anatomy and physiology, as well as educational theories and practices, classroom management, and curriculum development. Graduates of this program will be eligible for secondary education teacher certification in Biology in Alabama and other states.",
        "program website url": "https://www.una.edu/biology/degrees/bsed-biology.html",
        "Accreditation status": "Accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Education in Biology (Secondary Education)",
        "Program Page url": "https://www.una.edu/academics/majors-minors.html"
    },
    {
        "Concentration name": null,
        "description": "The Business Marketing (Secondary Education) program at the University of North Alabama prepares students to teach business and marketing subjects in secondary schools (grades 6-12). This program combines coursework in business administration, marketing, and education, ensuring graduates have both strong content knowledge and pedagogical skills. Students will gain expertise in areas such as marketing principles, business law, entrepreneurship, finance, and instructional strategies for diverse learners. The curriculum is designed to meet state licensure requirements for secondary education teachers in Alabama and other states with reciprocal agreements. Graduates are well-prepared for careers as business and marketing educators, as well as roles in business training and development.",
        "program website url": "https://www.una.edu/education/secondary-education/business-marketing-secondary.html",
        "Accreditation status": "Accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Education in Business Marketing (Secondary Education)",
        "Program Page url": "https://www.una.edu/sitemap.xml"
    },
    {
        "Concentration name": "Chemistry (Secondary Education)",
        "description": "The Bachelor of Science in Education (B.S. in Education) program in Secondary Education prepares students to teach in grades 6-12 in various subject areas. Students completing the program are eligible for Alabama Class B Professional Educator Certification in their teaching field. The program requires students to complete general studies coursework, professional studies courses, and specialized courses in their teaching field (concentration). The specific requirements for each teaching field are outlined below.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-departments/education-human-sciences/secondary-education-bs-ed/",
        "Accreditation status": "Accredited by the Council for the Accreditation of Educator Preparation (CAEP) and the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC)",
        "Program name": "Bachelor of Science in Education in Chemistry (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Collaborative Teacher (K-6) program is designed to provide candidates with the knowledge, skills, and dispositions to work with students who have diverse learning needs. Candidates will learn to plan and implement individualized instructional strategies based on student needs, collaborate with general education teachers and other professionals, and use data to make instructional decisions. The program emphasizes inclusive practices and prepares candidates to teach in a variety of settings.",
        "program website url": "https://catalog.troy.edu/preview_program.php?catoid=4&poid=756&returnto=141",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Education in Collaborative Teacher (K-6)",
        "Program Page url": "https://catalog.troy.edu/preview_program.php?catoid=4&poid=756&returnto=141"
    },
    {
        "Concentration name": null,
        "description": "The Early Childhood Education (P-3) program prepares candidates to educate young children in public and private schools and agencies. Teacher candidates seeking the B.S.Ed. in Early Childhood Education (P-3) will complete courses in foundational studies, general studies, teaching fields, and professional studies. The Early Childhood Education (P-3) program prepares students to work with children from birth through third grade, and leads to Alabama Class B professional educator certification.",
        "program website url": "https://catalog.una.edu/undergraduate/education-human-sciences/teaching-learning-leadership/bs-education-early-childhood-education-p3/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Education in Early Childhood Education (P-3)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Education in Elementary Education (K-6) prepares individuals to teach in Alabama elementary schools. Individuals who successfully complete the program requirements, pass all required Praxis examinations, and meet all requirements for teacher certification, including background clearance, will be recommended for Class B certification in Elementary Education (K-6). Candidates for admission to the Elementary Education (K-6) program must meet the general requirements for admission to the UNA Teacher Education Program and must have an overall GPA of 2.75 on all coursework attempted. Specific information about the requirements for admission to the Teacher Education Program is found in the Education section of the catalog. The program is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "program website url": "https://catalog.una.edu/undergraduate/college-education-human-sciences/curriculum-instruction/elementary-education-bsed/",
        "Accreditation status": "Accredited by the Council for the Accreditation of Educator Preparation (CAEP)",
        "Program name": "Bachelor of Science in Education in Elementary Education (K-6)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Education degree in English Language Arts (Secondary Education) is designed to prepare students for teaching English/Language Arts, including literature, composition, and language, in grades six through twelve. Students completing the program will meet all requirements for a Class B Professional Educator Certificate in English Language Arts (6-12) issued by the Alabama State Department of Education.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-departments/education-human-sciences/teacher-education/english-language-arts-secondary-education-bse/",
        "Accreditation status": "The University of North Alabama Professional Educator Preparation Programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP). The programs are also approved by the Alabama State Department of Education (ALSDE).",
        "Program name": "Bachelor of Science in Education in English Language Arts (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Education in Family and Consumer Sciences (Secondary Education) prepares students to teach Family and Consumer Sciences (FCS) in secondary schools (grades 6-12). The program includes professional studies and content courses in family and consumer sciences. FCS content areas include food and nutrition, family relations, human development, housing and interior design, and clothing and textiles. Upon completion of the program, students are eligible for Class B (bachelor's level) teacher certification in Family and Consumer Sciences (secondary education) in Alabama. All students pursuing Class B teacher certification must meet current certification requirements as specified by the Alabama State Board of Education (ALSBE). These requirements include specific passing scores on the appropriate PRAXIS II Subject Assessment(s) and the PRAXIS II Principles of Learning and Teaching (PLT) exam. Students must also meet other certification requirements established by ALSBE.",
        "program website url": "https://catalog.una.edu/undergraduate/education-human-sciences/family-consumer-sciences/bachelor-science-education-family-consumer-sciences-secondary-education/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Education in Family and Consumer Sciences (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "French (Secondary Education)",
        "description": "The Bachelor of Science in Education in French (Secondary Education) prepares candidates to teach French in secondary schools (grades 6-12). It provides a strong foundation in French language, literature, and culture, combined with professional education coursework and field experiences. Graduates are eligible for an Alabama Class B Professional Educator Certificate in French (grades 6-12) upon successful completion of all program requirements, including passing the Alabama Educator Certification Assessment Program (AECAP) subject area assessment and edTPA performance assessment. The program includes general studies, teaching field requirements, and professional studies. Candidates are required to meet admission requirements to the professional teacher education program. For more information, please see the Professional Teacher Education Program Information section of this catalog. Admission to this program is competitive.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/teaching-learning-leadership/bsed-french-secondary-education/",
        "Accreditation status": "The programs in the Department of Teaching, Learning, and Leadership are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Education in French (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/teaching-learning-leadership/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Education degree with a major in General Science prepares students to teach in grades 6-12. The degree program includes course work in the natural sciences, mathematics, and professional studies in education, as well as a clinical internship. Graduates are eligible to pursue initial Alabama Class B Professional Educator Certification.",
        "program website url": "https://catalog.una.edu/undergraduate/college-education-human-sciences/teacher-education/general-science-secondary-education-bsed/",
        "Accreditation status": "Accredited by the Alabama State Department of Education (ALSDE).",
        "Program name": "Bachelor of Science in Education in General Science (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "General Social Science (Secondary Education)",
        "description": null,
        "program website url": "https://catalog.una.edu/undergraduate/education-human-sciences/secondary-education-english-foreign-languages/general-social-science-bs-ed/",
        "Accreditation status": "Approved by the Alabama State Department of Education and accredited by the Council for the Accreditation of Educator Preparation (CAEP) at the initial and advanced levels.",
        "Level": "BS",
        "Program name": "Bachelor of Science in Education in General Social Science (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Education in Geography (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Education degree in German (6-12) prepares students to teach German in secondary schools (grades 6-12). The program combines a strong foundation in German language, literature, and culture with professional education coursework and practical experiences necessary for Alabama teacher certification. Graduates will be equipped to foster linguistic proficiency and cultural understanding in their future students.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/teaching-learning-leadership/bs-professional-education-german-6-12/",
        "Accreditation status": "The UNA Professional Education Programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Education in German (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/teaching-learning-leadership/bs-professional-education-german-6-12/"
    },
    {
        "Concentration name": "Secondary Education",
        "description": "The Bachelor of Science in Education in History (Secondary Education) program prepares students to teach history and social studies to students in grades 6-12. This program develops subject matter competence in history and the related social studies, knowledge of the appropriate teaching methods, and extensive experience in clinical settings prior to the final internship. The program leads to Class B Teacher Certification in History (6-12) in Alabama.",
        "program website url": "https://catalog.una.edu/undergraduate/education-human-sciences/teacher-education/history-secondary-education-bsed/",
        "Accreditation status": "All teacher education programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Education in History (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Mathematics (Secondary Education)",
        "description": "The Secondary Education: Mathematics program is designed for students who desire to teach mathematics in middle schools (grades 4-8) and high schools (grades 9-12). The program leads to a Bachelor of Science in Education (B.S.Ed.) degree and eligibility for teacher certification in Alabama. The curriculum emphasizes a deep understanding of mathematical concepts, pedagogical strategies specific to mathematics education, and practical teaching experience through field placements and student teaching.",
        "program website url": "https://catalog.una.edu/undergraduate/education/secondary-education-mathematics-bsed/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Education in Mathematics (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Choral",
        "description": "The Bachelor of Science in Education (BSE) degree in Music (P-12) (Secondary Education) is offered for those students who desire to teach Music in grades P-12. The BSE in Music (P-12) (Secondary Education) is a curriculum approved by the Alabama State Department of Education and meets the standards of the National Association of Schools of Music. Students must successfully complete a program of study consisting of 120-128 semester hours with a major in Music (P-12) (Secondary Education). For admission to the Teacher Education program, students must meet UNA standards for admission to teacher education programs as defined by the College of Education and Human Sciences. For graduation, students must meet College of Education and Human Sciences, Department of Music, and UNA requirements. The BSE in Music (P-12) (Secondary Education) program offers concentrations in Choral and Instrumental. Students must apply for admission to the Teacher Education Program after earning 48 semester hours with a minimum 2.75 GPA. Students must be fully admitted to Teacher Education prior to enrolling in professional studies courses. Additionally, students must earn a minimum grade of \"C\" or better in all professional studies courses and major field courses. Admission and retention policies for the College of Education and Human Sciences are described in the College of Education and Human Sciences section of the current UNA Undergraduate Catalog.",
        "program website url": "https://catalog.una.edu/undergraduate/collegeofartsandsciences/music/bse-music-p12-secondary-education/",
        "Accreditation status": "Approved by the Alabama State Department of Education and meets the standards of the National Association of Schools of Music.",
        "Program name": "Bachelor of Science in Education in Music-Choral (P-12) (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": "Instrumental (P-12)",
        "description": "The Bachelor of Science in Education (B.S. in Ed.) in Music provides students with an in-depth education in music and prepares them to teach in either choral or instrumental settings in grades P-12. Music majors earning this degree are prepared to pursue careers as music educators or continue their studies in graduate school. Teacher education programs at UNA are approved by the Alabama State Department of Education.",
        "program website url": "https://catalog.una.edu/undergraduate/college-arts-sciences/music-theatre/music-education-bsed/",
        "Accreditation status": "Accredited institutional member of the National Association of Schools of Music (NASM). Teacher education programs at UNA are approved by the Alabama State Department of Education.",
        "Program name": "Bachelor of Science in Education in Music-Instrumental (P-12) (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "A physical education major prepares you for a career that focuses on promoting an active and healthy lifestyle among students in grades P-12. Students will learn the skills and knowledge needed to teach physical education effectively, develop comprehensive curricula, and assess student progress. Our program is designed to meet the growing demand for highly qualified physical education teachers who can inspire and educate the next generation. Our program provides a strong foundation in both theoretical knowledge and practical application. With experienced faculty, state-of-the-art facilities, and diverse field experiences, UNA prepares students to become outstanding educators and leaders in the field of physical education. Graduates are eligible for Alabama Class B Teaching Certification in Physical Education P-12.",
        "program website url": "https://www.una.edu/education/bachelor-degrees/bachelor-of-science-in-education-physical-education-p-12.html",
        "Accreditation status": "The Teacher Education programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Education in Physical Education (P-12) (Secondary Education)",
        "Program Page url": "https://www.una.edu/education/bachelor-degrees/bachelor-of-science-in-education-physical-education-p-12.html"
    },
    {
        "Concentration name": "Physics (Secondary Education)",
        "description": "The Bachelor of Science in Education (B.S.Ed.) degree in Physics (Secondary Education) prepares students for careers as secondary school physics teachers. The program provides a comprehensive understanding of physics principles and pedagogical methods specific to teaching physics at the secondary level. Students will engage in rigorous coursework covering classical mechanics, electromagnetism, thermodynamics, quantum mechanics, and optics, alongside professional studies in education focused on curriculum development, instructional strategies, classroom management, and student assessment relevant to diverse learning environments. Through supervised field experiences and student teaching, candidates will gain practical skills in designing and delivering effective physics instruction, fostering scientific inquiry, and promoting critical thinking among high school students. Graduates will be eligible for secondary professional educator certification in physics in Alabama and are well-prepared to make significant contributions to science education.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-departments/education-human-sciences/bachelor-science-education-bsed/physics-secondary-education-bsed/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Education in Physics (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": "The Bachelor of Science in Education degree with a major in Spanish for Secondary Education prepares students to teach Spanish in secondary schools (grades 6-12). The program provides a comprehensive understanding of the Spanish language, culture, and literature, along with pedagogical skills necessary for effective language instruction. Graduates will be equipped with the knowledge and practical experience to create engaging learning environments and foster students' linguistic and cultural proficiency.",
        "program website url": "https://catalog.una.edu/undergraduate/arts-sciences/foreign-languages/spanish-bsed-secondary/",
        "Accreditation status": "The College of Education and Human Sciences is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Bachelor of Science in Education in Spanish (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/teaching-learning-leadership/bs-professional-education-visual-arts-p-12/",
        "Accreditation status": null,
        "Program name": "Bachelor of Science in Education in Visual Arts (P-12) (Secondary Education)",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/teaching-learning-leadership/bs-professional-education-visual-arts-p-12/"
    }
]