[
    {
        "Concentration name": [
            "Organizational Leadership and Development",
            "Strategic Management and Innovation",
            "Performance and Talent Management"
        ],
        "description": "The Doctor of Business Administration is designed for seasoned business professionals who hold a master’s degree and want to elevate their strategic leadership to the highest level. The program is 54 credits and takes approximately three years to complete. Students will work one-on-one with a faculty advisor to guide them through their research and dissertation from the first day to their last. The program is ideal for leaders, executives, consultants and university-level educators who want to challenge themselves and contribute to the growth and development of their profession. Graduates will be positioned to use their expertise to influence strategic decisions within their organizations by applying research-based solutions to real-world business challenges. The program prepares students to demonstrate mastery in qualitative and quantitative research design and data collection. Additionally, students will develop skills to analyze, synthesize, and evaluate business principles and practices in a global economy.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/doctor-of-business-administration/",
        "Accreditation status": null,
        "Program name": "Doctor of Business Administration",
        "Program Page url": "https://post.edu/blog/post-expands-graduate-programs-with-doctor-of-business-administration-degree/"
    },
    {
        "Concentration name": [
            "Systems Leadership",
            "Professional Leadership"
        ],
        "description": "Post University’s online Doctor of Nursing Practice (DNP) degree is the highest level of clinical nursing education available, designed to prepare you with the skills and knowledge to take on leadership roles, influence health policy, and improve patient outcomes. Our program will equip you to contribute to and apply evidence-based research to improve patient care and guide your practice.",
        "program website url": "https://post.edu/dnp",
        "Accreditation status": "The Doctor of Nursing Practice program at Post University is pursuing initial accreditation by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org). Applying for accreditation does not guarantee that accreditation will be granted.",
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice",
        "Program Page url": "https://post.edu/wp-content/uploads/2023/12/POST_ASC_DNP_Overview_R18-PEM.pdf"
    },
    {
        "Concentration name": [
            "Corporate Innovation",
            "Entrepreneurship",
            "Finance",
            "Healthcare Systems Leadership",
            "Leadership",
            "Marketing",
            "Multidisciplinary",
            "Project Management"
        ],
        "description": "Post University’s online Master of Business Administration (MBA) degree program is designed for aspiring business leaders who want to take their careers to the next level. In our fully online or hybrid MBA programs, you will develop the leadership skills and business acumen to successfully manage a business and its unique challenges. From motivating a team to achieving financial goals, our ACBSP-accredited online MBA curriculum covers the essentials of business that apply to a wide variety of fields and industries. And through a choice of in-demand concentrations, you can tailor your studies to your specific interests and professional goals.",
        "program website url": "https://post.edu/academics/school-of-business/master-of-business-administration/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University has received specialized accreditation for its business programs through the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Masters",
        "Program name": "Master of Business Administration",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Healthcare",
        "description": "Prepare for leadership in today’s complex global business environment with a Master of Business Administration (MBA) from Post University. Our fully online, accredited MBA program is designed for working professionals from all backgrounds. We deliver our curriculum on a flexible, online platform so you can attend class and complete assignments when and where it’s most convenient for you. You can even choose from a number of concentrations to further tailor your education to your career goals. Develop in-demand healthcare leadership skills and knowledge with this concentration. You’ll explore the business side of the healthcare industry, including its structure, operation and financing, along with legal and ethical issues, marketing, and public policy. The curriculum is focused on emerging technologies, continuous quality improvement and other current trends, and it culminates in a capstone project where you will integrate and apply your learning to real-world scenarios.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/master-of-business-administration/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University is nationally accredited by the Accreditation Council for Business Schools and Programs (ACBSP) for our Master of Business Administration degree program.",
        "Level": "Master of Business Administration",
        "Program name": "Master of Business Administration – Healthcare",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": [
            "Instructional Design and Technology",
            "Teaching and Learning",
            "Higher Education Administration",
            "Online Teaching",
            "TESOL (Teaching English to Speakers of Other Languages)"
        ],
        "description": "Post University’s Master of Education (M.Ed.) degree program is designed to provide certified teachers and other educational professionals with the skills and credentials they need to become leaders in the education profession. In our M.Ed. program, you will develop the critical thinking, curriculum development, and instructional technology skills you need to foster greater achievements in your students. Our graduate-level education courses are taught by a faculty of experienced educational professionals who will prepare you for a range of career options inside and outside of the classroom. Upon graduation, you will be prepared for a wide variety of leadership roles, including athletic director, lead teacher, and principal, and in areas such as curriculum development or higher education.",
        "program website url": "https://post.edu/academics/school-of-education/master-of-education/",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Education",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": [
            "Emergency Management and Homeland Security",
            "Public Service Leadership",
            "Non-Profit Management",
            "General"
        ],
        "description": "The Master of Public Administration (MPA) online program at Post University will prepare you to be a confident, effective leader in today’s public sector. Throughout our program, you will gain a strong foundation in the management of government agencies, nonprofit organizations and other institutions that serve the public interest. You will study how policy is made, understand the importance of ethics in leadership, and learn to make sound administrative decisions with public accountability at the forefront. As a graduate, you will be able to pursue a variety of leadership careers in public administration and related fields.",
        "program website url": "https://post.edu/academics/master-of-public-administration/",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Public Administration",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": [
            "Forensic Accounting",
            "Public Accounting"
        ],
        "description": "Post University’s Master of Science in Accounting (MSA) degree program is designed to provide you with the critical-thinking, problem-solving and communication skills you need to become a leader in the accounting profession. Our online and on-campus courses prepare you for the Certified Public Accountant (CPA), Certified Management Accountant (CMA), Certified Internal Auditor (CIA), or Certified Fraud Examiner (CFE) exams. The program is specifically designed to meet the requirements to sit for the CPA exam in most states, including Connecticut and New York. Throughout your studies, you will build a strong accounting foundation in financial reporting, taxation, and auditing, while exploring relevant topics in business law, ethics, and information systems. You can also customize your learning to your career goals by choosing one of two concentrations: Forensic Accounting or Public Accounting.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/master-of-science-in-accounting/",
        "Accreditation status": "Our Master of Science in Accounting degree is offered through The Malcolm Baldrige School of Business, which is accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Accounting",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Big data is a big deal in today’s business world. To put it simply, more data means companies have more opportunities to analyze it for valuable insights that will help them succeed. But this information is only as useful as the person who can understand it. That’s where you come in. As a student in our Master of Science in Business Intelligence and Analytics program, you will gain the knowledge and skills needed to do just that, with a specific focus on the core concepts of business intelligence and analytics. Our career-focused curriculum, which combines rigorous analytics with business fundamentals, will teach you how to analyze and understand big data from a variety of sources to help solve business problems, identify new opportunities, and make better business decisions. You will graduate ready for a career as a database architect, business intelligence analyst, business analyst, and many other data-driven roles.",
        "program website url": "https://post.edu/academics/school-of-business/master-of-science-in-business-intelligence-and-analytics/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University is nationally accredited by the Accreditation Council for Business Schools and Programs (ACBSP) for its Master of Science in Business Intelligence and Analytics program.",
        "Level": "Masters",
        "Program name": "Master of Science in Business Intelligence and Analytics",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Alcohol and Drug Counseling",
        "description": "The Master of Science in Clinical Mental Health Counseling at Post University is dedicated to preparing aspiring counselors to become competent and ethical practitioners. This online program provides a strong foundation in counseling theory, research, and practice, emphasizing the development of essential clinical skills. Students will explore a wide range of topics, including psychopathology, multicultural counseling, group counseling, and crisis intervention, while also engaging in supervised clinical experiences. The program is designed to meet the educational requirements for licensure as a professional counselor in many states. Our faculty are experienced clinicians and scholars who are committed to mentoring students and fostering their professional growth. Graduates of this program will be equipped with the knowledge, skills, and values necessary to provide effective and compassionate mental health services to diverse populations, empowering them to make a meaningful difference in the lives of individuals, families, and communities. Students will graduate from the program with the necessary knowledge and skills to pursue a meaningful and rewarding career in the field of mental health counseling.",
        "program website url": "https://post.edu/academics/the-john-p-burke-school-of-public-service-and-education/master-of-science-in-clinical-mental-health-counseling/",
        "Accreditation status": "The Master of Science in Clinical Mental Health Counseling at Post University is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP), the national accrediting body for counseling programs.",
        "Level": "Master",
        "Program name": "Master of Science in Clinical Mental Health Counseling",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": [
            "Software Engineering",
            "Cybersecurity"
        ],
        "description": "In the Master of Science in Computer Science program at Post University, you will explore advanced topics like cloud computing, machine learning, the Internet of Things (IoT), artificial intelligence, data analytics, blockchain technology, quantum computing, human-computer interaction, and more. Our expert instructors will provide you with a hands-on learning experience that incorporates real-world applications so you can gain the skills needed to design and implement innovative solutions to complex computing problems. Offered 100% online, you can complete your coursework anytime, anywhere, and earn your degree in as little as 12 months. When you graduate, you will be prepared to enter the workforce or continue your education at the doctoral level.",
        "program website url": "https://post.edu/academics/school-of-arts-sciences/master-of-science-in-computer-science/",
        "Accreditation status": null,
        "Program name": "Master of Science in Computer Science",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": [
            "Clinical Mental Health Counseling",
            "Drug and Alcohol Counseling",
            "Non-Profit Management",
            "Higher Education"
        ],
        "description": "Post University’s Master of Science in Counseling and Human Services is designed for professionals who want to help others live more productive and rewarding lives. You’ll learn the history of counseling, explore foundational theories, and gain an understanding of best practices, all while developing the skills to serve diverse populations in a variety of roles and settings. In your courses, you’ll learn a great deal about yourself, too, which can make you a more well-rounded and effective practitioner. Our goal is to prepare you for a lifetime of success in the counseling and human services fields—and you can do it all 100% online.",
        "program website url": "https://post.edu/academics/the-john-p-burke-school-of-public-service-and-education/master-of-science-in-counseling-and-human-services/",
        "Accreditation status": "The Clinical Mental Health Counseling program at Post University is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Counseling and Human Services",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Gaming and Esports Management",
        "description": "As an aspiring leader in the world of sports, you understand it’s not just a game. It’s a business. To succeed in this ever-evolving industry, you need specialized knowledge and skills that will set you apart from the competition. Our Master of Science in Sport Management program is designed to give you that edge. You will learn from industry-experienced faculty in a flexible online format, making it easy to balance your studies with your personal and professional commitments. Our curriculum is tailored to provide you with a deep understanding of the sports industry and the tools you need to build a successful career, whatever your professional goals.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/master-of-science-in-sport-management/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University has received specialized accreditation for its business programs through the Accreditation Council for Business Schools and Programs (ACBSP). The Sport Management degree programs at Post University have received specialized accreditation through the Commission on Sport Management Accreditation (COSMA).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Gaming and Esports Management",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": [
            "Administrative Leadership Concentration",
            "Student Affairs Concentration",
            "Teaching and Learning Concentration"
        ],
        "description": "Higher education is a complex, multi-faceted field. It faces major challenges, such as the changing demographics of students and the rapid growth of distance education. At Post University, our Master of Science in Higher Education Leadership (MSHEL) will prepare you to be a positive force for change in the field. Our program is offered fully online and is intended for individuals who want to advance their careers in higher education and related fields. In our MSHEL degree program, you will learn the fundamentals of leadership, management, and governance in a higher education setting. Our student-focused faculty, who are scholar-practitioners in the field, will share with you their real-world experiences and teach you how to analyze and plan for curriculum and program development, student success, campus operations and more. Throughout your studies, you will be prepared with the necessary knowledge and skills to lead and transform any college or university.",
        "program website url": "https://post.edu/academics/the-john-p-burke-school-of-public-service-and-education/master-of-science-in-higher-education-leadership/",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Higher Education Leadership",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Nursing Education",
        "description": "Demand for highly qualified nurses continues to rise, and with a Master of Science in Nursing (MSN) from Post University, you can take your career to the next level in leadership. The MSN program prepares students for advanced nursing practice in a variety of settings. Whether you are interested in becoming a nurse educator or a nursing informaticist, our areas of emphasis can put you on the path toward an advanced nursing position or doctoral study. Students in our online nursing program examine evidence-based practice models and theories; advanced nursing roles and practice; and legal, ethical and professional issues in healthcare. They explore research designs and methods and identify and evaluate health information systems to prepare to lead and educate other nurses while improving health outcomes. The MSN is ideal for nurses who wish to become nurse educators in either clinical or academic environments or for those who seek to improve care by analyzing, designing, implementing, and evaluating information and communication systems. The program provides a broad foundation that is applicable in all areas of nursing, while also providing you with the chance to become a specialist.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/master-of-science-in-nursing/",
        "Accreditation status": "The master’s degree program in nursing at Post University is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Masters",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing Education",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Nursing Informatics",
        "description": "Are you a registered nurse (RN) with a Bachelor of Science in Nursing (BSN)? Are you ready to advance your career? If you answered yes, then a Master of Science in Nursing (MSN) from Post University is for you. Our program, offered 100% online, is designed to prepare you to assume leadership roles as a nurse educator or in the field of nursing informatics. In your courses, you will learn to apply advanced knowledge and skills to improve nursing outcomes and lead change in a dynamic healthcare environment. You will be taught by our faculty of experienced nursing professionals who are dedicated to your success and will work closely with you in a supportive and collaborative online learning community. In this specialization, you will focus on the secure integration of data, information, and knowledge to support patient care and improve patient outcomes. Coursework will equip you with foundational knowledge in nursing science, computer science, and information science. You will explore best practices and new technologies to effectively communicate data and manage information that influences decision-making from the bedside to the executive suite. As a graduate, you will be prepared to sit for the Informatics Nursing Certification (RN-BC) exam offered by the American Nurses Credentialing Center (ANCC).",
        "program website url": "https://post.edu/academics/school-of-arts-sciences/master-of-science-in-nursing/",
        "Accreditation status": "The baccalaureate degree program in nursing and master’s degree program in nursing at Post University are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Master's",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing Informatics",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Nursing – Case Management",
        "description": "This specialty is designed to give you a strong foundation in theory, research and evidence-based practice of professional case management. It prepares you to take a leadership role in a variety of case management positions where you will work with multiple stakeholders to coordinate the care of individuals or populations to achieve optimal health, wellness, safety and quality outcomes in a cost-effective manner. Upon completion of this program, you will be prepared to take the ANCC Nursing Case Management certification exam.",
        "program website url": "https://post.edu/academics/the-american-sentinel-college-of-nursing-health-sciences/master-of-science-in-nursing/",
        "Accreditation status": "The master’s degree program in nursing at Post University is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Master's",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing – Case Management",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Family Nurse Practitioner",
        "description": "Our online Master of Science in Nursing with a concentration in Family Nurse Practitioner (FNP) is designed for BSN-prepared nurses who want to become advanced practice registered nurses (APRNs). Upon completion of this program, you will be prepared to take the national certification exam, apply for licensure, and begin your career as an FNP. As a student in our program, you will learn to provide holistic and patient-centered primary care to individuals and families of all ages. You will develop the knowledge and skills necessary to improve your patients’ health outcomes. The MSN degree program and the FNP and PMHNP concentrations are clinically focused and prepare students to sit for national board certification in their chosen specialty. You will gain hands-on clinical experience that will prepare you to translate your theoretical knowledge into clinical practice as a family nurse practitioner. And with our supportive faculty and staff by your side, you will feel confident and prepared to take the next step in your career.",
        "program website url": "https://post.edu/academics/school-of-nursing/master-of-science-in-nursing/family-nurse-practitioner/",
        "Accreditation status": "The master’s degree program in nursing and post-graduate APRN certificate program at Post University are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Master's",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing – Family Nurse Practitioner",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Nursing – Infection Prevention and Control",
        "description": "The role of the infection preventionist is growing in importance, especially as we have entered into an era of emerging global infectious diseases. As a student in this concentration, you will examine the spread and control of disease in hospitals and the community. Our courses will prepare you to seek leadership roles as you guide and direct infection prevention and control programs in the healthcare setting, such as collecting, analyzing, and interpreting infection data; evaluating infection control products and procedures; and developing and implementing policies to protect patients and healthcare workers, and to reduce the risk of infection.",
        "program website url": "https://post.edu/academics/school-of-arts-sciences/master-of-science-in-nursing/",
        "Accreditation status": "The Master of Science in Nursing degree program at Post University is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Masters",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing – Infection Prevention and Control",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Nursing – Organizational Leadership",
        "description": "Our Master of Science in Nursing degree program is designed to develop nurse leaders, administrators, and educators within the ever-changing healthcare environment. Our curriculum builds on your previous undergraduate nursing education and clinical experiences and prepares you for advanced practice in a specialized functional role. Upon graduation, you’ll have a solid foundation to pursue further studies at the doctoral level.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/master-of-science-in-nursing/",
        "Accreditation status": "The Master of Science in Nursing program at Post University is accredited by the Commission on Collegiate Nursing Education, 655 K Street NW, Suite 750, Washington, DC 20001, 202-887-6791.",
        "Level": "Masters",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing – Organizational Leadership",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Mental Health Nursing",
        "description": "Our Master of Science in Nursing (MSN) program at American Sentinel College of Nursing and Health Sciences at Post University is designed to equip you with the knowledge and credentials you need to become a leader in the nursing field. Our online MSN courses are practitioner-oriented, teaching you how to apply evidence-based practice to a variety of healthcare settings. This Area of Emphasis focuses on the unique challenges and opportunities in mental health care. You’ll learn how to treat individuals, families, and groups with a range of mental health issues. Graduates of this specialization are eligible for the American Nurses Credentialing Center (ANCC) Mental Health certification examination.",
        "program website url": "https://post.edu/academics/school-of-nursing/msn-degree/",
        "Accreditation status": "The master’s degree program in nursing at American Sentinel College of Nursing & Health Sciences at Post University is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Mental Health Nursing",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Nursing Administration",
        "description": "Develop the skills to lead healthcare teams with an online Master of Science in Nursing with an Area of Emphasis in Nursing Administration from Post University. Our program is designed for working BSN-prepared nurses like you, who are ready for administrative and leadership roles, such as nurse manager, administrator or executive. Through an online, asynchronous format, you can earn your degree on your schedule as you prepare for the next step in your career. The coursework and field experience in our online MSN program meet the educational requirements to sit for the Nurse Executive (NE-BC) and Nurse Executive, Advanced (NEA-BC) certification exams offered through the American Nurses Credentialing Center (ANCC). Our curriculum has been designed with the input of industry-leading professionals, so you can be confident that you’re gaining the skills and knowledge you need to grow as a nurse leader. Post University will equip you with the competencies you’ll need to make a difference and meet the challenges of our complex healthcare system.",
        "program website url": "https://post.edu/academics/school-of-nursing/master-of-science-in-nursing-area-of-emphasis-in-nursing-administration/",
        "Accreditation status": "The Master of Science in Nursing program at Post University is pursuing initial accreditation by the Commission on Collegiate Nursing Education (CCNE). Applying for accreditation does not guarantee that accreditation will be granted. The program has been approved by the State of Connecticut Board of Examiners for Nursing.",
        "Level": "Master",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing Administration",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Master of Science in Nursing, Area of Emphasis: Nursing Science, Education, and Practice",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Pediatric Nursing",
        "description": "The Pediatric Nursing Area of Emphasis at Post University is designed to prepare nurses who possess the advanced assessment, pharmacology, and pathophysiology skills needed to evaluate, manage, and care for infants, children, and adolescents with complex health needs. Students are prepared to provide care across the healthcare continuum, working in hospitals, clinics, and community-based settings. Our program is committed to developing culturally competent practitioners who can advocate for patients and families from all walks of life. The curriculum is delivered completely online, giving you the flexibility you need to succeed. There are 500 clinical hours required to earn the degree.",
        "program website url": "https://post.edu/academics/school-of-nursing/master-of-science-in-nursing/pediatric-nursing/",
        "Accreditation status": "The Master of Science in Nursing program at Post University is pursuing initial accreditation by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org). Applying for accreditation does not guarantee that accreditation will be granted.",
        "Level": "Master",
        "Program name": "Master of Science in Nursing, Area of Emphasis: Pediatric Nursing",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Healthcare",
        "description": "The Master of Science in Nursing (MSN)/Master of Business Administration (MBA) dual degree is a 63-credit hour degree program designed to prepare graduates for advanced practice leadership roles in a variety of complex healthcare settings. The healthcare concentration within the MBA program complements the nursing leadership coursework, providing the student with the business skills to successfully lead healthcare organizations.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/master-of-business-administration/msn-mba-dual-degree/",
        "Accreditation status": "The Master of Business Administration program and its concentrations at Post University’s Malcolm Baldrige School of Business are accredited by the Accreditation Council for Business Schools and Programs (ACBSP).\n\nThe master’s degree program in nursing at Post University is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Masters",
        "Program name": "Master of Science in Nursing / Master of Business Administration – Healthcare (Dual Degree)",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Post University’s online Master of Science in Project Management (MSPM) will prepare you with the qualitative and quantitative skills and knowledge needed to professionally manage both short- and long-term projects from inception to completion. Our project management master’s degree curriculum is aligned to A Guide to the Project Management Body of Knowledge (PMBOK® Guide), the leading professional standard for the project management field. Throughout your studies, you will develop advanced project management competencies and learn how to apply them to ensure project success and achieve organizational goals and objectives. You will also have the option to choose from two different final projects that will allow you to either evaluate an existing project management office (PMO) or create a new PMO that solves a business problem or takes advantage of a business opportunity.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/master-of-science-in-project-management/",
        "Accreditation status": "The Master of Science in Project Management (MSPM) is accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Project Management",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Master's in Parks, Recreation and Leisure Studies",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": "Curriculum and Instruction, Educational Technology, Higher Education Administration, Instructional Design and Technology, Teaching and Learning, TESOL (Teaching English to Speakers of Other Languages)",
        "description": "With our fully online Master of Education degree program, you can build upon your passion for teaching to develop advanced skills in curriculum, instruction and assessment. You’ll be prepared for instructional leadership roles, to improve student learning in diverse classrooms, and to integrate new and emerging technologies into your teaching practice. Post University’s Master of Education programs are nationally accredited through the Accreditation Council for Business Schools and Programs (ACBSP) and are professionally accredited by the Connecticut Office of Higher Education. In our Master of Education program, you’ll learn how to develop curricula and lesson plans for diverse student learners and how to best use technology to create and deliver engaging content. We’ll also help you grow your leadership skills so you can confidently step into more responsibility and leadership roles.",
        "program website url": "https://post.edu/academics/school-of-education/master-of-education/",
        "Accreditation status": "Post University’s Master of Education programs are nationally accredited through the Accreditation Council for Business Schools and Programs (ACBSP) and are professionally accredited by the Connecticut Office of Higher Education.",
        "Program name": "Master's in Teaching",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Accounting (Post-Baccalaureate) at Post University’s Malcolm Baldrige School of Business can put you on the fast track to a career in the high-demand field of accounting. This online certificate program is ideal for those who have already earned a bachelor’s degree in a field other than accounting but are looking to sit for the Certified Public Accountant (CPA) exam, transition to an accounting career, or enhance their current business knowledge. This 30-credit-hour program will allow you to complete the accounting requirements necessary to sit for the CPA exam in Connecticut and most other states. As an added bonus, you can apply all credits earned toward Post University’s Master of Science in Accounting (MSA) degree program.",
        "program website url": "https://post.edu/academics/malcolm-baldrige-school-of-business/graduate-certificate-in-accounting/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University has received specialized accreditation for its business programs through the Accreditation Council for Business Schools and Programs (ACBSP). The Graduate Certificate in Accounting is not ACBSP accredited.",
        "Program name": "Graduate Certificate in Accounting (Post-Baccalaureate)",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "The demand for substance abuse counselors is on the rise. At Post University, our online Graduate Certificate in Alcohol and Drug Counseling can provide you with a foundation in the theories and models of addiction, as well as the treatment methods and skills necessary to prepare for a role in this growing profession. You will explore a variety of evidence-based prevention and treatment models, develop the multicultural competency to respond to clients from diverse backgrounds and understand the legal and ethical guidelines that inform practice. The curriculum for this program covers the educational requirements needed to pursue licensure as an alcohol and drug counselor (LADC) in Connecticut. If you are pursuing licensure in another state, you will need to check the requirements with your state licensing board. Our faculty are dedicated professionals with extensive field experience. They bring their real-world knowledge to the online classroom to help you develop your skills and achieve your professional goals. Upon completion of your program, you will be prepared with the skills you need to help others on their path to recovery.",
        "program website url": "https://post.edu/academics/tauck-college-of-education-and-the-school-of-arts-and-sciences/master-of-science-in-counseling-and-human-services/alcohol-and-drug-counseling-certificate/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Alcohol and Drug Counseling",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Post University’s online Graduate Certificate in Autism Spectrum Disorders (ASD) provides a deeper understanding of the characteristics of ASD and evidence-based interventions to support individuals with ASD in a variety of school, home, and community settings. Our program is designed for teachers, counselors, psychologists, behavior specialists, and other professionals who wish to expand their knowledge in this area. Through our curriculum, you will learn to apply principles of behavior to instruction and management, conduct functional behavior assessments, and design function-based behavior intervention plans. You will also develop the skills to be an effective advocate for individuals with ASD and their families, to help them gain access to needed services and supports.",
        "program website url": "https://post.edu/academics/tachle-school-of-education/graduate-certificate-in-autism-spectrum-disorders/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Autism Spectrum Disorders",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Big data is a big deal in today’s business world—and you could be, too, with an online Graduate Certificate in Business Analytics from Post University’s Malcolm Baldrige School of Business. You will develop the skills to collect, classify, analyze, and interpret information for any organization. In our fully online program, you can learn how to draw insights from data to improve business decision-making and gain a competitive advantage. Earning your certificate is a great way to stay up to date on current and emerging industry trends and can be an ideal first step to pursuing your master’s degree. All credits are transferable to our Master of Science in Business Analytics (MSBA) program, so you can achieve your professional goals.",
        "program website url": "https://post.edu/academics/malcolm-baldrige-school-of-business/graduate-certificate-in-business-analytics/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University has received specialized accreditation for its business programs through the Accreditation Council for Business Schools and Programs (ACBSP)...",
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Business Analytics",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Today’s employers are constantly facing new challenges in the areas of technology, customer behaviors, and globalization. To get ahead—and stay ahead—they need innovative thinkers who can leverage the power of new ideas and creative problem-solving. Post University’s 100% online Graduate Certificate in Corporate Innovation can prepare you to be that person. You’ll develop a deep understanding of corporate strategy, and in just a few months, learn to think like an entrepreneur within a corporate setting. All credits are transferable to our Master of Science in Leadership program.",
        "program website url": "https://post.edu/academics/malcolm-baldrige-school-of-business/graduate-certificate-in-corporate-innovation/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Corporate Innovation",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Demand for information security analysts is expected to grow by 35% between 2021 and 2031, which is much faster than average for other jobs. The need for experts in this field is growing, so getting started today can lead to a long, rewarding career. If you’re a professional who already has a master’s degree, are working in a non-IT field, or want to enhance your current skills for an entry-level position, our Graduate Certificate in Cybersecurity program is right for you.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/graduate-certificate-in-cybersecurity/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Cybersecurity",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "With the rise of information technology, data is everywhere. In nearly every field, there is a need for professionals who can interpret and apply that data to solve problems. Post University’s online Graduate Certificate in Data Analytics can prepare you to do just that. Our program is designed to provide you with a foundation in data analysis with coursework that focuses on statistical methods, management and application. You will learn the entire process of data analytics from posing the right questions to data gathering, wrangling, and cleaning, to data mining and modeling, and, finally, to communication and visualization. In this program, you will: Develop the ability to identify and define business problems and opportunities that can be addressed with data analytics. Develop skills in using statistical programming languages to manage, manipulate, and analyze big data. Practice using data mining, modeling, and machine learning techniques to extract value from data. Develop proficiency in data visualization and reporting techniques to effectively communicate analytic findings to diverse audiences.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/graduate-certificate-data-analytics/",
        "Accreditation status": "Post University is proud to be accredited by the New England Commission of Higher Education (NECHE) and has been continuously accredited since 1972.",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Data Analytics",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Data has become one of the world’s most valuable resources, and data science one of the fastest-growing fields. It is an integral part of nearly every industry, including finance, healthcare, entertainment, and technology. As a student in our online graduate Certificate in Data Science program, you will learn to ask the right questions and discover valuable insights hidden in the data. You will be able to tell meaningful stories that influence business strategy and decision-making. In six courses, you will build a solid foundation in R, Python, SQL, and Tableau, as well as the fundamentals of data science: extracting, cleaning, visualizing, and managing big data; creating models for data analysis; and drawing effective, valid conclusions from your results.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/graduate-certificate-data-science/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Data Science",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Demand for advanced practice nurses is growing, particularly family nurse practitioners (FNPs), who care for the whole person and the entire family. If you already have your master’s degree in nursing, our online Post-Master’s Certificate in Family Nurse Practitioner program can prepare you for this in-demand role. You’ll acquire the skills and hands-on experience needed to improve health outcomes and provide primary care for patients of all ages, from infants to seniors. This certificate program prepares you for the national FNP certification exam so that you can practice as a family nurse practitioner.",
        "program website url": "https://post.edu/academics/the-american-sentinel-college-of-nursing-and-health-sciences/post-masters-certificate-in-family-nurse-practitioner/",
        "Accreditation status": "The post-graduate APRN certificate program at Post University is pursuing initial accreditation by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org). Applying for accreditation does not guarantee that accreditation will be granted.",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Family Nurse Practitioner",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "At the Malcolm Baldrige School of Business, we understand the increasing complexity of the financial industry. That’s why we created our Graduate Certificate in Finance. In this program, you will gain a deeper understanding of finance principles, methods, and practices, while you develop the skills needed for career advancement. Taught by our distinguished faculty, you will examine a variety of topics, including the financial theory of interest, options and futures, corporate finance, and more. This certificate program is an ideal option for individuals with a background in business who are seeking to pursue a specialized area of study without enrolling in a full MBA program.",
        "program website url": "https://post.edu/academics/malcolm-baldrige-school-of-business/graduate-certificate-in-finance/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University is nationally accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Program name": "Graduate Certificate in Finance",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Post University's 100% online Graduate Certificate in Forensic Accounting prepares students for this rapidly growing field. Students in the program develop the skills to investigate financial records for signs of criminal activity, such as fraud or embezzlement. You’ll become equipped with the analytical and investigative techniques to detect, prevent, and prosecute white-collar crime. Our curriculum covers the fundamentals of financial forensics and is regularly updated by industry experts to ensure it’s relevant in today’s business landscape. Throughout your courses, you’ll learn the proper methods to collect and preserve evidence and present your findings effectively in a court of law. Graduates of the program are prepared to sit for the Certified Fraud Examiner (CFE) exam, which can boost earning potential and open up even more career opportunities. Upon completion of this certificate, students can seamlessly transfer all 15 credit hours toward a Master of Science in Accounting (MSA) at Post University.",
        "program website url": "https://post.edu/academics/malcolm-baldrige-school-of-business/graduate-certificate-in-forensic-accounting/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Forensic Accounting",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Geographical Information Systems (GIS) technology is a fast-growing, multi-billion-dollar industry around the world, impacting nearly all commercial, governmental, and non-profit enterprises. Post University’s online Graduate Certificate in GIS prepares you with a mastery of the field’s most in-demand knowledge and skills, including data acquisition, management, analysis and cartographic representation. You will also build your leadership and communication skills, so you can successfully lead GIS projects for your organization. This certificate is ideal for professionals currently working in the field and those looking to enhance their credentials and advance their careers.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/graduate-certificate-in-geographical-information-systems/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Geographical Information Systems",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Post University’s online Graduate Certificate in Gifted Education will prepare you to identify and meet the needs of gifted and talented students in your school. Our gifted education courses cover the history and models of gifted education, as well as the curriculum, instructional strategies, and creativity needed to develop a rich learning environment for these children. As a student in our gifted education program, you will also explore the psychological needs of these unique learners and discover new ways to help them develop their full potential and be successful.",
        "program website url": "https://post.edu/academics/school-of-education/graduate-certificate-in-gifted-education/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Gifted Education",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Are you ready to grow as a leader in higher education? At Post University, we can help. Our 100% online Graduate Certificate in Higher Education Administration program is designed for working professionals like you who are already employed in a college or university setting. You will gain a strong foundation in the concepts, theories, and principles of leading in a higher education environment, preparing you to pursue or advance in your career.",
        "program website url": "https://post.edu/academics/school-of-education/graduate-certificate-higher-education-administration/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Higher Education Administration",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "At Post University, we are committed to providing you with the educational opportunities you need to achieve your professional goals. If you are seeking to advance your human resources career or even transition into the field, our Human Resource Management Graduate Certificate program may be a great option for you. You will develop critical skills in the main functional areas of human resources and can apply credits earned toward a future Master of Science in Human Resource Management.",
        "program website url": "https://post.edu/academics/school-of-business/human-resource-management-graduate-certificate/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University has received specialized accreditation for its business programs through the International Accreditation Council for Business Education (IACBE) located at 11960 Quivira Road in Overland Park, Kansas, USA. For a list of accredited programs please view our IACBE member status page. The Malcolm Baldrige School of Business is also accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Human Resource Management",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Infection prevention and control is one of the fastest-growing fields in healthcare. It provides an opportunity for individuals with varying medical and healthcare backgrounds to join a dynamic specialty of dedicated professionals who work to prevent infections in a variety of settings. At Post University, our online Graduate Certificate in Infection Prevention and Control is a 12-credit-hour program that prepares students to assume roles in various healthcare-related facilities, including hospitals, long-term care, outpatient clinics, and public health. Students will learn how to protect patients, families, and healthcare personnel from healthcare-associated infections (HAIs) through surveillance, data analysis, education, and development of evidence-based policies and procedures. Our curriculum is aligned with the current Association for Professionals in Infection Control and Epidemiology (APIC) competency model. The courses will also prepare you to take the Certification in Infection Prevention and Control (CIC®) exam upon completion of the eligibility requirements.",
        "program website url": "https://post.edu/academics/the-john-p-burke-school-of-public-service-and-education/graduate-certificate-infection-prevention-control/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Infection Prevention and Control",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Lead with confidence. The online Graduate Certificate in Leadership from Post University is designed to prepare you to manage and motivate people and organizations. Whether you want to learn leadership skills to apply in your current role or for career advancement, you will gain a competitive edge in any field by mastering communication, organizational behavior and human resource management principles. In as few as six months, you can earn your certificate and transfer all 18 credits into our Master of Science in Leadership program.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/leadership/graduate-certificate-in-leadership/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University is nationally accredited by the Accreditation Council for Business Schools and Programs (ACBSP) for our associate, bachelor’s and master’s business programs.",
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Leadership",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Learning Design and Technology is an 18-credit hour program designed for individuals in fields like education, healthcare, and corporate training. It equips you with the latest strategies and technologies to create effective, engaging, and innovative learning experiences. You’ll learn how to develop curricula, design instructional materials, and evaluate learning outcomes in any learning environment. Our faculty of industry professionals will work with you one-on-one to ensure you have the support you need to be successful in the classroom and in your career. You’ll also have the opportunity to create an e-portfolio to showcase your skills and knowledge to potential employers.",
        "program website url": "https://post.edu/academics/school-of-education/graduate-certificate-in-learning-design-and-technology/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Learning Design and Technology",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Learn to create and implement effective marketing strategies and manage your brand in today’s evolving global marketplace with a Graduate Certificate in Marketing from Post University. Offered online, our program is designed to provide you with a solid foundation in marketing principles while focusing on current topics, including global marketing, consumer behavior, strategic brand management, and the latest digital marketing and analytic tools. Your courses are taught by practitioner-faculty, who bring real-world experience and a passion for marketing into your virtual classroom. This certificate is also a great way to jump-start your MBA, as the courses are transferable to our Master of Business Administration degree program offered through The Malcolm Baldrige School of Business.",
        "program website url": "https://post.edu/academics/the-malcolm-baldrige-school-of-business/marketing/graduate-certificate-in-marketing/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University has received specialized accreditation for its business programs through the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Marketing",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Post University’s Online Teaching graduate certificate program is designed for current and aspiring K-12 educators and corporate trainers who wish to effectively integrate technology into their practice. In our fully online program, you will develop your technological expertise to meet the diverse needs of your students. You will also learn the tools and skills to design engaging, authentic and effective online instruction. Our expert faculty will teach you best practices in instructional design, online course development and delivery, and student assessment. You will also have the opportunity to participate in a practicum, in which you will apply your skills and knowledge in an actual online learning environment under the mentorship of an experienced online educator.",
        "program website url": "https://post.edu/academics/school-of-education/graduate-certificate-in-online-teaching/",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Online Teaching",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Post University’s online graduate certificate in paralegal studies is designed to give you an overview of the legal system and the role paralegals play in it. Throughout your courses, you will learn the necessary communication, critical thinking, research, and writing skills needed to effectively prepare legal documents, analyze case law, and conduct investigations. The graduate certificate in paralegal studies is a great option for those who are looking to become paralegals but have already earned their bachelor’s degree in a different field. You’ll gain a foundation in the law, discover the ins and outs of the courtroom, and be introduced to new and emerging legal technologies that will prepare you for a successful and long-lasting career as a paralegal. In addition to a broad education in law, you will learn practical skills for different types of law, so you will be well-equipped with the knowledge and skills needed for every case they handle.",
        "program website url": "https://post.edu/academics/the-john-p-burke-school-of-public-service-and-education/graduate-certificate-in-paralegal-studies/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Paralegal Studies",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Post University’s online Graduate Certificate in Professional Counseling is for professionals who already have a master’s degree in counseling or a related field but lack the required coursework to become a licensed professional counselor (LPC). In our program, you will gain the knowledge you need to sit for the LPC exam in your state and become a licensed professional counselor. You will develop critical skills in counseling theories and techniques, career counseling, professional ethics, and multicultural counseling, so you can help a wide range of individuals with their mental health and personal growth.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/graduate-certificate-in-professional-counseling/",
        "Accreditation status": null,
        "Level": "Graduate Certificate",
        "Program name": "Graduate Certificate in Professional Counseling",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "In a competitive business environment, project management expertise is highly sought after by employers in a wide range of industries. Whether you’re an aspiring or experienced project manager looking to gain formal training, Post University’s online Graduate Certificate in Project Management can help you develop the skills you need to achieve your career goals. This program will equip you to make immediate, positive contributions to your current organization and pursue new opportunities with confidence. In our project management certificate program, you will develop leadership and technical skills to manage projects from initiation to completion. You will learn to properly plan, control and manage budgets, schedules, procurement and risk. You will also learn to motivate team members and manage conflict to successfully drive team-oriented projects. Upon completion of the program, you will be prepared for positions in a variety of industries and be able to: Apply tools and techniques to effectively manage complex projects in a variety of business environments. Use appropriate analytical tools and techniques to measure project performance and take corrective action to ensure the successful completion of the project. Align organizational strategy with project selection. Evaluate ethical considerations inherent in project management. Conduct a project closeout to gather lessons learned.",
        "program website url": "https://post.edu/academics/malcolm-baldrige-school-of-business/project-management-graduate-certificate/",
        "Accreditation status": "The Malcolm Baldrige School of Business programs are accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Project Management",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "Social media marketing is one of the fastest-growing marketing specialties. If you are already working in a related field, you can add to your skills and credentials to advance your career. With your certificate from Post University, you will have the specialized knowledge to develop, implement and manage an effective social media strategy for any organization. In our program, you will learn how to: \n* Design a social media campaign from development to launch. \n* Create and maintain an online brand persona. \n* Define target audiences and choose appropriate social media platforms. \n* Monitor and measure the return on investment of social media campaigns.",
        "program website url": "https://post.edu/academics/malcolm-baldrige-school-of-business/graduate-certificate-social-media-marketing/",
        "Accreditation status": "The Malcolm Baldrige School of Business at Post University is nationally accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Program name": "Graduate Certificate in Social Media Marketing",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Special Education at Post University offers an overview of topics in special education from early childhood through post-secondary transition. Our faculty of veteran educators will share their expertise and insights in this fully online, six-course program as they help you discover and create effective instructional strategies. Learn how to identify and assess students with special needs and develop an individualized education program (IEP) based on each student’s unique needs and abilities. Through this coursework, you will prepare for special education teacher certification to teach in any state while gaining a solid foundation for teaching students with disabilities.",
        "program website url": "https://post.edu/academics/school-of-education/graduate-certificate-in-special-education/",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Special Education",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "In today’s fast-paced, digital world, businesses and organizations need professionals who can effectively communicate and engage with key audiences to achieve organizational goals. Post University’s online Graduate Certificate in Strategic Communication will teach you how to analyze communication needs and develop integrated communication strategies to position your organization for success. Through hands-on, project-based learning, you’ll master the latest digital communication tools and techniques in public relations, crisis communication, social media, and more. This certificate program is ideal for individuals looking to gain an essential skill set for career advancement or those who are considering a master’s degree in communication.",
        "program website url": "https://post.edu/academics/school-of-arts-and-sciences/communication-and-media-studies/graduate-certificate-in-strategic-communication/",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Strategic Communication",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    },
    {
        "Concentration name": null,
        "description": "With a growing number of students in the United States who speak English as a second language, there is a greater demand for professionals with the skills to help these students succeed. Post University’s online Graduate Certificate in Teaching English Language Learners (TELL) prepares you with the necessary expertise, practical knowledge, and relevant coursework to do just that. Our TELL graduate certificate coursework, taught by experienced instructors who are experts in the field, is also aligned with the TESOL International Association’s standards for P-12 teacher education programs. If you’re a certified teacher, our program will prepare you to seek an endorsement to teach English learners. The coursework within this graduate certificate can also be stacked into our Master of Education (M.Ed.) degree program, with a concentration in Teaching English to Speakers of Other Languages (TESOL).",
        "program website url": "https://post.edu/academics/school-of-education/graduate-certificate-in-teaching-english-language-learners/",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Teaching English Language Learners (TELL)",
        "Program Page url": "https://post.edu/academics/online-graduate-degrees/"
    }
]