[
    {
        "Concentration name": "Professional Track, Transitional Track",
        "description": "The University of North Alabama’s Master of Accountancy (MAcc) program is a 30-credit hour graduate business program that will prepare students for a career in accounting. Graduates with an MAcc degree possess the technical skills and broad business perspective needed for a successful career. Students who graduate with their MAcc degree from UNA meet the educational requirements to sit for the CPA exam in the state of Alabama. The UNA MAcc program has consistently ranked as one of the top programs by various publications. The accounting program at UNA is known throughout the region for its quality and for the success of its graduates. Our program faculty are highly qualified, with a majority holding a doctorate degree and a CPA certification. They offer a diverse range of expertise and experience and are passionate about students’ professional development.",
        "program website url": "https://www.una.edu/business/departments-majors/accounting-and-business-law/master-of-accountancy.html",
        "Accreditation status": "The Master of Accountancy program has separate accounting accreditation through AACSB International—The Association to Advance Collegiate Schools of Business. UNA is one of only 194 universities in the world to hold this prestigious accreditation. AACSB represents the highest standard of achievement for business schools worldwide.",
        "Program name": "Accountancy MSA",
        "Program Page url": "https://www.youtube.com/watch?v=kzVp8_qAgrg"
    },
    {
        "Concentration name": null,
        "description": "The Anderson College of Nursing and Health Professions offers post-graduate APRN certificate programs for nurses who have an earned Master of Science in Nursing (MSN) or Doctor of Nursing Practice (DNP) degree and wish to obtain an additional specialty certification as a Nurse Practitioner. The certificates are designed to be completed in four to five semesters of part-time study. Post-Graduate APRN Certificate students are accepted for fall and spring admission.",
        "program website url": "https://www.una.edu/nursing/post-graduate-certificates/index.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and post-graduate APRN certificate program at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Adult-Gerontology Acute Care Nurse Practitioner Cert",
        "Program Page url": "https://www.grad.miami.edu/graduate-education/a-z-listing-graduate-programs/index.html"
    },
    {
        "Concentration name": "Adult-Gerontology Acute Care Nurse Practitioner",
        "description": "The Adult-Gerontology Acute Care Nurse Practitioner (AGACNP) track is designed to prepare students for advanced practice nursing with acutely ill adult and gerontology patients. Graduates are educated to provide a spectrum of care from disease prevention to acute and critical care management. The AGACNP is prepared to care for patients in intensive care units, emergency departments, specialty labs (e.g., cardiac catheterization, electrophysiology), specialty clinics (e.g., cardiology, pulmonology) and hospitalist/intensivist services. The AGACNP is a member of the multi-disciplinary healthcare team and practices in collaboration with physicians and other healthcare providers. Graduates are eligible to take the American Nurses Credentialing Center (ANCC) or the American Association of Critical Care Nurses (AACN) Adult-Gerontology Acute Care Nurse Practitioner certification examinations.",
        "program website url": "https://www.una.edu/nursing/graduate-programs/msn-adult-gerontology-acute-care-np.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and post-graduate APRN certificate program at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Masters",
        "Program name": "Adult-Gerontology Acute Care Nurse Practitioner MSN",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The Adult-Gerontology Primary Care Nurse Practitioner Certificate (AGPCNP) track at UNA prepares graduates to provide primary health care for adults across the lifespan from adolescence through senescence. The curriculum emphasizes health promotion and maintenance, and the diagnosis and management of common acute and chronic health problems. Upon completion of the program, graduates will be eligible to seek certification as an Adult-Gerontology Primary Care Nurse Practitioner through the American Nurses Credentialing Center (ANCC) or the American Academy of Nurse Practitioners (AANP).",
        "program website url": "https://www.una.edu/nursing/post-masters-certificates/agpcnp-certificate.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and post-graduate APRN certificate programs at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Adult-Gerontology Primary Care Nurse Practitioner Cert",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Adult-Gerontology Primary Care Nurse Practitioner",
        "description": "The adult-gerontology primary care nurse practitioner track is a hybrid program designed to prepare nurses to provide primary care services to the entire spectrum of adults, including young adults, adults, and older adults. The primary focus of the adult-gerontology primary care nurse practitioner is to provide comprehensive, chronic, and continuous care to patients in a variety of primary care settings. Adult-gerontology primary care nurse practitioners are educated to provide a broad range of primary care services that includes performing health assessments, ordering, performing, and interpreting diagnostic tests, and prescribing medications and other treatments. Upon successful completion of the program of study, graduates will be eligible to take the American Nurses Credentialing Center (ANCC) Adult-Gerontology Primary Care Nurse Practitioner certification examination or the American Academy of Nurse Practitioners (AANP) Adult-Gerontology Primary Care Nurse Practitioner certification examination. Upon successful completion of the certification exam, graduates will be eligible for licensure in their state of residence. Graduates who apply for initial licensure in a compact state, or who change their primary state of residence to a compact state, may be eligible for a multistate license. Additionally, graduates who live in and practice in compact states may be eligible for a multistate license.",
        "program website url": "https://www.una.edu/nursing/graduate/msn.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and post-graduate APRN certificate program at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "level": "MSN",
        "Program name": "Adult-Gerontology Primary Care Nurse Practitioner MSN",
        "Program Page url": "https://www.una.edu/nursing/graduate/msn.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Advertising MA",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Anthropology MA",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Applied Biological Anthropology",
        "description": "The Master of Arts in Anthropology with a concentration in Applied Biological Anthropology at the University of North Alabama (UNA) offers a unique and comprehensive educational experience for students interested in the practical application of biological anthropology. This program is designed to provide students with a strong theoretical foundation in biological anthropology, combined with hands-on training in research methods and techniques that can be applied to real-world problems. The curriculum focuses on areas such as human osteology, forensic anthropology, bioarchaeology, primatology, and human biology, preparing students for careers in academia, government agencies, museums, and the private sector.",
        "program website url": "https://www.una.edu/geography/ma-aba/index.html",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Anthropology MA: Applied Biological Anthropology",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Applied Carbonate Geology focuses on the depositional and diagenetic aspects of carbonate rocks and the unique challenges these present to geologists. The certificate provides students with an understanding of modern carbonate depositional environments, petrographic techniques for carbonate rock characterization and diagenesis, and experience in subsurface geologic methods. Carbonate rocks are important hosts of oil and natural gas, groundwater, and Mississippi-Valley type ore deposits. In addition, the unique properties of carbonate rocks have important implications for CO2 sequestration and other environmental geology applications. This certificate is designed to be completed in one year and requires 12 graduate credit hours.",
        "program website url": "https://www.una.edu/arts-sciences-engineering/certificate-programs.html",
        "Accreditation status": null,
        "Program name": "Applied Carbonate Geology Cert",
        "Program Page url": "https://www.una.edu/arts-sciences-engineering/certificate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The Executive Doctorate of Business Administration (EDBA) at the University of North Alabama is a professional doctoral program for executives and senior managers who want to advance their knowledge, skills, and abilities to the highest level. The EDBA is designed for working professionals who desire to distinguish themselves as thought leaders in their respective fields. The EDBA curriculum is designed to produce scholar-practitioners who can develop and lead evidence-based management and data-driven decision making. EDBA graduates will be equipped to advance their careers to C-suite and other upper-level management positions in both the for-profit and non-profit sectors. In addition, EDBA graduates will be qualified to teach in business programs at most universities.",
        "program website url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html",
        "Accreditation status": "The University of North Alabama Sanders College of Business and Technology is accredited by AACSB International - The Association to Advance Collegiate Schools of Business.",
        "Level": "Doctoral",
        "Program name": "Applied Learning Sciences EdD",
        "Program Page url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html"
    },
    {
        "Concentration name": "Instructional Design and Technology, Literacy, Teacher Leader",
        "description": "The online Doctor of Education in Applied Learning Sciences from the University of North Alabama has been designed for educators and other professionals who want to understand learning and teaching from an evidence-based perspective. This doctoral program is designed to provide you with a broad understanding of learning sciences while developing your expertise through one of our three concentrations. Our Applied Learning Sciences doctoral degree will equip you with a nuanced view of education that includes the historical context for today’s educational landscape, the sociological and cultural factors that affect learning, the psychological perspectives that inform educational research, and the policies that shape educational practices.",
        "program website url": "https://www.una.edu/online/programs/doctoral/applied-learning-sciences-edd.html",
        "Accreditation status": "The University of North Alabama is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award bachelor's, master's, education specialist, and doctoral degrees. The College of Education and Human Sciences is also accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Doctoral",
        "Program name": "Applied Learning Sciences EdD Online",
        "Program Page url": "https://www.una.edu/online/index.html"
    },
    {
        "Concentration name": "Applied Physiology",
        "description": "The Master of Science in Education with a concentration in Applied Physiology is designed for students seeking advanced knowledge and skills in exercise physiology. The curriculum integrates physiological and anatomical principles with the study of human movement. Through coursework, laboratory experiences, and research, students gain a comprehensive understanding of how the body responds and adapts to exercise. This program prepares graduates for careers in clinical settings, corporate wellness, strength and conditioning, research, and for further doctoral studies. Students will have the opportunity to work closely with faculty on research projects and gain hands-on experience in our state-of-the-art laboratories.",
        "program website url": "https://www.una.edu/kinesiology/graduate-programs/applied-physiology/index.html",
        "Accreditation status": null,
        "Level": "MSEd",
        "Program name": "Applied Physiology MSEd",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Applied Geographic Information Systems",
        "description": "The MPS in Applied GIS concentration provides students with a solid foundation in geospatial technologies including Geographic Information Systems (GIS), Remote Sensing, Global Positioning Systems (GPS), and related technologies (e.g., mobile mapping, web-based mapping). The purpose of this concentration is to provide specialized training in geospatial technologies that leads to career advancement for students from a broad range of academic and professional backgrounds. The program curriculum is designed to balance theoretical and applied concepts, with a strong focus on project based learning. Students can expect to learn the functional and analytical aspects of GIS and other geospatial technologies, which include the collection, management, analysis, and dissemination of geospatial information. The curriculum emphasizes the application of geospatial technologies to real-world problems. Students in this concentration are expected to demonstrate knowledge and mastery of geospatial technologies by completing a capstone project that is selected by the student with approval from the Department of Geography Graduate Coordinator. The capstone experience allows students the opportunity to integrate their knowledge by applying geospatial technologies to a variety of applications including, but not limited to, environmental management, urban and regional planning, and economic development. The capstone provides a bridge between graduate study and a professional career, and its completion demonstrates a student’s mastery of geospatial concepts, ability to conduct independent research, and make a significant contribution to the geospatial technology field as a whole.",
        "program website url": "https://catalog.una.edu/graduate/arts-sciences/professional-studies-mission-ma/",
        "Accreditation status": null,
        "Level": "MPS",
        "Program name": "Applied Remote Sensing MPS",
        "Program Page url": "https://catalog.una.edu/graduate/arts-sciences/professional-studies-mission-ma/"
    },
    {
        "Concentration name": "Aquaculture",
        "description": "The Aquaculture concentration of the Master of Professional Studies program is designed to provide graduate training in aquaculture for students whose primary career interests are in the professions of government, business, and industry, as opposed to research and teaching. The curriculum is interdisciplinary, but its foundation rests on the biological sciences of fisheries, aquatic ecology, water quality, nutrition, physiology, and genetics. Applied fields in business are also integral parts of the curriculum, providing students with knowledge and skill in accounting, marketing,management, and economics. Coursework and professional experience are integrated to ensure students receive the practical experience necessary to be successful in the aquaculture industry.",
        "program website url": "https://catalog.una.edu/graduate/arts-sciences/professional-studies-ms/aquaculture-concentration-mps/",
        "Accreditation status": null,
        "Level": "MPS",
        "Program name": "Aquaculture MPS",
        "Program Page url": "https://catalog.una.edu/graduate/arts-sciences/professional-studies-mission-ma/"
    },
    {
        "Concentration name": "Building Structures, Building Mechanical Systems, or Building Enclosure Systems",
        "description": "Architectural Engineering is the application of engineering principles and technology to building design and construction. The purpose of this program is to provide the knowledge and skills necessary to design building systems. Students can specialize in one of three areas: Building Structures, Building Mechanical Systems, or Building Enclosure Systems. Graduates of this program may go on to careers in consulting engineering firms, construction companies, building equipment manufacturers, facility management companies or government agencies.",
        "program website url": "https://www.una.edu/engineering/graduate-programs/architectural-engineering.html",
        "Accreditation status": null,
        "Program name": "Architectural Engineering MSAE",
        "Program Page url": "https://www.una.edu/arts-sciences-engineering/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The University of North Alabama, in partnership with the Institute of Classical Architecture & Art (ICAA), offers a graduate-level Certificate in Classical Architecture. This 15-credit hour certificate program provides students with a working knowledge of classical architectural design. The coursework offers an introduction to the classical orders, the literature of classical architecture, proportion, and the study of precedent, and offers one of two concentrations in either architectural design or architectural history & theory.",
        "program website url": "https://www.una.edu/icaa/certificate/index.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Architecture: Classical Architecture Cert",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The online Certificate in Artist Development is a 12-credit hour undergraduate certificate program for non-degree-seeking students that can be completed in two semesters. It is designed to equip aspiring artists, songwriters, producers, and entrepreneurs with foundational creative and technical skills and essential knowledge for pursuing a career in today’s music business and recording industries.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-arts/vad/",
        "Accreditation status": "All programs in the Department of Visual Arts and Design are accredited by the National Association of Schools of Art and Design (NASAD).",
        "Level": "Certificate",
        "Program name": "Artist Development Cert Online",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/arts-sciences/school-arts/vad/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Arts Leadership Cert Online",
        "Program Page url": "https://www.una.edu/education/program-pages/master-of-arts-in-education-instructional-leadership.html"
    },
    {
        "Concentration name": null,
        "description": "The Arts Management certificate is a 12-hour online program of study which provides graduate-level coursework for individuals seeking employment in the arts management field. The certificate is appropriate for individuals with bachelor's degrees who wish to enhance their professional profile, practicing arts managers who do not have a formal arts management education, and currently-enrolled graduate students who wish to augment their degree. The courses within the Arts Management certificate may be applied to the Master of Arts in Public History degree with a concentration in Public Humanities.",
        "program website url": "https://www.una.edu/art/arts-management-certificate.html",
        "Accreditation status": "The Department of Art is accredited by the National Association of Schools of Art and Design (NASAD).",
        "Level": "Certificate",
        "Program name": "Arts Management Cert Online",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Arts Presenting Fundamentals is an 18-hour program designed to provide students with comprehensive knowledge and skills in the field of arts presenting. This program is offered online and provides students with the flexibility to balance their education with their professional and personal commitments. The program focuses on the fundamentals of arts presenting, including programming, marketing, fundraising, financial management, and audience development. Students will learn how to develop and implement successful arts programming, create effective marketing campaigns, and build strong relationships with donors and patrons. The curriculum is designed to provide students with a solid foundation in the principles and practices of arts presenting and to prepare them for careers in a variety of arts organizations, including theaters, museums, galleries, and performing arts centers. The program is ideal for individuals who are currently working in the arts and want to advance their careers, as well as those who are new to the field and want to gain the skills and knowledge needed to succeed.",
        "program website url": "https://www.una.edu/arts-and-sciences/entertainment-industry/graduate-certificate-in-arts-presenting-fundamentals.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Arts Presenting Fundamentals Cert Online",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Athletic Training (MSAT) at the University of North Alabama is a 5-semester professional graduate program designed to prepare students for a career as an athletic trainer. The MSAT program provides students with the knowledge and skills necessary to become a competent and compassionate healthcare professional. Students will learn how to prevent, diagnose, and treat injuries and illnesses in a variety of settings, including high schools, colleges, professional sports, and clinical settings. Students who successfully complete the MSAT program are eligible to sit for the Board of Certification (BOC) examination.",
        "program website url": "https://www.una.edu/kinesiology/graduate-programs/athletic-training/index.html",
        "Accreditation status": "The Master of Science in Athletic Training program is accredited by the Commission on Accreditation of Athletic Training Education (CAATE), 6850 Austin Center Blvd., Suite 100, Austin, TX 78731-3101. The program has been placed on Probation as of February 19, 2024 by the CAATE.",
        "Level": "Master of Science",
        "Program name": "Athletic Training MSAT",
        "Program Page url": "https://www.ut.edu/graduate-degrees/ms-in-athletic-training"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Atmospheric Sciences MS",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Atmospheric Science",
        "description": "The Master of Professional Studies (MPS) is an online, 30-hour master's degree program for working professionals who wish to further develop their professional skills and knowledge base. This interdisciplinary degree is composed of three parts: a 9-hour professional studies core, a 15-hour primary concentration area, and a 6-hour cognate. The UNA Department of Geography & Environmental Sciences offers the Atmospheric Science concentration for this degree. The program aims to give students a deeper understanding of atmospheric science and its applications to operational meteorology, emergency management, and other environmental-related career fields.",
        "program website url": "https://www.una.edu/geography/atmospheric-science-program.html",
        "Accreditation status": null,
        "Program name": "Atmospheric Sciences MPS",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Atmospheric Sciences PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Biochemistry and Molecular Biology MS",
        "Program Page url": "https://catalog.una.edu/graduate/courses/bi/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Biochemistry and Molecular Biology PhD",
        "Program Page url": "https://quadcitiesdaily.com/una-confirmed-as-doctoral-granting-institution/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Biochemistry and Molecular Biology Executive PhD Online",
        "Program Page url": "https://www.una.edu/biology/biology-programs/cellular--molecular-biology.html"
    },
    {
        "Concentration name": "Thesis Track, Non-Thesis Track, Geospatial Science",
        "description": "The Master of Science (M.S.) degree program in biology will provide graduate students with the opportunity to acquire the knowledge and skills necessary to pursue a career in biology-related fields in government and industry, to teach at the secondary and community college level, or to pursue an advanced degree in a professional or doctoral program. The department is committed to providing graduate students with a hands-on experience in the laboratory and the field through a course of study which integrates teaching and research. The Master of Science in Biology degree program offers two tracks. The thesis track is strongly recommended for students who intend to apply to a doctoral program or seek a research-based job. The non-thesis track is designed for students seeking careers in fields that do not have a significant research emphasis such as secondary school teachers, many government jobs, and some industry jobs. Both thesis and non-thesis students may also complete a concentration in Geospatial Science with an additional 12 credit hours of coursework in that area.",
        "program website url": "https://www.una.edu/biology/ms-in-biology.html",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Biology MS",
        "Program Page url": "https://www.google.com/search?q=time+in+Lauderdale+County,+US"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Biology PhD",
        "Program Page url": "https://www.una.edu/biology/index.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Biomedical Engineering MSBE",
        "Program Page url": "https://www.una.edu/engineering-industrial-professions/academic-programs/bachelor-engineering.html"
    },
    {
        "Concentration name": "Medical Physics",
        "description": "Biomedical Engineering (BME) is a revolutionary and rewarding field. At its core, BME is an interdisciplinary field that applies principles of engineering to the medical field and biological systems. BME professionals are at the forefront of scientific discovery by developing and applying novel technologies to solve complex biological and medical problems that ultimately advance human health and well-being. The Master of Science in Biomedical Engineering (MSBE) program at the University of North Alabama (UNA) prepares students for successful careers in the BME industry, academia, and government, and for advanced-level doctoral studies. MSBE students receive high-quality education and research training from a dedicated faculty in a state-of-the-art research facility in the new UNA STEM building. The MSBE program offers one area of emphasis in medical physics and has a flexible curriculum with thesis and non-thesis options to meet the needs of the students from a variety of backgrounds.",
        "program website url": "https://www.una.edu/anderson/academics/msbe.html",
        "Accreditation status": "The medical physics emphasis area is accredited by the Commission on Accreditation of Medical Physics Education Programs (CAMPEP).",
        "Level": "Masters",
        "Program name": "Biomedical Engineering MSBE with emphasis in Medical Physics",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Biomedical Engineering PhD",
        "Program Page url": "https://www.una.edu/engineering-industrial-professions/index.html"
    },
    {
        "Concentration name": "Medical Physics",
        "description": "This program provides an exciting opportunity for graduate students to pursue doctoral studies in biomedical engineering. The University of Alabama in Huntsville (UAH) and the University of North Alabama (UNA) have joined together to offer a program with an emphasis in medical physics. The UAH Department of Chemical and Materials Engineering and UNA's Department of Physics offer the Joint UAH-UNA Biomedical Engineering PhD with an emphasis in Medical Physics. The program is offered on the UAH campus.",
        "program website url": "https://www.una.edu/arts-sciences-engineering/graduate-programs.html",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "Biomedical Engineering PhD with emphasis in Medical Physics",
        "Program Page url": "https://www.una.edu/arts-sciences-engineering/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": "The UNA Department of Biology is pleased to offer a Master of Science (M.S.) degree program in Biomedical Sciences. This program prepares students to meet the demand for highly-skilled, professional scientists in the rapidly-growing health sciences and biotechnology fields. The curriculum for the M.S. in Biomedical Sciences program will allow students to customize their coursework to meet their specific professional goals, including entrance into competitive professional programs (medical, dental, physician assistant, pharmacy, etc.), or for employment in the biomedical or biotechnology industries. The M.S. in Biomedical Sciences program is a one-year, non-thesis program that requires the completion of 30 credit hours.",
        "program website url": "https://www.una.edu/biology/ms-biomedical-sciences.html",
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Biomedical Sciences MS",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Biomedical Sciences PIBS (umbrella pathway program)",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Biostatistics",
        "description": "The Biostatistics track is designed for students with an interest in applying statistical methods to the biological sciences, including public health, medicine, and genetics. A graduate with this degree will be able to contribute to research in these areas by analyzing and interpreting data. Our students complete coursework in both the mathematics and biology departments. Coursework includes a one-year sequence in both mathematical statistics and applied statistics. In addition, students have opportunities to collaborate with faculty on research projects as a part of their curriculum.",
        "program website url": "https://www.una.edu/math/graduate-programs/ms-in-mathematics-biostatistics-track.html",
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Biostatistics MS",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Biostatistics PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The University of North Alabama's MPS in Broadcast Meteorology degree provides students a path for a career in broadcast meteorology by providing the coursework needed to obtain the National Weather Association's Seal of Approval. The degree can be earned either fully online or through hybrid delivery.",
        "program website url": "https://www.una.edu/interdisciplinary-studies/graduate/index.html",
        "Accreditation status": null,
        "Level": "MPS",
        "Program name": "Broadcast Meteorology MPS",
        "Program Page url": "https://www.una.edu/interdisciplinary-studies/graduate/index.html"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Business is a 12 hour certificate designed for non-business majors. It provides an introductory foundation in the functional areas of business. Non-business majors who complete the certificate will enhance their chosen major with the business acumen that will increase their career success.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/business/business.pdf",
        "Accreditation status": "The UNA College of Business is an accredited member of AACSB International-The Association to Advance Collegiate Schools of Business. The undergraduate and graduate programs are accredited.",
        "Level": "Certificate",
        "Program name": "Business Cert",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/business/business.pdf"
    },
    {
        "Concentration name": [
            "Global Business",
            "Data Analytics",
            "Leadership"
        ],
        "description": "The Executive Doctor of Business Administration (EDBA) program at the University of North Alabama is an applied professional doctoral degree program designed to equip senior business leaders with advanced knowledge and skills in key business functional areas. The program curriculum is designed to be completed in three years in a blended delivery format that is convenient for working professionals with a minimum of five years of progressive managerial or leadership experience. The EDBA curriculum has a strong focus on applied research to solve real-world business problems and is delivered by an outstanding team of experienced faculty.",
        "program website url": "https://www.una.edu/business/departments-and-programs/edba/index.html",
        "Accreditation status": "AACSB-accredited",
        "Program name": "Business Executive DBA",
        "Program Page url": "https://www.dba-compass.com/programs/university-of-north-alabama/executive-doctor-of-business-administration-edba/"
    },
    {
        "Concentration name": "Accounting",
        "description": "The Executive Doctorate of Business Administration (EDBA) at the University of North Alabama is a professional doctoral program for executives and senior managers who want to advance into the highest levels of their organizations. Our program is a unique blend of rigor and relevance, and the hybrid format provides the necessary flexibility for working professionals to balance work, life, and school commitments. This three-year, 60 credit hour cohort model program will provide you with the skills and expertise needed to drive organizational change through evidence-based decision-making. Students can select from various focus areas to develop specialized knowledge and skills.",
        "program website url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html",
        "Accreditation status": "The UNA Sanders College of Business and Technology is accredited by AACSB International—The Association to Advance Collegiate Schools of business.",
        "Level": "Doctoral",
        "Program name": "Business PhD: Accounting",
        "Program Page url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html"
    },
    {
        "Concentration name": null,
        "description": "The Executive Doctor of Business Administration (EDBA) is a professional doctoral program for executives and senior managers who want to address business practice challenges through applied research. The program emphasizes the development of advanced critical thinking and research skills and their application to real-world business problems. The program will offer concentrations in specific areas of business to equip senior managers with the background needed to address complex organizational issues. The program is a hybrid program with students coming to campus three times a semester for a Friday/Saturday residency.",
        "program website url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html",
        "Accreditation status": "The Sanders College of Business and Technology is accredited by AACSB International, which represents the highest standard of achievement for business schools worldwide. Less than 5% of business schools worldwide have earned this prestigious designation.",
        "Level": "Doctoral",
        "Program name": "Business PhD: Finance",
        "Program Page url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html"
    },
    {
        "Concentration name": "Management",
        "description": "The University of North Alabama Executive Doctor of Business Administration (EDBA) is a professional doctoral program designed for working executives and senior managers who desire to become thought-leaders at their organizations. Our blended EDBA program offers executives a doctoral degree that is both rigorous and relevant. The program allows students to learn the essential skills and complex concepts to create a new vision for their organization’s future. The EDBA program provides a flexible path to a doctoral degree without disrupting personal and professional commitments. The program allows students to gain the expertise to make significant contributions to both business practice and theory. The EDBA program is designed to enhance executive capacity for undertaking applied research and to ensure graduates can manage organizations of all kinds in a dynamic, global environment.",
        "program website url": "https://catalog.una.edu/graduate/business/edba/",
        "Accreditation status": "The College of Business and Technology at the University of North Alabama is accredited by AACSB International – The Association to Advance Collegiate Schools of Business.",
        "Level": "Doctoral",
        "Program name": "Business PhD: Management",
        "Program Page url": "https://catalog.una.edu/graduate/business/edba/"
    },
    {
        "Concentration name": null,
        "description": "The Executive Doctor of Business Administration (EDBA) is a professional doctoral program for executives and senior managers who want to solve the complex challenges facing business and society. The program curriculum is not concentration specific, but instead focuses on applied research to solve contemporary business problems within the context of the student’s career and industry. EDBA students gain advanced knowledge in the business disciplines, learn to apply relevant theories and methodologies to real-world business problems, and develop applied research and writing skills. This approach enables graduates to make significant contributions to the advancement of business knowledge and practice.",
        "program website url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html",
        "Accreditation status": "The Sanders College of Business and Technology is accredited by AACSB International, the premier global accrediting body for business schools. AACSB Accreditation is the hallmark of excellence in business education and has been earned by less than five percent of the world's business programs.",
        "Level": "Doctoral",
        "Program name": "Business PhD: Management Science",
        "Program Page url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html"
    },
    {
        "Concentration name": null,
        "description": "The Accelerated Master’s Program (AMP) in Business Administration allows qualified UNA undergraduate students to begin their Master of Business Administration (MBA) graduate course work during their senior year. A student may take up to 9 hours of graduate courses during the senior year which may be applied to one of the ten concentrations offered in the traditional MBA program. By completing up to 9 hours of graduate course work prior to the completion of the baccalaureate degree, a student may earn an MBA degree in approximately 12 months after receiving the baccalaureate degree.",
        "program website url": "https://catalog.una.edu/undergraduate/colleges-programs/business/special-programs-activities/accelerated20masters20program/",
        "Accreditation status": "All undergraduate and graduate programs in the College of Business and Technology are accredited by AACSB International-The Association to Advance Collegiate Schools of Business. The University of North Alabama is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC).",
        "Level": "MBA",
        "Program name": "Business Administration Accelerated MBA",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/business/special-programs-activities/accelerated20masters20program/"
    },
    {
        "Concentration name": "Real Estate",
        "description": "The University of North Alabama Master of Business Administration (MBA) degree is a graduate-level degree with a rich history. We’ve been a top choice for business professionals for more than 40 a years, having launched our program in 1975. Today we continue to grow and welcome students from across the globe. Our students join us on campus, online, or in a hybrid format. Our faculty bring real-world experience to the classroom to give you a competitive edge. Our MBA will teach you how to lead and manage in the global business environment. You can customize your MBA to align with your career goals, and with nine concentrations, you have a variety of choices. From Accounting to Information Systems to Sales, our MBA will help you reach your professional goals.",
        "program website url": "https://www.una.edu/mba/index.html",
        "Accreditation status": "The UNA College of Business and Technology is accredited by AACSB International - The Association to Advance Collegiate Schools of Business. AACSB is the premier agency for bachelor, master, and doctoral degree programs in business administration and accounting. AACSB International accreditation is the hallmark of excellence in management education.",
        "Level": "MBA",
        "Program name": "Business Administration Accelerated MBA in Real Estate",
        "Program Page url": "https://www.una.edu/mba/index.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Business Administration Executive MBA in Health Management and Policy",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The UNA Executive MBA is a cohort-based program designed for experienced professionals seeking to advance their careers by developing their management and leadership skills. This one-year online program can be completed in as little as 12 months with both online and hybrid learning options. The UNA Executive MBA offers a unique international study component that includes 8-10 days of international travel. Students visit a variety of global businesses and company executives while learning about the history, business practices, economics, and culture of a country. The Executive MBA is a part of our AACSB-accredited College of Business and Technology. In 2022, CEO Magazine named the UNA EMBA program as a Tier One program in their Global Executive MBA Rankings. Students in the program progress through the same sequence of courses as their cohort.",
        "program website url": "https://www.una.edu/business/departments-majors/mba-programs/executive-mba.html",
        "Accreditation status": "The Executive MBA is a part of our AACSB-accredited College of Business and Technology.",
        "Level": "MBA",
        "Program name": "Business Administration Global Executive MBA",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Business Analytics",
        "description": "The Business Analytics concentration will give students the skills and knowledge to turn data into actionable insights for better business decision-making. Students will gain experience with descriptive, predictive, and prescriptive analytics using a variety of statistical and analytical tools. Students learn to utilize data visualization, statistical and machine learning modeling, and optimization to address business problems across a wide variety of industries including finance, marketing, healthcare, and manufacturing. UNA’s Business Analytics MBA concentration will help prepare students to take certification exams such as the Certified Analytics Professional (CAP) exam.",
        "program website url": "https://www.una.edu/mba/index.html",
        "Accreditation status": "The Steele-Cobb College of Business and Technology is accredited by AACSB International.",
        "Level": "MBA",
        "Program name": "Business Analytics MSBA",
        "Program Page url": "https://www.una.edu/mba/index.html"
    },
    {
        "Concentration name": "Business Analytics, Information Systems",
        "description": "The Master of Science in Business Technology (MSBT), offered exclusively online, is a 30-hour program designed to prepare students for technical careers in business. In this program, students will learn to apply information technology to solve business problems. The program has been developed by faculty with real-world experience and is designed to provide students with the knowledge, skills, and abilities needed to obtain employment in the information technology field. The MSBT program offers two concentrations: Business Analytics and Information Systems.",
        "program website url": "https://www.una.edu/business/departments-and-programs/computer-science-and-information-systems/graduate-programs.html",
        "Accreditation status": "The College of Business and Technology at the University of North Alabama is accredited by AACSB International.",
        "Level": "MS",
        "Program name": "Business Technology MS Online",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Cancer Biology PhD",
        "Program Page url": "https://catalog.una.edu/graduate/courses/bi/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Cellular Physiology and Molecular Biophysics PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The 60-semester hour Master of Arts degree in Clinical Mental Health Counseling prepares graduates for employment in a variety of public and private human service agencies including mental health centers, hospitals, substance abuse treatment facilities, correctional facilities, family counseling centers, and pastoral counseling settings. Graduates are prepared to apply for licensure as a Licensed Professional Counselor (LPC) in Alabama and other states.",
        "program website url": "https://catalog.una.edu/graduate/colleges-programs/education-human-sciences/counselor-education/clinical-mental-health-counseling-ma/",
        "Accreditation status": "The Clinical Mental Health Counseling program at UNA is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP).",
        "Level": "MA",
        "Program name": "Clinical Mental Health Counseling MA",
        "Program Page url": "https://catalog.una.edu/undergraduate/colleges-programs/education-human-sciences/counselor-education/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Education with a major in Data Analytics and Program Evaluation is designed to prepare educators and other professionals for careers that require expertise in data analysis, assessment, research, and program evaluation. The 30-hour program is designed for students from a variety of professional backgrounds, including but not limited to, P-12 education, higher education, healthcare, social services, military, and business.",
        "program website url": "https://www.una.edu/education/academic-programs/graduate/data-analytics.html",
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Data Analytics and Program Evaluation MS Online",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "UNA's BSN-DNP program prepares nurses for advanced practice and for leadership roles as clinical scholars. The curriculum is delivered in an online format to provide flexibility for working students. On-campus intensives are required each semester to provide opportunities for students to engage with faculty and colleagues and demonstrate specific skills and competencies. Clinical hours are completed in the student's own community. Students are prepared to sit for national certification in their specialty area upon graduation.",
        "program website url": "https://www.una.edu/nursing/graduate-nursing-programs/dnp-bsn.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and Doctor of Nursing Practice program at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Program name": "Doctor of Nursing Practice (DNP): Advanced Practice",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Population Health Leadership",
        "description": "The Doctor of Nursing Practice (DNP) degree is a practice-focused doctorate designed to prepare experts in specialized advanced nursing practice. The DNP curriculum at the University of North Alabama Anderson College of Nursing and Health Professions focuses on providing the skills and knowledge to enable graduates to provide the most advanced level of nursing care for individuals, families, and communities. The DNP program provides a curriculum that is consistent with professional standards and is designed to prepare graduates to:\n\nUtilize advanced levels of clinical judgment, systems thinking, and accountability in designing, delivering, and evaluating evidence-based care to improve patient outcomes.\nCritically appraise and synthesize evidence for the development of practice guidelines and projects.\nAssume complex leadership roles to advance clinical practice and healthcare.\nAdvocate for social justice, equity, and ethical policies in healthcare.\nEmploy information systems and technology in the delivery of healthcare.\nCollaborate with interprofessional teams to analyze and improve health outcomes.\n\nOur Population Health focus prepares our graduates for leadership roles in a variety of settings. Students learn how to analyze data and evidence to improve patient outcomes and to design, implement, and evaluate new models of care delivery.",
        "program website url": "https://www.una.edu/nursing/graduate/doctor-nursing-practice.html",
        "Accreditation status": "The Doctor of Nursing Practice program at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Doctoral",
        "Program name": "Doctor of Nursing Practice (DNP): Population Health",
        "Program Page url": "https://www.una.edu/nursing/graduate/doctor-nursing-practice.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Doctor of Nursing Practice (DNP): Educational Leadership",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Economics PhD",
        "Program Page url": "https://www.una.edu/business/graduate/executive-doctorate-business-administration/index.html"
    },
    {
        "Concentration name": "Elementary Education",
        "description": "The Education Specialist (Ed.S.) degree is an advanced program designed for teachers, teacher leaders, and administrators who hold a master’s degree. The Ed.S. degree is offered with Class AA professional educator certification in the following teaching fields: Elementary Education; Instructional Leadership; and Secondary Education with concentrations in English for Speakers of Other Languages, English Language Arts, General Science, History, and Mathematics. An Ed.S. degree is also offered in School Counseling. Students should consult with a faculty advisor in the appropriate department before enrolling in any courses.",
        "program website url": "https://catalog.una.edu/graduate/colleges-departments/education-human-sciences/teaching-learning-leadership/education-specialist/",
        "Accreditation status": "Council for the Accreditation of Educator Preparation (CAEP)",
        "Level": "Education Specialist",
        "Program name": "Education Specialist: Elementary Education",
        "Program Page url": "https://catalog.una.edu/graduate/courses/eds/"
    },
    {
        "Concentration name": null,
        "description": "The Education Specialist (Ed.S.) degree program in Instructional Leadership is a 30-hour, post master’s program that provides the opportunity for educators to develop as instructional leaders who can serve in a variety of school settings. The program is designed to develop educators who are prepared to be highly effective school principals, assistant principals, or other administrators at the elementary, middle, and high school levels. The program leads to Alabama Class AA certification in Instructional Leadership for those who are eligible.",
        "program website url": "https://www.una.edu/education/academic-programs/graduate.html",
        "Accreditation status": "The programs in the College of Education and Human Sciences are accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) and the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Education Specialist: Instructional Leadership",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The Education Specialist (Ed.S.) degree program with a major in Teacher Leader is designed to prepare educators to serve as teacher leaders in P-12 schools. The program supports the development of expertise in the areas of curriculum, instruction, assessment, and mentoring/coaching. This program is a 30-33 credit hour program that leads to Class AA certification.",
        "program website url": "https://www.una.edu/education/academic-programs/teacher-leader-eds.html",
        "Accreditation status": "All educator preparation programs at the University of North Alabama are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Education Specialist",
        "Program name": "Education Specialist: Teacher Leader",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Electrical and Computer Engineering MSECE",
        "Program Page url": "https://engineering.purdue.edu/ECE/Academics/Graduates/MASTERS"
    },
    {
        "Concentration name": "Artificial Intelligence",
        "description": "This master’s program offers students the opportunity to learn modern Electrical and Computer Engineering (ECE) topics with a focus in Artificial Intelligence (AI). Students learn through both foundational courses and cutting-edge electives. The curriculum provides a strong background to ECE and prepares students to become experts in the rapidly expanding field of AI, machine learning, and deep learning. The program also provides multiple opportunities for both independent and collaborative research to build a strong profile for either a career in industry or for advanced studies in a Ph.D. program.",
        "program website url": "https://www.una.edu/cse/graduate/msece-ai.html",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Electrical and Computer Engineering MSECE with emphasis in Artificial Intelligence",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Electrical and Computer Engineering MSECE with emphasis in Cybersecurity",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Electrical and Computer Engineering PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": [
            "Writing Track",
            "Literature Track"
        ],
        "description": "The Master of Arts in English at the University of North Alabama offers advanced study of literature and writing in an intellectually stimulating and creative environment. The program is flexible enough to meet the varied goals of a wide range of students and is structured to provide an intensive, comprehensive foundation in English studies. Students in the MA in English program receive considerable individual attention from a highly-qualified and dedicated faculty and enjoy opportunities to work as graduate assistants, to present their work at conferences, to publish their creative writing in a nationally distributed literary journal, to gain valuable editorial experience, and to participate in a variety of other activities. The program is designed to be completed in two years, though some students, particularly those who work full time, may take longer.",
        "program website url": "https://www.una.edu/english/master-of-arts-in-english.html",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "English MA",
        "Program Page url": "https://www.una.edu/english/master-of-arts-in-english.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "English PhD",
        "Program Page url": "https://www.una.edu/english/index.html"
    },
    {
        "Concentration name": "Professional Track, Research Track",
        "description": "The Master of Science in Environmental Health and Safety degree at the University of North Alabama offers two track options: one for working professionals and one for students interested in research. The professional track prepares you for immediate entry into the workforce in the business, industry, and government sectors. The research track prepares students for doctoral work and a career in research and academia. The degree can be completed in person or 100% online.",
        "program website url": "https://www.una.edu/health-professions/academic-programs/ms-ehs.html",
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Environmental Health and Safety MS",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The PhD in Environmental Science and Policy at the University of North Alabama offers students the opportunity to conduct intensive research and scholarship in an interdisciplinary environment that will prepare them to be leaders in industry, government, and the non-profit sector. Students in the program will become experts in a particular area of environmental science, understand how to interpret and disseminate the results of their scholarship, and have the ability to formulate policy based on a firm scientific foundation. Faculty and students in the PhD in Environmental Science and Policy work to solve complex environmental problems at the local, regional, and global scales. The program has particular strengths in aquatic science, conservation biology, environmental health, geospatial science, and climate science.",
        "program website url": "https://www.una.edu/artsci/departments-majors/earth-and-environmental-sciences/phd-environmental-science-and-policy.html",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "Environmental Science and Policy PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Epidemiology PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Exercise Physiology",
        "description": "The PhD in Exercise Science and Health Promotion with a concentration in Exercise Physiology is a terminal degree that builds on the skills and competencies of the master's degree to prepare graduates for a wide variety of careers in academia, research, and clinical settings. The doctoral degree requires a minimum of 61 hours beyond the master's degree and culminates in the completion of a dissertation project. The core curriculum consists of 24 hours of coursework including advanced exercise physiology, research design, and statistics. The concentration consists of 12 hours of specialized exercise physiology-related coursework. The remaining coursework consists of 25 hours of dissertation research. Students in this program will work side-by-side with our well-accomplished faculty to develop a comprehensive research skill set. The program is designed to be completed in three to four years, though the student has up to six years to complete the degree requirements. The degree is offered as a residential program and requires a full-time commitment.",
        "program website url": "https://www.una.edu/kinesiology/graduateprograms/doctor-of-philosophy-in-exercise-science-and-health-promotion.html",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "Exercise Physiology PhD",
        "Program Page url": "https://www.una.edu/kinesiology/graduateprograms/doctor-of-philosophy-in-exercise-science-and-health-promotion.html"
    },
    {
        "Concentration name": "Exploration Science",
        "description": "The exploration science concentration is an interdisciplinary program designed to prepare students for careers in the growing field of exploration. Students will develop skills in the scientific, technical, and business aspects of exploration as well as its social, legal, ethical, and historical dimensions. Students will use the newest technologies to design and implement exploration projects from start to finish, culminating in professional science communication. This unique program will bring in experts from a number of different exploration-related fields to guide students from their first class to their final project. The exploration science concentration offers a variety of courses and electives to suit student interests and needs, with opportunities for field experiences with real-world partners. Graduates of this program will be equipped for a broad spectrum of career paths, including but not limited to, private sector exploration (space, ocean, and terrestrial), national and international exploration agencies (such as NASA and NOAA), non-profit and educational exploration organizations, and government and military applications.",
        "program website url": "https://www.una.edu/interdisciplinary-studies/graduate/index.html",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Exploration Science MPS",
        "Program Page url": "https://www.una.edu/interdisciplinary-studies/graduate/index.html"
    },
    {
        "Concentration name": "Non-Certification",
        "description": "The master’s degree in health and human performance provides an opportunity for advanced study for students with a variety of academic and professional backgrounds. Students will develop an in-depth understanding of the physiological, biomechanical, psychological, and sociological factors related to health and human performance. A minimum of 30 semester hours of coursework are required.",
        "program website url": "https://catalog.una.edu/graduate/education-human-sciences/education-human-sciences.pdf",
        "Accreditation status": "The Anderson College of Nursing and Health Professions, and the College of Education and Human Sciences at the University of North Alabama are accredited by the National Council for Accreditation of Teacher Education (NCATE), 2010 Massachusetts Ave., NW, Suite 500, Washington, DC 20036; telephone (202) 466-7496.",
        "Level": "Master's",
        "Program name": "Health and Human Performance (Master's level, non-certification)",
        "Program Page url": "https://catalog.una.edu/graduate/education-human-sciences/education-human-sciences.pdf"
    },
    {
        "Concentration name": [
            "General History",
            "Public History"
        ],
        "description": "The master of arts degree in history is offered with a concentration in either general history or public history. The general history concentration is designed for students seeking careers in teaching at the secondary or community college level or for those who wish to pursue further graduate study. The public history concentration is designed for students who are interested in careers in public history, including historic preservation, museum studies, and archival administration. In both concentrations, students are trained in historical methodology and historiography and take a broad range of courses, according to their interests, in both U.S. and non-U.S. history.",
        "program website url": "https://catalog.una.edu/graduate/arts-sciences/history-ma/",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "History MA",
        "Program Page url": "https://catalog.una.edu/graduate/arts-sciences/history-ma/"
    },
    {
        "Concentration name": "Teaching, Learning, and Leading",
        "description": "The MS in Instructional Design and Technology (IDT) is an online 30-hour degree program with a focus on Teaching, Learning, and Leading. The program prepares educators, trainers, and other professionals for a variety of roles related to the design, development, implementation, evaluation, and management of instructional technology processes and resources. The program leads to Class A certification for Instructional Technology Specialist. A variety of elective options are available. The IDT program can be completed in as little as three semesters.",
        "program website url": "https://www.una.edu/education/academic-programs/graduate/instructional-design-and-technology.html",
        "Accreditation status": "All teacher education and educator preparation programs offered by the College of Education and Human Sciences at the University of North Alabama are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "MS",
        "Program name": "Instructional Design and Technology MS Online: Teaching, Learning, and Leading",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Learning and Development",
        "description": "The Master of Science in Instructional Design and Technology program focuses on the skills and knowledge needed to facilitate learning and improve performance in a variety of settings. The program is offered entirely online and does not require a teaching certificate for admission. All courses are seven weeks in length, and students can choose to start in the Fall, Spring, or Summer semesters. Students complete 30 hours of graduate coursework, including 18 hours of core courses and 12 hours in one of two concentrations. The Learning and Development concentration focuses on instructional design and training in settings such as business, industry, government, military, non-profit, and healthcare. Graduates often work as instructional designers, corporate trainers, and performance improvement consultants.",
        "program website url": "https://www.una.edu/education/instructional-design-technology/",
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Instructional Design and Technology MS Online: Learning and Development",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Accountancy (M.Acc.) degree at UNA is a 30-hour program designed to prepare students for successful careers in professional accounting. The program is specifically designed to enable candidates to sit for the Certified Public Accountant (CPA) Examination in Alabama and most other states, and can also provide a solid foundation for those students interested in the Certified Management Accountant (CMA), Certified Internal Auditor (CIA), and Certified Fraud Examiner (CFE) examinations. The objective of the Master of Accountancy program is to provide advanced, specialized training in accounting and business to prepare students for professional careers in public accounting, industry, and government.",
        "program website url": "https://www.una.edu/business/graduate-programs/master-of-accountancy.html",
        "Accreditation status": "The Sanders College of Business and Technology is accredited by AACSB-International. The accounting program is separately accredited by AACSB-International.",
        "Program name": "Master of Accountancy (MAcc) Degree",
        "Program Page url": "https://www.youtube.com/watch?v=kzVp8_qAgrg"
    },
    {
        "Concentration name": "School Counseling, P-12",
        "description": "The School Counseling, P-12 program is designed to prepare master’s level school counselors to be leaders, advocates, and consultants in diverse P-12 school settings. The program is committed to a student-centered approach to learning which emphasizes developmental, preventative, and proactive services that are consistent with the American School Counselor Association (ASCA) National Model. Students develop a strong professional identity and foundational knowledge in eight core areas to deliver a comprehensive school counseling program focused on the academic, career, and social/emotional development of all students.\n\nThe program of study is consistent with the standards of the Council for Accreditation of Counseling and Related Educational Programs (CACREP) and the Alabama State Department of Education (ALSDE).\n\nThe program is CACREP accredited, and upon completion of the master's degree program, students are eligible to apply for P-12 certification in school counseling in Alabama and to sit for the National Counselor Examination (NCE) to become a National Certified Counselor (NCC).",
        "program website url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-secondary-education-instructional-school-counseling-p-12/ma-education-secondary-education-instructional-school-counseling-p-12.pdf",
        "Accreditation status": "The program is accredited by the Council for Accreditation of Counseling and Related Educational Programs (CACREP). The program of study is also consistent with the standards of the Alabama State Department of Education (ALSDE).",
        "Program name": "Master of Arts in Education (MAEd): School Counseling",
        "Program Page url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-secondary-education-instructional-school-counseling-p-12/ma-education-secondary-education-instructional-school-counseling-p-12.pdf"
    },
    {
        "Concentration name": "Elementary Education K-6",
        "description": "The Master of Arts in Education degree program in Elementary Education K-6 is designed to prepare highly qualified candidates to become exemplary elementary educators. The professional coursework is carefully designed to provide teacher candidates with knowledge of current research and effective instructional strategies. The curriculum and related field-based learning experiences provide candidates opportunities to develop the knowledge, skills, and dispositions necessary to teach children in diverse P-6 settings and to meet the challenges of contemporary elementary classrooms. Teacher candidates who successfully complete this program will be eligible to apply for the Alabama Class A Professional Educator Certificate in Elementary Education. The program is offered completely online.",
        "program website url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-elementary-education-k-6/",
        "Accreditation status": "All teacher certification programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP) and approved by the Alabama State Department of Education (ALSDE).",
        "Level": "Master of Arts in Education (MAEd)",
        "Program name": "Master of Arts in Education (MAEd): Elementary Education K-6",
        "Program Page url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-elementary-education-k-6/"
    },
    {
        "Concentration name": "Secondary Education",
        "description": "The M.A.Ed. in Secondary Education is designed for individuals who hold Class B certification and wish to obtain Class A certification in one of the following areas: Biology (6-12), Business Marketing Education (6-12), Chemistry (6-12), English Language Arts (6-12), General Science (6-12), History (6-12), Mathematics (6-12), Physics (6-12), or Social Science (6-12). Candidates may also add certification in English for Speakers of Other Languages (P-12).",
        "program website url": "https://catalog.una.edu/preview_program.php?catoid=38&poid=5582",
        "Accreditation status": "The Teacher Education programs at the University of North Alabama are accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Level": "Master's",
        "Program name": "Master of Arts in Education (MAEd): Secondary Education",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "P-12 Education (selected teaching fields)",
        "description": "The Master of Arts in Education (MAEd) program provides advanced study for individuals who hold, or are eligible to hold, a Class B professional educator certificate in a teaching field and wish to pursue a master’s degree in that field, leading to a Class A professional educator certificate. The program is designed to extend the candidate’s knowledge of subject matter, to improve teaching skills and professional competency, and to provide opportunity to analyze and evaluate concepts and practices related to the chosen teaching field. The College of Education and Human Sciences is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "program website url": "https://catalog.una.edu/graduate/programs-study/education-human-sciences/elementary-middle-high-school-education/master-arts-education-maed-p-12-education-selected-teaching-fields/",
        "Accreditation status": "The College of Education and Human Sciences is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Master of Arts in Education (MAEd): P-12 Education (selected teaching fields)",
        "Program Page url": "https://academiccatalog.umd.edu/graduate/"
    },
    {
        "Concentration name": "Instructional Leadership",
        "description": "The Master of Arts in Education: Instructional Leadership is designed to prepare experienced educators for P-12 school leadership positions. School leaders are vital to creating schools in which all students are able to learn, and they are responsible for setting the vision of a school; cultivating a positive, safe, and instructionally powerful learning environment; and developing the professional capacity of teachers and staff. The program is designed for teachers who are ready for new opportunities and to take on leadership roles as a principal, assistant principal, or other school or school system leader. Upon completion of this program, students are eligible for a Class A Professional Educator Certificate in Instructional Leadership.",
        "program website url": "https://www.una.edu/education/academic-programs/maed-instructional-leadership.html",
        "Accreditation status": null,
        "Level": "Master of Arts in Education (MAEd)",
        "Program name": "Master of Arts in Education (MAEd): Instructional Leadership",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Special Education: Collaborative Teacher K-6 and/or 6-12",
        "description": "The special education program provides the student who already holds teacher certification in another area with the opportunity to become certified in special education. The program leads to a Master of Arts in Education degree and Class A certification in collaborative special education teacher (K-6 and/or 6-12). Candidates choose a concentration in grades K-6, grades 6-12, or both.",
        "program website url": "https://www.una.edu/education/academic-programs/special-education-k-6-6-12.html",
        "Accreditation status": "The College of Education and Human Sciences is accredited by the Council for the Accreditation of Educator Preparation (CAEP).",
        "Program name": "Master of Arts in Education (MAEd): Special Education: Collaborative Teacher K-6 and/or 6-12",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "English/Language Arts",
        "description": "The Master of Arts in Education (MAEd) in Secondary Education is designed for candidates who hold a bachelor’s level professional educator certificate in a secondary teaching field and wish to complete a master’s degree and an advanced level professional educator certificate in that same teaching field. Teaching fields are available in biology, business-marketing education, chemistry, English/language arts, general science, geography, history, mathematics, and social science. The program is offered completely online.",
        "program website url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-secondary-education-english-language-arts/",
        "Accreditation status": null,
        "Level": "Master of Arts in Education (MAEd)",
        "Program name": "Master of Arts in Education (MAEd) in Secondary Education-English/Language Arts",
        "Program Page url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-secondary-education-english-language-arts/"
    },
    {
        "Concentration name": "English/Language Arts",
        "description": "The Master of Arts in Education degree program with a major in secondary education is a non-traditional program that is designed to provide qualified individuals who hold a bachelor’s degree in a specific teaching field with the knowledge, skills, and dispositions to become certified teachers in the State of Alabama in a specific 6-12 teaching field. The program in Secondary Education is offered with an emphasis in English/language arts, general science, history, or mathematics. Students successfully completing the program will meet all requirements for a Master’s level teacher certification.",
        "program website url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-secondary-education-english-language-arts/",
        "Accreditation status": "The teacher education programs are accredited by the Council for the Accreditation of Educator Preparation (CAEP) and the Alabama State Department of Education (ALSDE).",
        "Program name": "Master of Arts in Education (MAEd) in Secondary Education – English/Language Arts – Alternative Plan",
        "Program Page url": "https://catalog.una.edu/graduate/education-human-sciences/ma-education-secondary-education-english-language-arts/"
    },
    {
        "Concentration name": "Exercise Science",
        "description": "The Master of Science in Exercise Science and Health Promotion (ESHP) prepares students to be leaders and practitioners with an advanced body of knowledge in exercise science and health promotion. Students can choose to pursue a concentration in either Exercise Science or Health Promotion. The concentration in Exercise Science is intended for those individuals with an undergraduate degree in Exercise Science, Kinesiology, Human Performance, or a related field. It requires 30 credit hours and is delivered online. This concentration is designed for those students who want to enhance their education in preparation for a doctoral program or to become a practitioner who designs and implements exercise programs for a variety of populations.",
        "program website url": "https://www.una.edu/health-professions/kinesiology/graduate/ms-ex-sci-health-promo-exercise-science.html",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Exercise Science and Health Promotion: Exercise Science",
        "Program Page url": "https://www.una.edu/sitemap.xml"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Master of Science in Exercise Science and Health Promotion: Kinesiology",
        "Program Page url": "https://research.com/rankings/exercise-science/best-online-exercise-science-al"
    },
    {
        "Concentration name": "Wellness and Health Promotion",
        "description": "The Master of Science degree in Exercise Science and Health Promotion is designed to train students for careers in fields of corporate and community wellness and health promotion, university health and wellness, cardiac rehabilitation, clinical exercise physiology, strength and conditioning, sports performance and human performance. The degree provides the coursework and many practical experiences for students to be successful in these fields. The mission of the Master of Science degree in Exercise Science and Health Promotion program is to prepare qualified professionals who demonstrate discipline specific knowledge, possess the necessary skills to be competent, and exhibit professional disposition in a variety of settings. The program will enable students to think critically and analytically about the role of physical activity, exercise, and lifestyle behaviors on human performance and health.",
        "program website url": "https://www.una.edu/hpes/academic-programs/ms-eshp/index.html",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Exercise Science and Health Promotion: Wellness and Health Promotion",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Data Science",
        "description": "The Master of Science in Mathematics at the University of North Alabama is a 30-credit-hour, fully-online program. Students may earn their degree in as little as one year (three semesters), or may opt for a slower-paced plan of study. The curriculum provides students with a strong background in mathematics in a variety of different areas. Additionally, students can pursue an optional concentration in Data Science by choosing four courses from a list of approved courses. The M.S. in Mathematics is a flexible degree. Students may choose the thesis option or the non-thesis option. Those who wish to continue their education with a Ph.D. in Mathematics at another institution are advised to choose the thesis option. Those who wish to teach at the community college level, at the high school level (including dual-enrollment classes), or work in business, industry, or government may choose either option, but may prefer the non-thesis option.",
        "program website url": "https://www.una.edu/math/graduate-program.html",
        "Accreditation status": null,
        "Program name": "Master of Science in Mathematics (MS) Degree",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Nursing in Teaching-Learning Environments",
        "description": "The Anderson College of Nursing and Health Professions offers a Master of Science in Nursing degree with two track options: Nursing in Teaching-Learning Environments and Nursing Leadership in Organizational Environments. Both tracks are offered totally online. The program is designed for completion in two years (five semesters), but may be taken part-time over a longer period. The MSN Program is designed for nurses holding a bachelor's degree in nursing who desire an advanced degree. This option prepares graduates to apply principles of teaching-learning in a variety of settings including academic and staff development. Students participate in a variety of supervised teaching experiences at the undergraduate level in the classroom and clinical settings. Graduates of the teaching track will meet the educational requirements for the National League for Nursing's Certified Nurse Educator (CNE) examination.",
        "program website url": "https://www.una.edu/nursing/academic-programs/msn.html",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and post-graduate APRN certificate program at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Master of Science in Nursing (MSN)",
        "Program name": "Master of Science in Nursing (MSN): Nursing in Teaching-Learning Environment",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Nursing Leadership in Organizational Environments",
        "description": "The Anderson College of Nursing and Health Professions offers the following options for graduate study in nursing: a Master of Science in Nursing (MSN) for the registered nurse who has completed a Bachelor of Science in Nursing (BSN); a Master of Science in Nursing (MSN) for the registered nurse who has completed an Associate of Science in Nursing (ASN); an RN to BSN/MSN program for the registered nurse who has completed an Associate of Science in Nursing (ASN); and three post-graduate certificate programs in nursing.\n\nThe MSN curriculum is designed to prepare professional nurses for advanced nursing roles in a variety of settings. The curriculum is based on the Essentials of Master’s Education in Nursing (2011) and the specific professional standards of practice for each specialty. Graduates from the Master of Science in Nursing program are prepared for leadership roles in nursing education, leadership in organizational environments, and family nurse practitioner.",
        "program website url": "https://catalog.una.edu/graduate/nursing/msn-leadership-organizational-environments/",
        "Accreditation status": "The master’s degree program in nursing at the University of North Alabama is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Masters",
        "Program name": "Master of Science in Nursing (MSN): Nursing Leadership in Organizational Environments",
        "Program Page url": "https://catalog.una.edu/graduate/nursing/msn-leadership-organizational-environments/"
    },
    {
        "Concentration name": "Family Nurse Practitioner",
        "description": "The Family Nurse Practitioner concentration prepares the graduate to provide primary care for persons of all ages in a variety of settings. The program builds on the baccalaureate nursing foundation and develops the assessment, diagnosis and management skills needed to provide quality primary health care for individuals and families. The graduate will be eligible to sit for national certification examinations as a family nurse practitioner. The program is offered in an on-line format with required clinical hours.",
        "program website url": "https://catalog.una.edu/graduate/nursing/msn-family-nurse-practitioner/",
        "Accreditation status": "The master's degree program in nursing at the University of North Alabama is accredited by the Commission on Collegiate Nursing Education (http://www.ccneaccreditation.org).",
        "Level": "Masters",
        "Program name": "Master of Science in Nursing (MSN): Family Nurse Practitioner",
        "Program Page url": "https://catalog.una.edu/graduate/nursing/msn-family-nurse-practitioner/"
    },
    {
        "Concentration name": "Sport Management",
        "description": "The master of science degree in Sport and Recreation Management is a 30-36 hour graduate program designed to prepare students for leadership positions in the dynamic sport and recreation industry. Students select one of two concentrations: Sport Management or Recreation Management. This graduate program is offered entirely online and does not require a thesis. Students may enroll on a full-time or part-time basis. Students may select from a non-thesis or a thesis option for this program.",
        "program website url": "https://www.una.edu/hpes/academic-programs/sport-and-recreation-management-graduate.html",
        "Accreditation status": null,
        "Program name": "Master of Science (MS) Degree in Sport and Recreation Management: Sport Management",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Recreation Management",
        "description": "The Sport and Recreation Management graduate program is a 30-hour program with a concentration in either Sport Management or Recreation Management. This program is designed to provide students with the training and education for a career in the sport industry or recreation field. Students will take core classes that develop a foundation in research, law and ethics, technology, programming, administration, and finance. The program is offered completely online.",
        "program website url": "https://www.una.edu/kinesiology/graduate-programs/sport-and-recreation-management-ms.html",
        "Accreditation status": "The Sport and Recreation Management programs are accredited by the Council on Accreditation of Parks, Recreation, Tourism, and Related Professions (COAPRT). COAPRT accredits baccalaureate programs in recreation, park resources, and leisure services. The UNA Sport and Recreation Management program is one of two programs in the state of Alabama to hold COAPRT accreditation.",
        "Level": "Master of Science (MS)",
        "Program name": "Master of Science (MS) Degree in Sport and Recreation Management: Recreation Management",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Philosophy MA",
        "Program Page url": "https://www.una.edu/pjlp/index.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": "https://www.una.edu/philosophy/index.html",
        "Accreditation status": null,
        "Program name": "Philosophy PhD",
        "Program Page url": "https://www.una.edu/philosophy/index.html"
    },
    {
        "Concentration name": null,
        "description": "The mission of the University of North Alabama Doctor of Physical Therapy Program is to educate and prepare compassionate and ethical entry-level physical therapists who are dedicated to life-long learning and evidence-based practice. Graduates will be prepared to provide patient-centered care to a diverse population to optimize function and improve the quality of life of individuals and society. The Doctor of Physical Therapy program is a full-time, three-year program consisting of nine consecutive semesters of coursework including 32 weeks of full-time clinical education experiences.",
        "program website url": "https://www.una.edu/physical-therapy/",
        "Accreditation status": "The Doctor of Physical Therapy Program at the University of North Alabama is accredited by the Commission on Accreditation in Physical Therapy Education (CAPTE), 3030 Potomac Ave., Suite 100, Alexandria, Virginia 22305-3085; telephone: 703-706-3245; email: accreditation@apta.org; website: http://www.capteonline.org. If needing to contact the program/institution directly, please call 256-765-5120 or email physicaltherapy@una.edu.",
        "Level": "Doctoral",
        "Program name": "Physical Therapy DPT",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": [
            "Exercise Science Concentration",
            "Health Promotion Concentration"
        ],
        "description": "The Ph.D. in Exercise Science and Health Promotion is an interdisciplinary degree that will provide students an opportunity for advanced study in the theoretical and applied aspects of the fields of exercise science and health promotion. The program is designed to develop in students the knowledge and skills to conduct high-quality, evidence-based research; to create innovative, effective health and wellness programming; to successfully compete for external funding; and to teach and mentor the next generation of professionals. Students in the program will study with and conduct research under the mentorship of our nationally and internationally recognized graduate faculty in exercise science and health promotion who also serve as leaders in state and national professional organizations. The program consists of two concentrations from which students will select. Each concentration contains research methods, statistics, core, and elective courses. In addition, students will select a 12-hour cognate in an area of their interest from outside the Department of Kinesiology. The program culminates with students conducting an original dissertation study that expands the body of knowledge in their selected field of study.",
        "program website url": "https://www.una.edu/kinesiology/graduateprograms/doctor-of-philosophy-in-exercise-science-and-health-promotion.html",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "Physical Therapy PhD",
        "Program Page url": "https://www.una.edu/kinesiology/graduateprograms/doctor-of-philosophy-in-exercise-science-and-health-promotion.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Physics MS",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Physics PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Popular Music Pedagogy MA Online",
        "Program Page url": "https://uonline.miami.edu/programs/master-popular-music-pedagogy/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Prevention Science and Community Health at UNA is a unique and innovative program focused on the training of prevention specialists who will have the education and skills to address health and social problems in communities. Our focus is on the training of professional, ethical, and culturally competent prevention specialists who are ready to serve and lead in the growing field of Prevention Science. Prevention Science is a multidisciplinary field that focuses on the development, evaluation, and dissemination of evidence-based strategies aimed at preventing social, physical, and mental health problems and promoting the well-being of individuals, families, and communities. Prevention science seeks to understand the factors that increase the risk for problems as well as the factors that enhance the likelihood of positive outcomes. Prevention specialists may develop and implement programs, write grants, evaluate programs, provide consulting services, and advocate for public policy.",
        "program website url": "https://www.una.edu/psychology-sociology/ms-prevention-science/index.html",
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Prevention Science and Community Health MS",
        "Program Page url": "https://www.una.edu/arts-sciences-engineering/graduate-programs.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Prevention Science and Community Health PhD",
        "Program Page url": "https://publichealth.lsuhsc.edu/education/academic-programs/chsp/phd.aspx"
    },
    {
        "Concentration name": "Cosmetics and Consumer Goods",
        "description": "The University of North Alabama's Product Design: Cosmetics and Consumer Goods concentration is a graduate degree program that prepares students for careers in the cosmetic and consumer goods industry. Students in this program will learn the fundamentals of product design, from concept development to manufacturing and marketing. They will also gain experience working with a variety of materials and technologies, and they will have the opportunity to develop their own product ideas. The program culminates in a final project, in which students will create a new product from start to finish. Graduates of this program will be well-prepared for careers as product designers, product managers, and marketing specialists in the cosmetic and consumer goods industry.",
        "program website url": "https://www.una.edu/art/graduate-programs/ms-product-design-cosmetics-consumer-goods/index.html",
        "Accreditation status": "The University of North Alabama Department of Visual Arts and Design is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Level": "MS",
        "Program name": "Product Design MS: Cosmetics and Consumer Goods",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Pharmaceutical and Biopharmaceutical",
        "description": "The Pharmaceutical and Biopharmaceutical concentration will provide students with the foundational knowledge of scientific, regulatory, and business requirements of the global pharmaceutical and biopharmaceutical industries for product development from drug discovery through commercialization. The program is composed of five courses: Product Development for the Pharmaceutical and Biopharmaceutical Industries; Pharmaceutical and Biopharmaceutical Business Models; Pre-Clinical Development, IND, and Clinical Trials; Validation and Quality Control; Post-Approval Activities, Marketing, and Drug Safety. The program will not only educate professionals for the expanding pharmaceutical and biopharmaceutical industries but also provide the foundation to pursue post-graduate degrees.",
        "program website url": "https://www.una.edu/productdesign/",
        "Accreditation status": null,
        "Level": "MS",
        "Program name": "Product Design MS: Pharmaceutical and Biopharmaceutical",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Product Design MS: Nanotechnology",
        "Program Page url": "https://e-catalogue.jhu.edu/engineering/full-time-residential-programs/degree-programs/chemical-biomolecular-engineering/chemical-biomolecular-engineering-master-science-engineering/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Program Evaluation consists of 12 semester hours of required coursework designed to prepare individuals for careers in education, public health, social work, community development, and other non-profit or for-profit organizations that seek skilled professionals to design and conduct program evaluations. This program is offered fully online.",
        "program website url": "https://www.una.edu/education/academic-programs/program-evaluation-cert.html",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Program Evaluation Cert Online",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Psychiatric Mental Health Nurse Practitioner",
        "description": "The post-graduate APRN certificate curriculum is designed to provide the master’s or doctoral prepared nurse who is nationally certified and licensed as an advanced practice registered nurse (APRN), with the opportunity to expand their scope of practice into a new specialty area of advanced practice nursing. The curriculum provides a structured program of study in one of five concentrations. A certificate is awarded upon completion of the program. Certificate-prepared graduates are eligible to take the national certification examination in the area of their concentration.",
        "program website url": "https://catalog.una.edu/preview_program.php?catoid=31&poid=4919",
        "Accreditation status": "The post-graduate APRN certificate program at the University of North Alabama are accredited by the Commission on Collegiate Nursing Education, 655 K Street, NW, Suite 750, Washington, DC 20001, 202-887-6791.",
        "Program name": "Psychiatric Mental Health Nurse Practitioner Cert",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "Applied Behavior Analysis (ABA) is a science that focuses on improving significant behaviors (e.g., social skills, communication, daily living skills, etc.) and decreasing challenging behaviors (e.g., aggression, self-injury, etc.) through the use of evidence-based procedures. Applied Behavior Analysis is the leading, most effective, evidence-based treatment for individuals with Autism Spectrum Disorder (ASD). The principles of ABA are often used to build skills and treat challenging behavior in other populations as well, including those with developmental and intellectual disabilities, attention deficit hyperactivity disorder, and conduct disorder. The Minor in Applied Behavior Analysis is designed to provide students with a fundamental understanding of the principles of behavior and how to apply them to improve the lives of others. The Association for Behavior Analysis International has verified the following courses toward the coursework requirements for eligibility to take the Board Certified Assistant Behavior Analyst® examination. Applicants will need to meet additional requirements before they can be deemed eligible to take the examination.",
        "program website url": "https://www.una.edu/psychology-and-sociology/minors/applied-behavior-analysis.html",
        "Accreditation status": null,
        "Level": "Minor",
        "Program name": "Psychology: Applied Behaviour Analysis MS",
        "Program Page url": "https://www.una.edu/psychology-and-sociology/minors/applied-behavior-analysis.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Psychology PhD",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Public Administration Cert",
        "Program Page url": "https://www.liberty.edu/online/government/masters/certificate/public-administration/"
    },
    {
        "Concentration name": [
            "Generalist",
            "Public Human Resource Management",
            "Criminal Justice Administration"
        ],
        "description": "The Master of Public Administration (MPA) degree is the recognized professional degree for individuals who are seeking a career in public service. The MPA program at UNA is a generalist program designed for individuals employed or seeking employment in public or non-profit sector. The mission of the Master of Public Administration (MPA) program at the University of North Alabama is to provide a quality and accessible graduate education for current and future leaders of public and nonprofit organizations, domestically and abroad. We promote public service values that include accountability, transparency, social equity, and diversity. This is achieved through an innovative and engaging curriculum, along with a faculty committed to teaching, research and service. Students can participate in our student led Public Administration Club as well as join the Pi Alpha Alpha National Honors Society for Public Affairs and Administration. The MPA Program has three tracks: Generalist, Public Human Resource Management, and Criminal Justice Administration. The 36-hour program includes 24 hours of core courses and 12 hours of electives from one of the three tracks.",
        "program website url": "https://www.una.edu/political-science/mpa-program.html",
        "Accreditation status": "The UNA Master of Public Administration (MPA) program is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA) – The Global Standard in Public Service Education.",
        "Level": "Masters",
        "Program name": "Public Administration MPA",
        "Program Page url": "https://www.una.edu/political-science/index.html"
    },
    {
        "Concentration name": "Criminal Justice Administration, Public Human Resources Management, Public Policy",
        "description": "The Master of Public Administration (MPA) degree at the University of North Alabama is an interdisciplinary graduate degree designed to prepare students for leadership and management careers in the public and non-profit sectors. The MPA degree combines the theory and practice of public administration, enabling students to develop the skills necessary for a career in government, nonprofit management, or a related field. The UNA MPA program has a diverse student population and is delivered entirely online, providing the flexibility students need to succeed. Our mission is to produce highly competent, ethical leaders committed to public service and the betterment of their communities. The MPA program serves a diverse student population, preparing them for leadership roles in a variety of public and non-profit organizations. Through innovative online coursework and engaged, applied learning, we empower students with the knowledge, skills, and values required to address complex societal challenges and promote the public good. We value professionalism, ethics, equity, diversity, and collaboration in all that we do.",
        "program website url": "https://www.una.edu/political-science-public-administration/graduate-programs/master-of-public-administration.html",
        "Accreditation status": "The Master of Public Administration (MPA) program at the University of North Alabama is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA) Commission on Peer Review and Accreditation and is listed on the Annual Roster of Accredited Programs in conformity with NASPAA standards.",
        "Program name": "Public Administration MPA Online",
        "Program Page url": "https://www.collegefactual.com/graduate-schools/university-of-north-alabama/masters-degrees/social-services-public-administration/"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Public Health is a 15-credit hour program designed for current graduate students or post-baccalaureate students who desire foundational knowledge in public health. This certificate is open to students from all academic disciplines who desire to enhance their knowledge and skills in public health. The coursework can be completed in two semesters, and all courses are taught online. Students completing the certificate program can apply these credits toward completion of the Master of Science in Health and Human Performance, Public Health concentration.",
        "program website url": "https://catalog.una.edu/preview_program.php?catoid=49&poid=7504",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Public Health Cert",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Public Health MPH",
        "Program Page url": "https://graduatestudies.publichealth.med.miami.edu/academic-programs/masters-degrees/mph-program-plan/index.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Public Health MPH Online",
        "Program Page url": "https://online.ua.edu/degrees/master-of-public-health/"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Public Health Accelerated MPH",
        "Program Page url": "https://www.una.edu/business/graduate/mha.html"
    },
    {
        "Concentration name": null,
        "description": "The Anderson College of Nursing and Health Professions, School of Nursing offers a Master of Science in Public Health degree program. The program is designed for students seeking a graduate degree for professional advancement in the public health workforce. The program will equip students for public health careers in a wide range of settings, including community organizations, government agencies, health care, and academics. Students will gain knowledge and skills in the five core public health discipline areas: biostatistics, epidemiology, health policy and management, social and behavioral sciences, and environmental health sciences. The program consists of 42 credit hours. It is offered entirely online, allowing flexibility for students. The program includes an Applied Practice Experience and an Integrative Learning Experience that allow students to apply their knowledge and skills in real-world settings.",
        "program website url": "https://www.una.edu/nursing/degrees-and-programs/public-health.html",
        "Accreditation status": "The Master of Science in Public Health at the University of North Alabama is an applicant for accreditation by the Council on Education for Public Health (CEPH). The accreditation review will address the Master of Science in Public Health. Other degrees and areas of study offered by this institution will not be included in the unit of accreditation review.",
        "Program name": "Public Health MSPH",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": "The University of North Alabama’s Accelerated Master of Science in Public Health (AMSPH) is a 42-credit hour, fully online program that will prepare students to address the most pressing public health issues regionally, nationally, and globally. Our program builds on public health’s core functions: assessment, policy development, and assurance, while integrating the social determinants of health. Students will learn how to identify community assets and needs, plan and implement evidence-based programs, evaluate program and policy effectiveness, and advocate for health equity.",
        "program website url": "https://www.una.edu/public-health/msph/",
        "Accreditation status": "The UNA Public Health Program is a new and developing program. The program is an applicant for accreditation by the Council on Education for Public Health (CEPH). The program is not accredited by CEPH at this time.",
        "Level": "Masters",
        "Program name": "Public Health Accelerated MSPH",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": "Public Management, Community Development",
        "description": "The Master of Public Policy (M.P.P.) is the professional public service degree that prepares students for careers as analysts, managers, and leaders in the public, non-profit, and private sectors. The curriculum is designed to teach students to be creative problem-solvers, providing them with the tools and skills necessary to address a wide range of societal problems. With a focus on applied learning, the M.P.P. emphasizes hands-on experience and real-world problem-solving. This includes opportunities for research, community-engaged learning projects, and internships. The M.P.P. is a 36-hour program that students can complete online, in person, or a combination of both. It can be completed in as little as 12 months for full-time students. The program is flexible to accommodate the schedules of working professionals.",
        "program website url": "https://www.una.edu/political-science-public-administration/graduate-programs/mpp/index.html",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Public Policy MPP",
        "Program Page url": "https://www.una.edu/education/academic-programs/graduate.html"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Public Relations MA",
        "Program Page url": "https://www.uh.edu/class/communication/graduate/index.php"
    },
    {
        "Concentration name": "Composition/Rhetoric, Creative Writing",
        "description": "The Master of Arts in Writing at the University of North Alabama offers students the opportunity for advanced study in the fields of creative and professional writing. The program helps prepare students for careers in writing and for further graduate study. Students can specialize in creative writing, which offers a variety of workshops and literature courses, or composition/rhetoric, which offers courses in rhetorical theory, composition pedagogy, and the history of rhetoric. Both tracks require 36 hours of coursework, which can be completed in two years. With a graduate degree in writing from UNA, students may enter writing and editing professions in business and industry, teach in high schools or two-year colleges, or pursue doctoral degrees in English, Composition/Rhetoric, or Creative Writing.",
        "program website url": "https://catalog.una.edu/graduate/arts-sciences/writing-ma/",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Writing MA",
        "Program Page url": "https://catalog.una.edu/graduate/arts-sciences/writing-ma/"
    }
]