[
    {
        "Concentration name": null,
        "description": "The Master of Arts in Applied Nutrition and Dietetics is a 30-unit program designed for students who want to develop specialized knowledge and skills in nutrition and dietetics beyond the baccalaureate level. The M.A. degree provides advanced study in medical nutrition therapy, food science, and nutritional status assessment, along with research and other contemporary topics in dietetics. The M.A. program will enhance the skills of individuals seeking to work in positions in dietetics, nutrition, public health, or related fields. The program is designed to meet the advanced education requirements set by the Commission on Dietetic Registration (CDR) that will be required to be eligible for the registration examination for dietitians beginning January 1, 2024. The program does not provide the required coursework or supervised practice to be eligible to sit for the registration examination for dietitians. Students who want to become a registered dietitian should complete a Didactic Program in Dietetics and a Dietetic Internship. For information on these programs, please contact the FCS department.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate-degree-program/nutrition-and-dietetics-applied-ma",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Applied Nutrition and Dietetics",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Athletic Training (MSAT) program is a 60-unit, two-year, full-time, cohort-style program, that starts each year in the fall semester. The program provides students with a strong foundation in evidence-based practice and is designed to develop professional skills in the following domains: risk management and injury prevention, pathology of injury and illness, orthopedic clinical examination and diagnosis, medical conditions and disabilities, acute care of injury and illness, therapeutic interventions, psychosocial strategies and referral, health care administration, and professional development and responsibilities. Students complete a variety of clinical education experiences under the direct supervision of a preceptor and the program’s clinical education coordinator. Clinical experiences are offered in a variety of settings which may include university athletics, community college athletics, high school athletics, clinics, and industrial settings.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/kinesiology/athletic-training-master-of-science",
        "Accreditation status": "The Master of Science in Athletic Training program is accredited by the Commission on Accreditation of Athletic Training Education (CAATE).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Athletic Training",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science degree in Criminology and Criminal Justice is a 36-unit program consisting of core courses in criminological theory, research methods, and statistics, as well as a variety of electives that address both traditional and contemporary topics in the study of crime and the criminal justice system. The M.S. program is designed to provide students with the critical thinking, analytical, and research skills to pursue professional careers in criminal justice or to continue their education at the doctoral level. Students will learn about the complex causes and correlates of crime, the challenges of achieving a fair and effective criminal justice system, and the policies and practices that reduce crime and promote community safety.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/school-of-criminology-criminal-justice-and-emergency-management/master-science-criminology-and-criminal-justice",
        "Accreditation status": null,
        "Program name": "Master of Science in Criminology and Criminal Justice",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Community Health",
        "description": "The Master of Public Health (MPH) degree in Community Health at California State University, Long Beach (CSULB) is a professional degree that provides students with the knowledge and skills necessary to improve the health and well-being of individuals, families, and communities. The program is designed to prepare students for careers in a variety of settings, including public health departments, non-profit organizations, hospitals, and worksite wellness programs. The curriculum is based on the core competencies of public health and includes coursework in epidemiology, biostatistics, health policy and management, social and behavioral sciences, and environmental health. In addition, students complete a professional paper or thesis and a field experience in a public health setting. The MPH program at CSULB is accredited by the Council on Education for Public Health (CEPH).",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/department-of-health-science/master-of-public-health-mph",
        "Accreditation status": "accredited by the Council on Education for Public Health (CEPH)",
        "Level": "Master",
        "Program name": "Master of Public Health (Community Health)",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts Degree in Kinesiology option in Curriculum and Instruction in Physical Education is designed to provide advanced study for students interested in teaching physical education in a variety of settings (e.g., public/private schools, community colleges, university). This option requires students to develop, implement and assess a curriculum project designed to improve physical education instruction. The Curriculum and Instruction option is offered in a cohort model with a new cohort of students starting every Fall semester. The cohort is designed to be completed in two years (including summers). Course work is offered in the evening (i.e., after 4:00 pm) and online.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/kinesiology/curriculum-and-instruction-in-physical-education-ma",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Curriculum and Instruction in Physical Education",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Emergency Services Administration (EMER) is a 33-unit, graduate-level program that prepares students for leadership roles in the fields of emergency management and homeland security. A cohort of 25-30 students begins the two-year program each fall semester. Classes are delivered via a hybrid model that blends once-a-month, face-to-face class sessions with online instruction. The EMER Program has earned the distinction of being ranked among the Best Online Master’s in Emergency Management Programs in the nation by U.S. News & World Report.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/emergency-services-administration",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Emergency Services Administration",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Health Care Administration (MSHCA) program is designed to meet the needs of those who wish to pursue leadership roles in health care organizations. The curriculum is designed to help students develop the values, knowledge, and skills needed to become effective health care administrators. Courses are taught by full-time faculty and health care professionals with extensive experience in the field. The program is offered in two formats: a traditional, on-campus program and an accelerated program. The accelerated MSHCA is offered through the College of Professional and Continuing Education (CPaCE). Both formats offer a comprehensive curriculum and provide flexibility for students at different points in their career. The Health Care Administration department is a full graduate member of the Association of University Programs in Health Administration (AUPHA).",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/health-care-management/master-of-science-health-care",
        "Accreditation status": "The MSHCA program is proud to be accredited by the Commission on Accreditation of Healthcare Management Education (CAHME).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Health Care Administration",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/health-care-management/master-of-science-health-care"
    },
    {
        "Concentration name": "Coaching and Student-Athlete Development",
        "description": "The Coaching and Student-Athlete Development (CSAD) option prepares students for a career in coaching and leadership within intercollegiate athletics. This program aims to equip coaches with evidence-based knowledge and practical skills that will enhance their professional coaching practice and help them guide student-athletes toward holistic development and success in sport and life. The CSAD option culminates in either a comprehensive exam or a capstone project.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate-degree-program/kinesiology-ma",
        "Accreditation status": null,
        "Level": "M.A.",
        "Program name": "Master of Arts in Kinesiology with option in Coaching and Student Athlete Development",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Individualized Studies",
        "description": "The Individualized Studies option is a research-based program of study designed for students who have a focused interest that cannot be accommodated by one of the existing options. The student and faculty advisor will collaboratively design a program of study that includes Kinesiology courses as well as courses from other departments on campus. The student will gain knowledge in research design and statistics and complete a thesis. Graduates of this option will be well-prepared to enter doctoral programs in their area of specialization. This program is offered on-campus.",
        "program website url": "https://www.csulb.edu/department-of-kinesiology/master-of-arts-in-kinesiology-option-in-individualized-studies",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Kinesiology with option in Individualized Studies",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/graduate-programs"
    },
    {
        "Concentration name": "Sport Management",
        "description": "The Master of Arts in Kinesiology has four options for students to choose from: Adapted Physical Education, Coaching and Student-Athlete Development, Pedagogical Studies, and Sport Management. Our program is designed to develop leaders, educators, and researchers in the field of Kinesiology. Our faculty are experts in their fields and are committed to providing a high-quality education to our students. Our program is designed to be flexible to meet the needs of our students. We offer a variety of courses that are offered in the late afternoon and evening to accommodate working professionals. Our program is designed to be completed in two years.\n\nThe Sport Management option is designed to prepare students for a career in the sport industry. The program provides students with a strong foundation in the business of sport, including finance, marketing, law, and facility management. Students will also have the opportunity to complete an internship in the sport industry. Our graduates have gone on to work for professional sports teams, collegiate athletic departments, and other sport organizations.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/department-of-kinesiology/master-of-arts-in-kinesiology",
        "Accreditation status": null,
        "Program name": "Master of Arts in Kinesiology with option in Sport Management",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Exercise Physiology and Nutrition",
        "description": "This option provides students with a strong scientific foundation in both exercise physiology and nutrition. Students will learn to critically evaluate research, and develop skills to conduct research and apply their knowledge in a variety of professional settings. The program is designed to provide excellent preparation for those interested in doctoral studies in either exercise physiology or nutrition, as well as for those planning a career in cardiac rehabilitation, corporate fitness, or as an exercise specialist working with a variety of healthy and clinical populations.",
        "program website url": "https://www.csulb.edu/program/kinesiology-ms",
        "Accreditation status": null,
        "Program name": "Master of Science in Kinesiology with option in Exercise Physiology and Nutrition",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/graduate-programs"
    },
    {
        "Concentration name": "Exercise Science",
        "description": "The Master of Science in Kinesiology is designed for students with an undergraduate degree in Kinesiology or a related field. The program provides advanced study in the sub-disciplines of Kinesiology. It also prepares students for doctoral work or for professional careers in a variety of fields including teaching, coaching, research, and for work in private industry or public agencies related to physical activity, exercise, and sport.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/kinesiology/ms-in-kinesiology",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Kinesiology with option in Exercise Science",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Sport, Exercise, and Performance Psychology (SEPP) is housed in the Department of Kinesiology and prepares students to be well-trained professionals that can apply psychological principles to sport, exercise, and performance settings. The program is designed for students who want to become a Certified Mental Performance Consultant (CMPC®) through the Association for Applied Sport Psychology (AASP) and work in applied settings or students who intend to pursue a doctoral degree. Our program is a theory-to-practice-based program with an emphasis on students gaining hands-on, supervised experience. Our faculty are experts in their given fields and are active in research and their applied work. All students will complete a culminating experience (i.e., thesis or capstone project). The SEPP program is committed to developing culturally competent graduates who become Certified Mental Performance Consultants (CMPC®) through the Association for Applied Sport Psychology (AASP).",
        "program website url": "https://www.csulb.edu/academic-senate/master-of-science-sport-exercise-and-performance-psychology",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Kinesiology with option in Sport and Exercise Psychology",
        "Program Page url": "https://www.csulb.edu/academic-senate/master-of-science-sport-exercise-and-performance-psychology"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Gerontology program provides a professional multidisciplinary education in gerontology for those who are currently working with older adults or who plan to work with them. The purpose of this program is to prepare graduates for a career in the field of aging. Coursework is designed to provide information about the complex and multiple aspects of aging including physical, social, and psychological changes; and the interdependence of the older person with the family and various other social support systems. The program provides an intensive internship or a thesis in a student’s area of interest. The curriculum has been designed to include the Gerontology Competencies for Professionals in the California University System.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/gerontology/master-science-gerontology",
        "Accreditation status": "The Master of Science in Gerontology is an AGHE Program of Merit.",
        "Level": "Master of Science",
        "Program name": "Master of Science in Gerontology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Nutritional Science is a 31-unit graduate program designed to prepare students for a variety of professional careers in nutrition. The program provides students an opportunity to advance their knowledge in nutritional science and to develop their skills in research methodologies. Students will learn to evaluate scientific literature, design and conduct research, and communicate nutrition information to a variety of audiences. The Master of Science program will help prepare students for a doctoral degree or for careers in a variety of settings, such as healthcare, research, food systems management, public policy, and private industry.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/ms-program-nutritional-science",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Nutritional Science",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/family-and-consumer-sciences/ms-program-nutritional-science"
    },
    {
        "Concentration name": [
            "Community Health",
            "Health Equity",
            "Urban Health"
        ],
        "description": "The CSULB Master of Public Health (MPH) Program is a two-year, 42-unit program that provides an exciting and supportive learning environment for students to gain the skills needed to be public health professionals. Our mission is to prepare public health professionals to promote health and health equity within diverse urban communities. To accomplish this, our program provides a dynamic, student-centered learning environment with small class sizes and personalized mentorship from our faculty. The program combines a strong foundation in the core competencies of public health with the opportunity for students to tailor their learning experience through a flexible menu of elective options and mentored fieldwork experience. Our graduates work in a variety of public health settings, including local and state health departments, non-profit agencies, healthcare organizations, and some go on to pursue doctoral studies. The program offers three specialization options: Community Health, Health Equity, and Urban Health. The Community Health option is a fully online specialization, whereas the Health Equity and Urban Health specializations are campus-based.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/health-science/master-public-health",
        "Accreditation status": "The CSULB MPH Program is accredited by the Council on Education for Public Health (CEPH). CEPH is an independent agency recognized by the U.S. Department of Education to accredit schools and programs of public health. CEPH assists schools and programs in evaluating the quality of their instruction, research, and service programs and provides a formal accreditation process for schools and programs that meet the criteria for accreditation.",
        "Level": "Master",
        "Program name": "Master of Public Health",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Public Works Administration",
        "description": "The Master of Public Administration (MPA) program offers a professional education designed to prepare students for leadership careers in government and nonprofit organizations. The curriculum is designed to provide students with a foundation in the general knowledge, skills, and values of public administration, and a choice of specialized knowledge in urban affairs or public works administration. The program is committed to academic excellence and to the public service values of ethics and social equity.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate-program/public-administration-option-public-works-administration-mpa",
        "Accreditation status": "The MPA Program is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA).",
        "Level": "Master",
        "Program name": "Master of Public Administration with option in Public Works Administration",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Urban Affairs",
        "description": "The Master of Public Administration (MPA) degree program at California State University, Long Beach is a professional degree designed to prepare students for leadership and management careers in the public and nonprofit sectors. The mission of the CSULB MPA program is to provide a high-quality graduate education to a diverse student body, preparing them to be effective and ethical public and nonprofit leaders. The program curriculum is designed to provide students with a foundation in the general principles of public administration, and to allow students to develop expertise in a specific policy area. Students will develop skills in management, policy analysis, and problem-solving. The CSULB MPA program combines a rigorous academic curriculum with real world experience, providing students with the knowledge and skills necessary to serve their communities. The program serves both pre-service students seeking to begin a career in public service and mid-career students seeking professional development and career advancement. Our program is designed to be accessible to working professionals, with all MPA courses offered in the evenings.",
        "program website url": "https://www.csulb.edu/gpa",
        "Accreditation status": "The program is accredited by the Network of Schools of Public Policy, Affairs, and Administration (NASPAA), the recognized accrediting body for public administration programs.",
        "Level": "Masters",
        "Program name": "Master of Public Administration with option in Urban Affairs",
        "Program Page url": "https://www.csulb.edu/sites/default/files/document/mpa_student_handbook.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Recreation Administration is a professional degree designed to prepare students for management and leadership positions in a wide variety of recreation and/or park agencies at the local, state, and federal levels; non-profit and community-based organizations; and in the commercial/tourism industry. Students learn to manage resources, personnel, and finances, and also to plan, market, and evaluate services in recreation, parks, and tourism.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/recreation-and-leisure-studies/masters-degree-recreation",
        "Accreditation status": "The Master of Science in Recreation Administration is accredited by the Council on Accreditation of Parks, Recreation, Tourism and Related Professions (COAPRT).",
        "Program name": "Master of Science in Recreation Administration",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/recreation-and-leisure-studies/masters-degree-recreation"
    },
    {
        "Concentration name": [
            "Child and Family Wellbeing",
            "Adulthood and Aging",
            "Integrated Health"
        ],
        "description": "The Master of Social Work (M.S.W.) degree program at California State University, Long Beach (CSULB) has been accredited by the Council on Social Work Education (CSWE) since 1971. The mission of the School of Social Work is to provide accessible, high-quality education that produces ethical and competent social work leaders, practitioners, and scholars who are committed to advancing social and economic justice and empowering diverse individuals, families, groups, and communities, with an emphasis on serving historically underserved urban populations. The program prepares students for professional social work practice by providing them with the theoretical knowledge, practice skills, and real-world experience needed to excel in their careers. M.S.W. students complete both academic coursework and field education internships.",
        "program website url": "https://www.csulb.edu/college-of-health-and-human-services/social-work/master-social-work",
        "Accreditation status": "Accredited by the Council on Social Work Education (CSWE) since 1971.",
        "Program name": "Master of Social Work",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts (M.A.) education program in speech-language pathology at California State University, Long Beach is accredited by the Council on Academic Accreditation in Audiology and Speech-Language Pathology of the American Speech-Language-Hearing Association, 2200 Research Boulevard, #310, Rockville, MD 20850, 800-498-2071 or 301-296-5700. The M.A. program is also accredited by the California Commission on Teacher Credentialing. This program provides academic and clinical education leading to the M.A. degree in Speech-Language Pathology, the Certificate of Clinical Competence in Speech-Language Pathology (CCC-SLP) from the American Speech-Language-Hearing Association (ASHA), the license in speech-language pathology from the California Speech-Language Pathology and Audiology and Hearing Aid Dispensers (SLPAHADB) Board, and the Speech-Language Pathology Services Credential from the California Commission on Teacher Credentialing (CTC).",
        "program website url": "https://www.csulb.edu/speech-language-pathology/page/graduate-program",
        "Accreditation status": "The Master of Arts (M.A.) education program in speech-language pathology at California State University, Long Beach is accredited by the Council on Academic Accreditation in Audiology and Speech-Language Pathology of the American Speech-Language-Hearing Association, 2200 Research Boulevard, #310, Rockville, MD 20850, 800-498-2071 or 301-296-5700. The M.A. program is also accredited by the California Commission on Teacher Credentialing.",
        "Program name": "Master of Arts in Speech-Language Pathology",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/speech-language-pathology"
    },
    {
        "Concentration name": "General Anthropology",
        "description": "The Department of Anthropology offers a Master of Arts degree in Anthropology with an option in General Anthropology. This M.A. program serves two main student constituencies: 1) students who plan to enter a Ph.D. program in anthropology upon completion of their M.A. degree, and 2) students who will seek professional, non-academic employment in fields where anthropological training is relevant and useful. The program requires all students to develop a grounding in the traditional four subfields of anthropology (sociocultural anthropology, biological anthropology, archaeology, and linguistic anthropology) but also allows each student to select one of these subfields as a primary area of emphasis.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/anthropology/ma-in-anthropology",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Anthropology with option in General Anthropology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Applied Anthropology",
        "description": "The Master of Arts in Anthropology is designed for students interested in careers in both the public and private sectors, as well as for those who wish to pursue a Ph.D. The M.A. program in Anthropology provides two options: Applied Anthropology or Archaeology. The Applied option provides students with the training needed to solve real-world problems by improving the design and implementation of projects, policies, and programs. The Archaeology option provides students with an understanding of past cultures and the skills necessary for fieldwork and analysis. Both options provide a solid grounding in anthropological theory and method, with a focus on practical application in a wide variety of local, national and international contexts.",
        "program website url": "https://www.csulb.edu/academic-catalog/course-catalog/anthropology/master-of-arts-in-anthropology",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Anthropology with option in Applied Anthropology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "General Asian Studies",
        "description": "The Master of Arts in Asian Studies is an interdisciplinary degree program that allows students to choose one of two options: General Asian Studies or Asian Studies with a specialization in Chinese, Japanese, or Khmer (Cambodian). This graduate program provides a broad, balanced, and comparative understanding of Asia, while at the same time ensures an appropriate depth of knowledge in a specific area of study. The M.A. in Asian Studies prepares students for careers in government, the private sector, and teaching, as well as providing preparation for doctoral studies in a variety of disciplines.",
        "program website url": "https://cla.csulb.edu/departments/aaas/graduate-credential/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Asian Studies with option in General Asian Studies",
        "Program Page url": "https://cla.csulb.edu/departments/aaas/graduate-credential/"
    },
    {
        "Concentration name": "Chinese Studies",
        "description": "The Master of Arts degree in Asian Studies is an interdisciplinary degree designed to meet the needs of students who wish to pursue careers in which advanced knowledge of Asian languages and cultures is essential, including secondary school and community college teaching, government service, international business, and international law. It is also designed to provide a firm foundation for those who intend to pursue the Ph.D. degree in a discipline with an Asian specialization. The program draws on the resources of faculty in the departments of Asian and Asian American Studies, Anthropology, Art, Comparative World Literature and Classics, Economics, Geography, History, Linguistics, Political Science, and Religious Studies. The M.A. in Asian Studies offers two options: one in Chinese Studies and one in Japanese Studies.",
        "program website url": "https://www.csulb.edu/academic-catalog/program/asian-studies-ma",
        "Accreditation status": null,
        "Program name": "Master of Arts in Asian Studies with option in Chinese Studies",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Teaching Chinese as a Foreign Language",
        "description": "The M.A. program provides interdisciplinary training for students who wish to pursue careers in Asian-related fields or to pursue further graduate study. It trains students to analyze and to understand the forces which have shaped the nations of Asia through rigorous coursework and directed research. The option is designed for students who are native or near-native speakers of Mandarin Chinese and wish to teach Chinese at the community college or university level in the United States and other English-speaking countries. It offers an excellent training in both linguistic and pedagogical aspects of teaching Chinese as a foreign language.",
        "program website url": "https://cla.csulb.edu/departments/aaas/graduate-credential/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Asian Studies - Teaching Chinese as a Foreign Language",
        "Program Page url": "https://cla.csulb.edu/departments/aaas/graduate-credential/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Communication Studies is a 30-unit program that provides a comprehensive course of study in the principles, theories, and research of human communication from a social science and humanistic perspective. The program is designed for students who desire a career in communication for the business, government, or non-profit sector; for students who wish to pursue a doctoral degree; and for students who want to teach at the community college level. Our award-winning and nationally-recognized faculty conduct research and teach courses in a variety of areas including interpersonal, intercultural, organizational, political, instructional, health, and gender communication as well as rhetoric and performance studies. The curriculum is designed to provide breadth of knowledge in the communication discipline as well as a focused program of study that aligns with students’ career goals. Through coursework and individual work with a faculty advisor, students tailor the program to their individual interests.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/communication-studies/ma-in-communication-studies",
        "Accreditation status": null,
        "Program name": "Master of Arts in Communication Studies",
        "Program Page url": "https://www.eiu.edu/commstudiesgrad/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts degree in Economics offers students the opportunity to become professional economists or to improve the skills that they use in their current careers. The program’s main objectives are to provide students with a solid foundation in microeconomic and macroeconomic theory and to teach them how to use that theory and related quantitative tools to analyze a wide range of real-world economic issues.\n\nThe Department of Economics is committed to providing its students with the education and training they need to achieve their professional goals. Our M.A. students have gone on to work in private-sector jobs in fields like economic consulting, finance, and marketing, and in public-sector jobs with agencies like the Bureau of Labor Statistics, the Government Accountability Office, and the California Franchise Tax Board. They have also entered Ph.D. programs at universities such as Caltech, the University of North Carolina, the University of Texas, UC Berkeley, UC Davis, and UC Santa Barbara.\n\nOur program provides a rigorous curriculum that teaches you the theoretical and quantitative skills that will serve you well in your career or in Ph.D. programs.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/economics/ma-in-economics",
        "Accreditation status": null,
        "Program name": "Master of Arts in Economics",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in English at CSULB is an innovative and flexible program that prepares students for a variety of careers and for further study in doctoral programs. It is designed to broaden and deepen students’ knowledge of literary history, literary and rhetorical theory, and textual analysis. The M.A. in English features three main components: a small number of core courses in literary theory, research methods, and pedagogy; a wide range of electives that allows students to devise their own course of study; and a capstone experience in which students choose among a thesis, a project, or a comprehensive examination.",
        "program website url": "https://cla.csulb.edu/departments/english/ma-in-english/",
        "Accreditation status": null,
        "Program name": "Master of Arts in English",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Fiction, Poetry",
        "description": "Welcome to the CSULB MFA program. The faculty and I are all pleased to have you here, and we look forward to working with you for the next few years to develop your skills as a creative writer, literary critic, and teacher. The MFA at CSULB is a unique program, one that prides itself on its close-knit community, its innovative approaches to creative writing and literary study, and its commitment to social justice. We believe these values foster a supportive atmosphere in which to take on the difficult challenge of becoming a better writer and a more sophisticated reader. The MFA is a 48-unit terminal degree in Creative Writing, with separate emphases in Fiction and Poetry. Students must complete 48 units of coursework, including 15 units of writing workshops, 12 units of literature courses, 9 units of electives (craft courses, additional literature courses, or additional workshops), 6 units of thesis work, and 6 units of teaching-related courses (ENGL 696 and ENGL 500 or ENGL 497). The degree is typically completed in 3 years.",
        "program website url": "https://cla.csulb.edu/departments/english/mfa/",
        "Accreditation status": null,
        "Program name": "Master of Fine Arts in English - Creative Writing",
        "Program Page url": "https://cla.csulb.edu/departments/english/mfa/wp-content/uploads/2021/09/MFA-Handbook-Rev-2021-1.pdf"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts degree program in French and Francophone Studies provides students with a solid and broad foundation in the major periods of French and Francophone literature as well as in the principal domains of linguistics. It is designed to prepare students for a career in teaching at the secondary school or community college level or for further study at the doctoral level. Students work in close collaboration with a Graduate Advisor to elaborate an individual program that corresponds to their own interests and professional goals.",
        "program website url": "http://catalog.csulb.edu/preview_program.php?catoid=8&poid=3681",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in French & Francophone Studies",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Geographic Information Science (MSGISci) is a one-year, 30-unit program that can be completed in 12 months for full-time students (four courses per semester, plus a two-course summer capstone experience) or 24 months for part-time students. The MSGISci degree provides students with advanced academic and technical training in the field of Geographic Information Science (GISci), including GIS, GPS, remote sensing, and computer cartography. The degree is targeted to working professionals and recent college graduates who desire advanced training in geospatial technologies. As an applied professional degree program, students learn both the theory behind the technology and practical experience in using geospatial hardware and software to solve real-world problems. With these skill sets, graduates will be ready to enter or advance in the fast-growing geospatial technology industry in both the public and private sectors. With a MSGISci degree, you will be well prepared for a career as a GIS Analyst, GIS Specialist, GIS Manager, GIS Project Manager, Remote Sensing Analyst, or Geospatial Application Developer in a variety of fields including urban planning, environmental management, marketing, real estate, transportation, and public safety.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/geography/ms-in-geographic-information-science",
        "Accreditation status": null,
        "Program name": "Master of Science in Geographic Information Science",
        "Program Page url": "https://www.youtube.com/watch?v=r4DOUQ6COYA"
    },
    {
        "Concentration name": "Geospatial Science (GIS, Remote Sensing, Cartography), Urban & Cultural Geography, Environmental & Physical Geography, Global & Regional Studies",
        "description": "The Department of Geography at California State University, Long Beach offers a flexible Master of Arts (M.A.) degree that can be tailored to the interests and career goals of each student. We provide a broad-based graduate education that covers the major sub-disciplines of geography, as well as specialized training in several key areas. Students may focus on one of the following areas of specialization, or develop a specific program of study tailored to their individual interests: Geospatial Science (GIS, Remote Sensing, Cartography), Urban & Cultural Geography, Environmental & Physical Geography, and Global & Regional Studies. The M.A. in Geography at CSULB offers students an opportunity to work closely with our award-winning faculty in small seminar settings and on research projects. Our graduate courses allow for a high degree of faculty-student interaction and personalized advising.",
        "program website url": "http://www.csulb.edu/geography",
        "Accreditation status": null,
        "Program name": "Master of Arts in Geography",
        "Program Page url": "https://cla.csulb.edu/departments/geography/wp-content/uploads/2019/10/INVITATION-TO-GRADUATE-STUDY-GEOGRAPHY-CSULB-web.pdf"
    },
    {
        "Concentration name": null,
        "description": "The M.A. in German provides students with a solid and comprehensive foundation in German literature and culture from the 18th century to the present. The program is designed to prepare students for doctoral work at other institutions and for teaching at the secondary school or community college level. It also serves the needs of students who are pursuing a degree for personal enrichment or to enhance their professional qualifications in other fields, such as international business, government, translation/interpretation, and the like.",
        "program website url": "https://cla.csulb.edu/departments/rgrll/german/ma-in-german/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in German",
        "Program Page url": "https://cla.csulb.edu/departments/rgrll/wp-content/uploads/2012/06/German-MA-Application-RGRLL-Website.pdf"
    },
    {
        "Concentration name": "United States History, European History, World History",
        "description": "The Master of Arts in History provides advanced historical training to students from a wide variety of academic backgrounds. The program is designed for students who desire to continue on to a doctoral program, to teach at the secondary school or community college level, or for those who desire the M.A. for personal or professional enrichment. Students at CSULB learn the historian’s craft: researching in archives and libraries, working with primary and secondary sources, engaging in historiographical debates, and writing analytical, evidence-based narratives. M.A. students at CSULB enjoy a close rapport with faculty who are committed and caring teachers as well as active and publishing scholars. The program is flexible enough to accommodate both full- and part-time students. Most graduate seminars are offered in the late afternoons and evenings to accommodate our students’ work schedules.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/history/ma-program-in-history",
        "Accreditation status": null,
        "Program name": "Master of Arts in History",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in International Affairs is an interdisciplinary program designed to prepare students for careers in government service, international institutions, and non-profit organizations. It offers an advanced understanding of the political, economic, historical, and cultural factors that shape relations among nations. The curriculum combines area studies courses, which examine specific regions of the world, with courses that explore the global forces that affect all nations. Through its interdisciplinary approach, students can acquire the breadth of knowledge and the analytical skills necessary to succeed in a variety of careers with an international focus.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/political-science/ma-in-international-affairs",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in International Affairs",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The master’s degree in Italian Studies at CSULB offers two distinctive curricular options to meet the needs of a variety of students, from those who plan to pursue a Ph.D. to those who are K-12 teachers, to those who want to work in an international context. Both options can be completed on a full-time or part-time basis, in the late afternoon and evening, to accommodate our students’ busy schedules.\n\nOption A is the traditional curriculum based on the study of Italian literature. It is conceived as a two-year course of study for full-time students. It prepares students for a variety of professions and provides a solid foundation for those students who are interested in pursuing a doctoral degree in Italian Studies.\n\nOption B offers an interdisciplinary curriculum focused on Italian culture and society seen through the lenses of literature, film, and cultural studies. It can be completed in as little as 12 months for full-time students. It caters to the needs of students interested in K-12 teaching as well as in other professions where a solid knowledge of contemporary Italian language and culture is required. The curriculum of Option B is characterized both by a solid core of coursework in the study of Italian language, literature, and culture and by an interdisciplinary approach to the subject.",
        "program website url": "https://www.csulb.edu/george-l-graziadio-center-for-italian-studies/programs",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Italian Studies",
        "Program Page url": "https://www.csulb.edu/george-l-graziadio-center-for-italian-studies/programs"
    },
    {
        "Concentration name": "Language & Culture",
        "description": "The Master of Arts in Linguistics program at CSULB offers students a strong foundation in the primary areas of linguistics. Students complete a program of study that prepares them for advanced study at the doctoral level, or for employment in a range of fields that value the critical thinking skills of a trained linguist. The M.A. in Linguistics has two options: Language and Culture, and Teaching English to Speakers of Other Languages (TESOL). The Language and Culture option focuses on linguistic analysis and documentation of under-described languages, with an emphasis on languages of the Americas. The TESOL option is a professional degree in the theory and practice of language pedagogy for students who wish to teach English as a second or foreign language in the U.S. or abroad.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/linguistics-department/ma-linguistics",
        "Accreditation status": null,
        "Program name": "Master of Arts in Linguistics with option in Language & Culture",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/linguistics-department/ma-linguistics"
    },
    {
        "Concentration name": "General Linguistics",
        "description": "The Department of Linguistics offers a Master of Arts degree in Linguistics. Students may choose one of three options within the M.A. program: General Linguistics, Language and Culture, or TESL/TEFL (Teaching English as a Second/Foreign Language). The M.A. program is designed to provide students with a solid foundation in the major subfields of linguistics (phonology, syntax, and semantics). Having acquired this foundation, students then have the opportunity to pursue advanced coursework in these and other areas of linguistics and applied linguistics.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/linguistics/ma-in-linguistics",
        "Accreditation status": null,
        "Program name": "Master of Arts in Linguistics with option in General Linguistics",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Special Concentration",
        "description": "The Master of Arts in Linguistics is designed to provide students with a strong foundation in the primary areas of linguistics. Students may select an option in General Linguistics, Language and Culture, Teaching English to Speakers of Other Languages (TESOL), or a Special Concentration. This program prepares students for careers in industry and government, for teaching English at the community college level or overseas, and for further study in linguistics and related fields at the doctoral level.",
        "program website url": "http://catalog.csulb.edu/preview_program.php?catoid=8&poid=3677",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Linguistics with option in Special Concentration",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Teaching English to Speakers of Other Languages (TESOL)",
        "description": "The M.A. in Linguistics with the TESOL Option provides students with a strong background in linguistics coupled with a deep understanding of the second language acquisition process. Through their coursework, students will learn to apply this knowledge to the practicalities of second language teaching. In addition to a broad selection of courses focusing on linguistic theory, second language acquisition, and pedagogical practice, we also offer our students a range of hands-on opportunities designed to help them develop as teachers. These include a teaching practicum in our on-campus ESL program (the American Language Institute), a student-run journal (The Lingua Franca), and a vibrant schedule of departmental events.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/linguistics/ma-in-linguistics",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Linguistics with option in Teaching English to Speakers of Other Languages",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Philosophy program at CSULB is designed for students who seek to advance their knowledge of philosophy and develop the skills of philosophical inquiry. The program is committed to pluralistic and multicultural approaches to philosophy, and features a wide range of courses in different philosophical traditions. The program is ideal for students who want to prepare for a Ph.D. program in philosophy or a related field, as well as those who are interested in pursuing careers that require advanced critical thinking, analytical, and communication skills, such as law, education, public policy, and journalism. Students in our program have opportunities to work closely with our faculty, who are experts in a variety of philosophical fields and are dedicated to helping students achieve their academic and professional goals. Students can also participate in the vibrant intellectual life of the department, which includes a regular colloquium series, a student-run philosophy club, a graduate student reading group, and a student-run journal. We are committed to fostering a supportive and inclusive community of learners and scholars.",
        "program website url": "https://cla.csulb.edu/departments/philosophy/ma-program/",
        "Accreditation status": null,
        "Program name": "Master of Arts in Philosophy",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Political Science program at California State University, Long Beach is designed to provide students with a comprehensive, advanced education in the discipline of Political Science. The program offers advanced coursework in a variety of fields, including: American Politics; Comparative Politics; International Relations; and Political Theory. Graduate students will achieve mastery of the major literature and theories in their chosen fields of study, develop a sophisticated understanding of research methods in the social sciences, and apply their knowledge in a major research project in the form of a master’s thesis or a comprehensive examination. Students work closely with their faculty advisors in designing a curriculum that best suits their interests and goals. The program has a strong track record of placing its graduates in doctoral programs and in careers in the private sector and government.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/political-science/master-of-arts",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Political Science",
        "Program Page url": "https://www.csulb.edu/college-of-liberal-arts/political-science/master-of-arts"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts in Psychological Research (MAPR) program is a two-year program designed for students who are interested in pursuing a doctorate in psychology. Students will develop a sophisticated understanding of graduate-level psychological science, as well as the methodological and statistical skills necessary to become a successful researcher. Students are admitted to work with a specific faculty member as their research mentor. All students complete a master's thesis as part of their training.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/psychology/master-of-arts-in-psychological-research-mapr",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Psychological Research",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Industrial/Organizational Psychology (MSIO) program at CSULB is one of the very best in the nation. It adheres to the scientist-practitioner model of I-O psychology and is designed to provide students with the knowledge and skills needed to design, implement, and evaluate evidence-based I-O psychology interventions that improve both organizational effectiveness and employee well-being. Our program is a terminal M.S. degree program, and the majority of our graduates are employed as I-O practitioners in a wide variety of public and private organizations. However, the program also provides excellent preparation for students interested in pursuing a doctoral degree in I-O psychology or a related field.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate/college-of-liberal-arts/department-of-psychology/psychology-industrialorganizational-ms",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Industrial/Organizational Psychology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The M.A. program in Religious Studies offers students an opportunity to study the phenomenon of religion in a variety of global cultures, past and present, from an academic, non-sectarian perspective. It is intended for students who wish to pursue a Ph.D. in religious studies or a related field, as well as students who desire a graduate degree in the humanities or who have a professional interest in religion (e.g., journalists, teachers, counselors).\n\nThe faculty represents a variety of disciplinary approaches to the study of religion (anthropology, history, philosophy, and sociology) and a wide variety of religious traditions (e.g., ancient Near Eastern religions, Greco-Roman religions, Judaism, Christianity, Islam, Hinduism, Buddhism, and the religions of ancient Mesoamerica). The graduate seminar classroom provides a lively environment for discussion among students from diverse backgrounds and with different interests and goals. Students in the M.A. program develop advanced critical thinking, research, and writing skills as they pursue their individual interests. Students work closely with the graduate advisor to design a course of study suited to their particular goals.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/religious-studies/master-of-arts-in-religious-studies",
        "Accreditation status": null,
        "Level": "MA",
        "Program name": "Master of Arts in Religious Studies",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": [
            "Hispanic Linguistics",
            "Spanish Literature",
            "Latin American Literature"
        ],
        "description": "The Master of Arts in Spanish is a 30-unit program with three distinct specializations: Hispanic Linguistics, Spanish Literature and Latin American Literature. Each prepares students for a variety of careers and doctoral work. Through these specializations, students are trained to conduct original and in-depth research to contribute to the current scholarly conversations of each field. Graduate students work with experienced faculty in small seminars to build their academic and professional expertise in these areas. Students in the M.A. in Spanish program have the opportunity to take part in the life of the department and expand their professional contacts through events, conferences, service on committees and a graduate student organization. Qualified M.A. students may be selected to work as Teaching Associates (TAs) in the department’s lower-division language program. These paid positions provide excellent experience for those who wish to pursue a career in teaching.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/romance-germanic-russian-languages-and-literatures/ma-spanish",
        "Accreditation status": null,
        "Program name": "Master of Arts in Spanish",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Program name": "Master of Science in Sustainability Management",
        "Program Page url": "https://science.gmu.edu/academics/departments-units/environmental-science-policy/graduate-programs"
    },
    {
        "Concentration name": "Biostatistics",
        "description": "The Master of Science in Applied Statistics is designed to provide students with a solid foundation in statistical theory and applications. Graduates of the program will be well-prepared to assume professional positions in government, industry, and the private sector or to pursue a Ph.D. degree in statistics or other related fields. The Master of Science in Applied Statistics offers two options: Applied Statistics and Biostatistics. The Applied Statistics option is a general applied statistics program. The Biostatistics option is a specialized program with an emphasis on applications in health-related and biological sciences. The program also offers a certificate program in applied statistics, which is available to students who are currently enrolled in a graduate program at CSULB.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate-program/applied-statistics-ms",
        "Accreditation status": null,
        "Program name": "Master of Science in Applied Statistics with option in Biostatistics",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Data Science",
        "description": "The Master of Science in Applied Statistics program is designed to provide students with a sound background in statistical methodology. Students completing the M.S. degree will be well prepared to assume leadership roles in the professional community as statisticians in industry, government, or the private sector, and to pursue doctoral studies in statistics or a related field. The Option in Data Science is designed to give students a core foundation in statistical methodology with an emphasis in the area of data science. This option is intended for students who want to develop and apply their skills in the exciting and fast growing field of data science. Students in this option will learn how to analyze large datasets using statistical and modern machine learning methods. They will gain practical skills in data management, statistical computing, data visualization, and statistical modeling.",
        "program website url": "https://www.csulb.edu/academic-senate/ms-applied-statistics-option-data-science",
        "Accreditation status": null,
        "Program name": "Master of Science in Applied Statistics with option in Data Science",
        "Program Page url": "https://www.csulb.edu/academic-senate/ms-applied-statistics-option-data-science"
    },
    {
        "Concentration name": null,
        "description": "The Department of Chemistry and Biochemistry offers a Master of Science degree program in Biochemistry. The curriculum is designed to prepare students for a career as a professional biochemist in industry, government service or the non-profit sector. The M.S. program also provides an excellent background for further training at the doctoral level in biochemistry and related fields of molecular life science. Our mission is to provide students with a strong academic foundation in the theory and practice of modern biochemistry and opportunities to engage in exciting laboratory research projects that advance the frontiers of biochemical knowledge.",
        "program website url": "https://www.csulb.edu/program/biochemistry-ms",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Biochemistry",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Biology program provides advanced training in a broad range of biological specializations. It is a thesis-based degree that culminates in the public defense of an original research project. Graduates are well prepared to pursue further graduate study, work in academic or research institutions, and for a variety of careers in the private and public sectors.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/biological-sciences/ms-in-biology",
        "Accreditation status": null,
        "Program name": "Master of Science in Biology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Chemistry program at CSULB offers students opportunities to work on exciting, cutting-edge research projects that span the breadth of chemistry: analytical, physical, organic, inorganic, and materials chemistry. In addition, there are many opportunities for interdisciplinary research with faculty in biochemistry, biology, physics, geology, and engineering. Most M.S. students receive financial support to attend CSULB in the form of teaching assistantships. Research faculty receive financial support for their research programs through various federal, state, and private funding agencies.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/chemistry-and-biochemistry/chemistry-ms",
        "Accreditation status": null,
        "Program name": "Master of Science in Chemistry",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science degree in Geology is designed to prepare students for careers as professional geologists in industry and government, for teaching careers at the secondary or community college levels, or for Ph.D. work at another institution. Students build upon the general background of their undergraduate major through advanced courses and independent research. Students are expected to demonstrate a professional mastery of geologic concepts and to show an ability to conduct independent research in their thesis work.",
        "program website url": "https://www.csulb.edu/university-catalog/graduate-degrees/college-of-natural-sciences-and-mathematics/geological-sciences/geology-ms",
        "Accreditation status": null,
        "Program name": "Master of Science in Geology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Applied Math",
        "description": "The Master of Science in Mathematics prepares students for careers in business, industry, government, and teaching at the secondary and community college levels. The program also provides a strong foundation for students who wish to pursue a doctoral degree in mathematics, mathematics education, or a related field. Students in the MS Math program choose one of four options: Applied Math Option, Math Education Option, Pure Math Option, Statistics Option. Each option has a separate set of course requirements, culminating in a written thesis or a comprehensive exam. Our graduate students benefit from small class sizes and close interaction with our dedicated faculty, who are all active researchers in their fields. Graduate students who demonstrate strong academic performance and teaching potential can apply for a teaching associateship (TA). Teaching associates receive a stipend for teaching one or two courses per semester. More information can be found on our TA Program page.",
        "program website url": "https://www.csulb.edu/mathematics-statistics/graduate-programs",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Mathematics with option in Applied Math",
        "Program Page url": "https://www.csulb.edu/mathematics-statistics/graduate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Mathematics for Educators is a 30-unit program designed for individuals with a single subject credential in mathematics or with a major in mathematics or a related field. The program provides an opportunity for in-depth study of mathematics with connections to the secondary curriculum. The curriculum emphasizes pure and applied mathematics and provides students with skills and knowledge to serve in leadership positions. This degree does not lead to a teaching credential.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate/cnsm/mathematics-statistics/mathematics-educators-ms",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Mathematics for Educators",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Microbiology program is a research-based program designed to prepare students for careers in microbiology. The curriculum is broad-based, providing students with a solid foundation in the core areas of microbiology: physiology, genetics, and pathogenic microbiology as well as specialized knowledge in an area of concentration. Students can choose to pursue thesis or non-thesis options. The thesis option involves an original research project that is carried out in the laboratory of one of the microbiology faculty members. The non-thesis option culminates in a comprehensive exam. Both options require satisfactory completion of a formal oral presentation. Students who are considering future graduate studies at the doctoral level or a career in research are strongly advised to select the thesis option.",
        "program website url": "https://www.csulb.edu/academic-affairs/graduate-studies/program/microbiology-master-science-ms",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Microbiology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Applied Physics",
        "description": "The Master of Science (M.S.) in Physics program is designed to provide students with advanced training in physics. The program has two options: a general physics option and an applied physics option. The applied physics option is designed to bridge the gap between basic physics and applied engineering and is suitable for students who wish to pursue careers in industry. Both options are research-oriented and prepare students for careers in industry or for further studies in Ph.D. programs.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/physics-and-astronomy/master-of-science-in-physics",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Physics with option in Applied Physics",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Computational Physics",
        "description": "The Master of Science in Physics, Option in Computational Physics program is designed to provide students with a strong background in physics and training in computer-based techniques for collecting, analyzing, and modeling physical data and phenomena. The curriculum is intended to provide the graduate with the skills needed to pursue further graduate work or to obtain a position in research or industry. Upon graduation, a student will have experience in collecting and analyzing data, in using a variety of computational tools, and in communicating the results of their research to the scientific community. To be eligible for this option, the student must have sufficient preparation in undergraduate physics. At least a 2.7 grade point average in the last 60 semester units (90 quarter units) attempted and at least a 3.0 grade point average in all upper-division physics courses is required. GRE subject test is not required.",
        "program website url": "https://www.csulb.edu/physics-astronomy/graduate-programs",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Physics with option in Computational Physics",
        "Program Page url": "https://www.csulb.edu/physics-astronomy/graduate-programs"
    },
    {
        "Concentration name": "Elementary & Middle School",
        "description": "The Master of Science in Science Education, option in Elementary and Middle School Science is designed for elementary and middle school teachers who wish to increase their content knowledge in all areas of science and enhance their pedagogical skills in a technology-rich environment. This is a cohort-based program consisting of a maximum of 25 students who complete the degree program in two years including summers. Participants take courses specifically designed for them in a sequence that ensures a coherent and integrated experience. Courses are offered on weekday evenings and on several Saturdays each semester to accommodate the schedules of working teachers.",
        "program website url": "https://www.csulb.edu/science-education/graduate-programs",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Science Education with option in Elementary & Middle School",
        "Program Page url": "https://www.csulb.edu/science-education/graduate-programs"
    },
    {
        "Concentration name": "Informal Science Education",
        "description": "The Master of Science in Science Education program is designed to meet the needs of those who want to improve their content knowledge and pedagogical skills in science. This degree will serve certificated teachers at all levels (K-16), as well as educators in informal settings (e.g., museums, science centers, outdoor education), and those interested in pursuing further graduate studies in science education.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate/college-of-natural-sciences-and-mathematics/science-education/science-education-ms",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Science Education with option in Informal Science Education",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Science Education offers two options: the Elementary/Middle School Science Education Option and the Secondary Science Education Option. The program is specifically designed to meet the needs of working teachers. Courses are generally offered in the late afternoons or evenings. The program focuses on deepening teachers’ science content knowledge and developing their pedagogical content knowledge - the knowledge needed to teach specific science concepts to specific learners. The program is aligned with the Next Generation Science Standards (NGSS) and emphasizes engaging students in the practices of science. Courses model the instructional approaches that teachers are encouraged to use in their own classrooms. Courses are taught by science education faculty and faculty from the various science disciplines. Students who complete the program will have the skills needed to be leaders in science education in their schools and districts.",
        "program website url": "https://www.csulb.edu/academic-catalog/college-of-natural-sciences-and-mathematics/science-education/science-education-ms/",
        "Accreditation status": null,
        "Program name": "Master of Science in Science Education with option in Science Education",
        "Program Page url": "https://www.youtube.com/watch?v=pEQFT37L5zk"
    },
    {
        "Concentration name": "Secondary Science Education",
        "description": "The Master of Science degree in Science Education provides opportunities for K-12 teachers and other science educators to study recent developments in science and to develop as leaders in the field of science education. The program is specifically designed to allow students to pursue in-depth study in a chosen science discipline while also examining issues related to the teaching and learning of that discipline. Students in the program develop the knowledge and skills to become leaders in science education, prepared to assume roles as department chairs, science specialists, and mentors to new teachers, and to become advocates for high quality science education in their schools and districts. In addition, the program provides a strong foundation for students who wish to pursue a doctoral degree.",
        "program website url": "https://www.csulb.edu/college-of-natural-sciences-and-mathematics/science-education/ms-in-science-education",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Science Education with option in Secondary Science Education",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Dual Language Development",
        "description": "The Master of Arts in Education with an option in Dual Language Development is designed to prepare teachers and other professionals to work with emergent bilingual students (English Learners) in a variety of school settings. This program is specifically designed to address the needs of general education teachers in K-12 whose classes include emergent bilingual students, as well as bilingual and dual language immersion teachers who want to strengthen their pedagogical practices and/or become leaders at their school sites. Coursework addresses theories and practices for working with emergent bilinguals, including first and second language acquisition, culturally and linguistically responsive pedagogies for literacy and content area instruction, and program and assessment models. The final capstone experience will be a research project or thesis based on an educational issue relevant to emergent bilingual students.",
        "program website url": "https://www.csulb.edu/college-of-education/master-of-arts-in-education-option-in-dual-language-development",
        "Accreditation status": null,
        "Program name": "Master of Arts in Education with option in Dual Language Development",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Early Childhood Education",
        "description": "The Master of Arts in Education with an option in Early Childhood Education (ECE) is designed to provide students with an in-depth understanding of the developmental needs of young children (birth to age 8) and their families. Students will study curriculum, program development, pedagogy, and research in ECE. The program prepares graduates to become leaders in various roles: directors of preschools and other early care and education programs, community college instructors, child care coordinators, parent educators, consultants, and policy analysts.",
        "program website url": "https://www.csulb.edu/sites/default/files/document/document_ced_ece_ma-education-option-early-childhood-education-f18-aim.pdf",
        "Accreditation status": null,
        "Program name": "Master of Arts in Education with option in Early Childhood Education",
        "Program Page url": "https://www.csulb.edu/sites/default/files/document/document_ced_ece_ma-education-option-early-childhood-education-f18-aim.pdf"
    },
    {
        "Concentration name": "Educational Administration",
        "description": "The Master of Arts in Education with an option in Educational Administration is a 30-unit program that combines classroom learning and fieldwork to provide a strong theoretical and practical foundation in educational leadership. Students develop knowledge and skills in the areas of leadership, management, communication, curriculum and instruction, assessment, and the legal and financial aspects of school administration. Students who successfully complete the required program of study are eligible to apply for the Preliminary Administrative Services Credential.",
        "program website url": "https://www.csulb.edu/college-of-education/educational-administration-ma",
        "Accreditation status": "The Educational Administration program at CSULB is accredited by the California Commission on Teacher Credentialing (CTC). This accreditation certifies that the program has met the state standards of quality and effectiveness.",
        "Program name": "Master of Arts in Education with option in Educational Administration",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Mathematics Education",
        "description": "The Master of Arts in Education with an option in Mathematics Education program is designed for K-12 teachers of mathematics, mathematics specialists, department chairs, and individuals interested in mathematics education at the school or district level. The program is specifically designed to expand and deepen teachers’ knowledge of mathematics and mathematics education. In particular, the program provides a background in curriculum, instruction, assessment, technology, and research in mathematics education. The program is also designed for K-12 teachers who do not hold a credential to teach mathematics but are interested in doing so. This program may be completed on a part-time basis by working teachers. Candidates must satisfy all university requirements for the master’s degree.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate-program/education-ma-option-mathematics-education",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Education with option in Mathematics Education",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "School Psychology",
        "description": "The School Psychology program at CSULB is a 69-unit program that results in a Master of Arts (M.A.) in Education and a Pupil Personnel Services (PPS) Credential in School Psychology. The program is designed to prepare you to be a leader in the field of school psychology, with the knowledge and skills necessary to provide effective academic, behavioral, and mental health services to a diverse student population in a school setting. Our mission is to prepare school psychologists who will advocate for social justice, equity, and systems change. The program is founded on the principles of Multi-Tiered Systems of Support (MTSS) as a framework for service delivery and the National Association of School Psychologists (NASP) Domains of Practice. Our training philosophy is based on a problem-solving model that uses data-based decision-making. We emphasize primary prevention, early intervention, and the promotion of mental health and wellness for all students. We also integrate a multicultural and social justice lens in all aspects of our training, research, and practice.",
        "program website url": "https://www.csulb.edu/college-of-education/advanced-studies-in-education-and-counseling/school-psychology-program",
        "Accreditation status": "The School Psychology program is approved by the California Commission on Teacher Credentialing (CTC) and the National Association of School Psychologists (NASP).",
        "Level": "Master's",
        "Program name": "Master of Arts in Education with option in School Psychology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Counseling Psychology",
        "description": "The Counseling Psychology (CP) Program is a 60-unit program designed to prepare students for careers in the mental health field. The program provides the academic preparation for the State of California Marriage and Family Therapist (MFT) license and the Professional Clinical Counselor (PCC) license. Our students are trained in counseling theories and techniques to provide quality mental health services to a diverse population. Our program places a strong emphasis on multiculturalism and the development of multiculturally competent counselors. The program has a strong social justice and anti-racism focus. Our faculty is comprised of dedicated and accomplished instructors, who represent a variety of theoretical orientations and interests. Please note that at this time, the CP program is not a CACREP-accredited program and does not prepare graduates to seek licensure in other states.",
        "program website url": "https://catalog.csulb.edu/preview_program.php?catoid=8&poid=3937",
        "Accreditation status": "The CP program is not a CACREP-accredited program.",
        "Program name": "Master of Science in Counseling with option in Counseling Psychology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Student Development in Higher Education",
        "description": "The Master of Science in Counseling, option in Student Development in Higher Education (SDHE) is a 48-unit, three-year, part-time program designed for individuals who seek a career in student affairs. The program provides an overview of the foundations, functions, and skills necessary to work with today's diverse college student populations. The program is designed to develop practitioner-scholars who are skilled in applying theory and research to their professional practice. The program also adheres to a philosophy of social justice and multicultural competence that is reflected throughout the curriculum. This philosophy includes a commitment to developing student affairs professionals who can identify and address issues of equity and access for all student populations. Throughout the program, an emphasis is placed on leadership development and service to the campus and broader community. With a comprehensive and rigorous course of study, relevant fieldwork experiences, and personalized mentorship from an experienced and dedicated faculty, graduates who enter the field of student affairs as new professionals are empowered to do so with confidence, competence, and a commitment to serving students.",
        "program website url": "https://www.csulb.edu/college-of-education/student-development-higher-education/program-description",
        "Accreditation status": "The Council for the Accreditation of Counseling and Related Educational Programs (CACREP), a specialized accrediting body recognized by the Council for Higher Education Accreditation (CHEA), has granted accreditation to the Student Development in Higher Education (M.S.) program in the Department of Advanced Studies in Education and Counseling at California State University, Long Beach.",
        "Level": "Master of Science",
        "Program name": "Master of Science in Counseling with option in Student Development in Higher Education",
        "Program Page url": "https://www.csulb.edu/college-of-education/student-development-higher-education/program-description"
    },
    {
        "Concentration name": "School Counseling",
        "description": "The School Counseling option in the Master of Science in Counseling degree is a 60-unit program. The program is based on the national model of the American School Counseling Association, which emphasizes counseling, consultation, and coordination. The option prepares culturally competent school counselors to be leaders, advocates, and systemic change agents in schools. The School Counseling option is accredited by the Council for the Accreditation of Counseling and Related Education Programs (CACREP) and approved by the California Commission on Teacher Credentialing (CCTC).",
        "program website url": "https://www.csulb.edu/college-of-education/advanced-studies-in-education-and-counseling/ms-in-counseling-school-counseling-option",
        "Accreditation status": "The School Counseling option is accredited by the Council for the Accreditation of Counseling and Related Education Programs (CACREP) and approved by the California Commission on Teacher Credentialing (CCTC).",
        "Program name": "Master of Science in Counseling with option in School Counseling",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Education Specialist (Ed.S.) in School Psychology & Pupil Personnel Services (PPS) Credential in School Psychology program is a 69-unit program designed to prepare students for a career as a school psychologist in public schools. The program emphasizes the application of psychological and educational principles to the educational and mental health needs of children and adolescents. The curriculum is based on the standards of the National Association of School Psychologists (NASP), and the program is approved by both NASP and the California Commission on Teacher Credentialing (CTC). The program is organized as a three-year, full-time program. The first year consists of full-time coursework on campus. The second year consists of part-time fieldwork (practicum) in local schools, concurrent with full-time coursework on campus. The third year consists of a full-time, 1200-hour internship in a local school district. A thesis is also required. Students who successfully complete the program will earn the Master of Science (M.S.) in Educational Psychology degree, the Education Specialist (Ed.S.) in School Psychology degree, and will be recommended for the Pupil Personnel Services (PPS) Credential with a specialization in School Psychology.",
        "program website url": "https://www.csulb.edu/college-of-education/educational-psychology-and-administration/school-psychology-ms-eds-pps",
        "Accreditation status": "The program is approved by both NASP [National Association of School Psychologists] and the California Commission on Teacher Credentialing (CTC).",
        "Level": "Education Specialist (Ed.S.)",
        "Program name": "Education Specialist in School Psychology",
        "Program Page url": "https://www.csulb.edu/sites/default/files/document/eds_school_psychology_pps_application_packet_2020wm.pdf"
    },
    {
        "Concentration name": "Aerodynamics and Computational Fluid Dynamics, Aerospace Structures and Materials, Guidance, Dynamics, and Control",
        "description": "The Master of Science in Aerospace Engineering (MSAE) program at CSULB is an interdisciplinary program that draws upon the disciplines of mechanical, aerospace, and electrical engineering. The MSAE program is designed for students with an interest in a career in the field of aerospace engineering and for working professionals who want to enhance their skills. The program is flexible and can be customized to individual needs and interests. Students may select a general course of study or choose a specialization in Aerodynamics and Computational Fluid Dynamics, Aerospace Structures and Materials, or Guidance, Dynamics, and Control. Students may also pursue a 4+1 blended program that allows them to earn their bachelor's and master's degrees in five years. The program offers two MSAE options: a Thesis Option and a Project Option. Both require 30 units of graduate coursework.",
        "program website url": "https://www.csulb.edu/college-of-engineering/mae/ms-in-aerospace-engineering",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Aerospace Engineering",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Chemical Engineering program prepares students for careers in chemical engineering through advanced training in the fundamentals of chemical engineering: transport phenomena, thermodynamics, kinetics and reactor design, and process control. Students must complete a common core of courses that ensures a breadth of knowledge in these areas. Students also select technical elective courses to attain a depth of knowledge in one or more specialized areas. The program can be completed with a thesis or a comprehensive exam.",
        "program website url": "https://www.csulb.edu/college-of-engineering/chemical-engineering-graduate-programs",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Chemical Engineering",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Construction Management",
        "description": "This program offers a Master of Science in Civil Engineering with an option in Construction Management, designed to meet the need for broadly trained civil engineers capable of supervising interdisciplinary teams. Courses are offered entirely online and scheduled to accommodate the working professional. The curriculum includes courses on construction methods, management, and law. It emphasizes practical applications in the broad area of construction.",
        "program website url": "https://www.csulb.edu/college-of-engineering/master-of-science-civil-engineering-0",
        "Accreditation status": null,
        "Program name": "Master of Science in Civil Engineering with option in Construction Management",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/master-of-science-civil-engineering-0"
    },
    {
        "Concentration name": "Environmental/Water Resources Engineering",
        "description": "The Master of Science in Civil Engineering (MSCE) program is designed to provide students with the technical skills and knowledge necessary to have a successful career in civil engineering. The program provides advanced study in the fields of structural engineering, geotechnical engineering, transportation engineering, construction engineering, water resources engineering, and environmental engineering. The graduate may find employment in industry, government, or in private practice. The program can also serve as a basis for further study toward a doctoral degree.",
        "program website url": "https://www.csulb.edu/academic-catalog/graduate-studies/college-of-engineering/civil-engineering-and-construction-engineering/civil-engineering-ms",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Civil Engineering with option in Environmental/Water Resources",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Structural",
        "description": "The Master of Science in Civil Engineering (MSCE) is a 30-unit program that provides advanced instruction and state-of-the-art training in several areas of specialization within civil engineering. The program may be completed in two years of full-time study. Students choose from one of the following specializations: Construction Engineering, Environmental Engineering, Geotechnical Engineering, Structural Engineering, Transportation Engineering, and Water Resources Engineering. The Master of Science in Civil Engineering program provides students with the opportunity to acquire an advanced body of knowledge in a specialized area of civil engineering and to apply that knowledge to the solution of practical problems. The primary objectives are to develop the student’s ability to think and work independently and to provide advanced instruction in a specialized field of study. The civil engineering graduate faculty are highly dedicated, experienced, and student-oriented. Many are registered professional engineers and are active in consulting and research. Each MSCE program of study is designed by the student in consultation with a faculty advisor to ensure that academic and professional objectives are met. Through the proper selection of courses and the master’s thesis or a comprehensive examination, each student’s program is designed to be a challenging and rewarding experience. We take pride in the preparation of our graduates who will contribute to the advancement of the civil engineering profession.",
        "program website url": "https://www.csulb.edu/college-of-engineering/master-of-science-civil-engineering-0",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Civil Engineering with option in Structural",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/master-of-science-civil-engineering-0"
    },
    {
        "Concentration name": "Transportation Engineering, Geotechnical Engineering",
        "description": "The Master of Science in Civil Engineering (MSCE) is a 31-unit program designed to provide students with the technical skills required for a career in civil engineering practice or for advanced studies leading to a Ph.D. The MSCE program has the following areas of emphasis (options): Structural Engineering, Geotechnical Engineering, Environmental Engineering, Water Resources Engineering, and Transportation Engineering. The MSCE program is also available through the College of Professional and International Education (CPIE).",
        "program website url": "https://www.csulb.edu/college-of-engineering/civil-engineering-and-construction-engineering-management/ms-in-civil-engineering",
        "Accreditation status": null,
        "Program name": "Master of Science in Civil Engineering with option in Transportation/Geotechnical",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Computer Science (MSCS) is a rigorous program that provides students with a broad foundation in computer science, and an in-depth specialization in an area of their interest. The program balances theory and practice to prepare students for a successful career as a computer scientist in industry or to pursue a Ph.D. degree.",
        "program website url": "https://www.csulb.edu/college-of-engineering/computer-engineering-and-computer-science-ms",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Computer Science",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Construction Management (MSCM) degree is a practice-oriented, advanced graduate degree that provides a mixture of construction management and business-related courses. This program is designed for professionals with work experience in the construction industry and students with an undergraduate degree in construction management, construction engineering, civil engineering, architecture or business. The program’s mission is to provide an advanced construction management education that prepares students for careers as industry leaders.",
        "program website url": "https://www.csulb.edu/academic-catalog/course-catalog/master-of-science-in-construction-management",
        "Accreditation status": null,
        "Program name": "Master of Science in Construction Management",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/civil-engineering-construction-engineering-management"
    },
    {
        "Concentration name": [
            "Biomedical Engineering",
            "Communications and Signal Processing",
            "Control Systems",
            "Digital and Computer Systems",
            "Electronics and Solid-State Devices",
            "Power Systems"
        ],
        "description": "The Master of Science in Electrical Engineering (MSEE) is a 30-unit program designed for both full- and part-time students. Graduate courses are offered primarily in the evenings to accommodate working professionals. The program offers a broad-based curriculum, which may be customized to meet individual needs with faculty advisor consultation. MSEE students develop a coherent program of study with the help of a graduate advisor. Options include a traditional thesis track and a non-thesis track featuring a final comprehensive exam. Courses cover theoretical, experimental, and design concepts, while encouraging research and creative problem-solving skills to prepare graduates for leadership positions.",
        "program website url": "https://www.csulb.edu/college-of-engineering/electrical-engineering-department/ms-electrical-engineering",
        "Accreditation status": null,
        "Program name": "Master of Science in Electrical Engineering",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Engineering (MSE) is a unique, innovative, interdisciplinary, and professionally-focused engineering master's degree program developed in partnership with the local industry and offered by the College of Engineering (COE). It is a program to educate engineering and computer science professionals for leadership roles in industry, research, and public service. The program builds depth in a student-chosen engineering specialization area and complements it with breadth in systems engineering, and engineering management and leadership. The program provides the opportunity for students to choose engineering and computer science courses across different departments within the college of engineering, and it culminates in a one-year, two-semester, industry-sponsored capstone project. Students learn from world-class faculty experts, industry leaders and senior management professionals.",
        "program website url": "https://www.csulb.edu/college-of-engineering/master-of-science-in-engineering-interdisciplinary",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Engineering (Interdisciplinary)",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Mechanical Engineering (MSME) program provides students with an opportunity to receive advanced instruction and to perform independent research in a variety of areas of specialization. The degree is awarded upon the satisfactory completion of a coherent program of study that includes a minimum of 30 units of graduate and upper-division coursework. The department requires that at least 21 of these units be in the 500/600 series in mechanical engineering courses. The remaining units must be approved by the student’s faculty advisor. Students have the option of pursuing a thesis (6 units of MAE 698) or a comprehensive exam (1 unit of MAE 697 and a 3-unit MAE elective). The MSME program is designed to develop a professional engineer with advanced abilities to solve complex problems in mechanical engineering. Emphasis is placed on the development of independent judgment, a creative approach to engineering problems, and the utilization of modern and advanced computational methods.",
        "program website url": "https://www.csulb.edu/college-of-engineering/mae/master-of-science-in-mechanical-engineering",
        "Accreditation status": null,
        "Program name": "Master of Science in Mechanical Engineering",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Art History",
        "description": "The Master of Arts degree program in Art with an option in Art History prepares students for careers in art history and for further study at the doctoral level. Graduate students in the Art History program work closely with a faculty of specialists who hold Ph.D.s in a wide range of fields, including contemporary art, modern art, early modern art, medieval art, Roman art, and the arts of Asia. The M.A. program curriculum is designed to provide a strong foundation in art historical method and research practices as well as flexibility in the choice of specialized topics. Students in the program take a series of seminars on critical theory and methodology and pursue their own specialized research interests in a series of further seminars and independent study courses, culminating in a Master’s Thesis on a topic of their choice. Many of our students present their research at professional conferences and in scholarly publications, and have gone on to doctoral study at R1 research universities, as well as to careers in museums, galleries, and other arts institutions and businesses. The Art History program is part of the CSULB School of Art, which is the largest and one of the most comprehensive public university art schools in the United States.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/art/art-ma-option-in-art-history",
        "Accreditation status": "The School of Art at California State University, Long Beach is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Program name": "Master of Arts in Art with option in Art History",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Art Education",
        "description": "The Master of Arts in Art with an option in Art Education is designed to serve the needs of a variety of professionals including elementary and secondary school art teachers, community college instructors, museum educators, and arts administrators. This advanced degree program provides students with opportunities to extend their professional knowledge of theory and practice. The curriculum requires candidates to conduct scholarly inquiry into the historical, philosophical, and theoretical foundations of art education.",
        "program website url": "https://www.csulb.edu/school-of-art/ma-art-option-art-education",
        "Accreditation status": "The School of Art is an accredited institutional member of the National Association of Schools of Art and Design (NASAD).",
        "Program name": "Master of Arts in Art with option in Art Education",
        "Program Page url": "https://www.csulb.edu/school-of-art/mfa-art-concentration-studio-art"
    },
    {
        "Concentration name": "Studio Art",
        "description": "The MFA in Art with a Concentration in Studio Art is a three-year program that prepares students to be professional artists. We are a research-focused program, which means students spend their time in the studio making work. The program supports the development of an individual practice in the context of a diverse community of artists. Our students gain expertise in their chosen media area, along with a broad understanding of contemporary art, theory, and professional practices. We emphasize the creative process as a form of research.",
        "program website url": "https://www.csulb.edu/school-of-art/mfa-art-concentration-studio-art",
        "Accreditation status": "The School of Art is accredited by the National Association of Schools of Art and Design (NASAD).",
        "Level": "MFA",
        "Program name": "Master of Fine Arts in International Studio Arts",
        "Program Page url": "https://www.csulb.edu/school-of-art/mfa-art-concentration-studio-art"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts degree in Dance is a 36-unit program that offers a broad, comprehensive and individualized course of study for students who hold a bachelor’s degree in dance, or its equivalent. The MA program prepares students for continued study in dance at the doctoral level, professional careers in dance education in the private sector or at the community college level, and/or related fields. The program is designed to develop students’ artistic and academic potential through advanced study in creative and scholarly work. MA students may complete their culminating experience with a written thesis or a creative project.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/dance/ma-in-dance",
        "Accreditation status": "The Department of Dance is an accredited institutional member of the National Association of Schools of Dance (NASD).",
        "Level": "MA",
        "Program name": "Master of Arts in Dance",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Fine Arts (MFA) in Dance is a 60-unit graduate program that develops students’ creative and scholarly potential. We are committed to fostering artistic and academic excellence while encouraging students to investigate the intersections of choreography, performance, and scholarly inquiry. The MFA program is designed to develop and refine each student's artistic voice, pedagogical approach, and scholarly research. Coursework provides students with a breadth of experiences including choreography, dance production, improvisation, performance, pedagogy, research methods, somatics, and technique. Faculty within the CSULB Department of Dance have a wide-range of expertise. Areas of specialization include: contemporary dance practices, choreography, cultural studies, dance and technology, dance history/theory, improvisation, pedagogy, Pilates, somatics, and various world dance forms. Graduate students work in a stimulating environment with dedicated faculty and a diverse student population. Our graduates are prepared to teach dance in higher education and to pursue their careers as performing and creative artists.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/dance/mfa-in-dance",
        "Accreditation status": "The Department of Dance is an accredited institutional member of the National Association of Schools of Dance (NASD).",
        "Level": "MFA",
        "Program name": "Master of Fine Arts in Dance",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Composition",
        "description": "The Master of Music (M.M.) degree is offered in seven options: Composition, Conducting (Choral, Instrumental-Wind, and Orchestral), Jazz Studies, Music Education, Opera Performance, Performance, and Piano Pedagogy. These options provide an opportunity for students to develop their creative and scholarly abilities and to gain a greater depth and breadth of knowledge and skills. The M.M. is designed to prepare students for a professional career in music and for further graduate study.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/bob-cole-conservatory-of-music/programs/master-of-music",
        "Accreditation status": "Accredited by the National Association of Schools of Music (NASM).",
        "Program name": "Master of Music with option in Composition",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Instrumental/Vocal Performance",
        "description": "The Master of Music degree is a professional degree for musicians who have attained a high level of skill in performance, conducting, composition, or scholarly inquiry. The Master of Music in Performance is designed for students who demonstrate the potential to achieve the highest levels of professional accomplishment in their field. Students work with our world-class faculty of performers and scholars and have numerous opportunities to perform as soloists and in a variety of large and small ensembles.",
        "program website url": "https://csulbmusic.shopwindow.io/content/render/crm_form/7af1d55c-e451-4919-9015-d7a22bf88d32?presentation=web",
        "Accreditation status": null,
        "Level": "Master of Music",
        "Program name": "Master of Music with option in Instrumental/Vocal Performance",
        "Program Page url": "https://csulbmusic.shopwindow.io/content/render/crm_form/7af1d55c-e451-4919-9015-d7a22bf88d32?presentation=web"
    },
    {
        "Concentration name": "Conducting (Instrumental or Choral)",
        "description": "The Master of Music is a professional degree for students with a high level of specialization in one of the nine available options. Its objective is to develop in its students a mature and professional concept of music as a creative art and to provide the opportunity for them to develop a high level of competence and artistry in performance, conducting, composition, or music history; to provide them with the background necessary for study at the doctoral level; and to provide the necessary experience and qualifications for careers in music.",
        "program website url": "https://www.csulb.edu/academic-catalog/course-catalog/master-of-music",
        "Accreditation status": "The Bob Cole Conservatory of Music is a fully-accredited member of the National Association of Schools of Music (NASM).",
        "Level": "Master of Music",
        "Program name": "Master of Music with option in Instrumental/Choral Conducting",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Opera",
        "description": "The Master of Music degree is designed to provide professional training in specialized areas of music and to prepare students for a variety of careers in music, including teaching at the college level, professional performance and composition, or continuing on to doctoral study. The graduate program in vocal performance is designed to develop artistry, pedagogical skill, and scholarship in preparation for careers in performance and teaching. Applied study is complemented by courses in vocal pedagogy, diction, opera literature, song literature, and choral literature. The Opera Institute provides a wide range of training opportunities for graduate and undergraduate vocal performance majors. Each year, it presents two mainstage productions with orchestra, evenings of opera scenes, and a touring outreach production.",
        "program website url": "https://www.csulb.edu/academic-catalog/course-catalog/master-of-music",
        "Accreditation status": "The Bob Cole Conservatory of Music is an accredited institutional member of the National Association of Schools of Music (NASM).",
        "Level": "Master's",
        "Program name": "Master of Music with option in Opera",
        "Program Page url": "https://www.csulb.edu/college-of-the-arts"
    },
    {
        "Concentration name": "Jazz Studies",
        "description": "The Master of Music degree is a professional degree for the specialist in music. It is designed to provide students with the opportunity to develop their musical skills to the highest possible professional and artistic level and to acquire a sophisticated knowledge of the literature in their chosen field of specialization. The degree represents the attainment of a high level of musicianship as demonstrated by the ability to perform publicly or to produce musical works of high quality. It further attests to the acquisition of a broad knowledge of music theory, history, and literature. Options are offered in Composition, Conducting (Choral or Instrumental), Jazz Studies, Opera, Performance (Orchestral Instrument, Organ, Piano, or Voice), and Piano Pedagogy.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/bob-cole-conservatory-of-music/mm-in-music",
        "Accreditation status": "The Bob Cole Conservatory of Music is an accredited institutional member of the National Association of Schools of Music (NASM).",
        "Level": "Master's",
        "Program name": "Master of Music with option in Jazz Studies",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Master of Arts in Music Education",
        "Program Page url": "https://www.jammusiclab.com/academics/master-arts-music-education"
    },
    {
        "Concentration name": "Musicology",
        "description": "The Master of Arts in Music degree is offered with a choice of options in Musicology or Music Education. Graduate students in both options complete a rigorous course of study in music theory and music history and must demonstrate reading knowledge of a language other than English. The degree culminates in a thesis or curriculum project and is completed with a final oral examination.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/bob-cole-conservatory-of-music/ma-in-music",
        "Accreditation status": "The Bob Cole Conservatory of Music is a fully accredited member of the National Association of Schools of Music (NASM).",
        "Program name": "Master of Arts in Musicology",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Acting",
        "description": "The Master of Fine Arts (MFA) in Theatre Arts with an Option in Acting at California State University, Long Beach is a three-year, 60-unit, conservatory-style program focused on the development of the actor as a collaborative artist. The program’s mission is to rigorously train and educate students with a diversity of backgrounds and experiences to become professional actors, creative artists, and teachers of acting. The program is designed to discipline the actor’s instrument through the integration of voice, speech, and movement. Throughout their training, actors engage in a sequence of studio classes that foster the development of a unique, personal acting process that will form the basis of their continued growth as working artists. We encourage the application of classroom training to the creation of both new and established works. The program culminates with a public performance of a thesis role in a fully-mounted production. In their final semester, students produce a showcase of their work, which is presented in Los Angeles to an invited audience of industry professionals.",
        "program website url": "https://www.csulb.edu/college-of-the-arts/theatre-arts/acting-mfa",
        "Accreditation status": "The Department of Theatre Arts at CSULB is an accredited institutional member of the National Association of Schools of Theatre (NAST).",
        "Level": "MFA",
        "Program name": "Master of Fine Arts in Theatre Arts with option in Acting",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Theatre Management",
        "description": "The Department of Theatre Arts and the Graduate School of Business Administration jointly offer a three-year, 78-unit program leading to the concurrent Master of Fine Arts in Theatre Arts and the Master of Business Administration degrees. The program provides a unique opportunity for specialized training that prepares students for a variety of leadership positions in the dynamic and growing field of arts administration, particularly for management positions in not-for-profit and commercial regional theatres and performing arts centers. Applicants must apply to and be accepted by both the Department of Theatre Arts and the College of Business Administration. Two separate applications are required.",
        "program website url": "https://www.csulb.edu/theatre-arts/graduate-admissions-0",
        "Accreditation status": null,
        "Level": "MFA/MBA",
        "Program name": "Master of Fine Arts in Theatre Arts with option in Theatre Management (MFA/MBA)",
        "Program Page url": "https://www.csulb.edu/theatre-arts/graduate-admissions-0"
    },
    {
        "Concentration name": null,
        "description": "The Master of Arts degree in Japanese Language and Pedagogy is designed to provide students with a solid foundation in Japanese linguistics, and second language acquisition theory and practice, to prepare them for careers in Japanese language education at the secondary and post-secondary levels in the U.S. and other countries. The MA program provides students with opportunities to analyze and conduct research related to Japanese language pedagogy. Students interested in pursuing a doctoral degree in related fields can also gain strong preparation by completing this MA program.",
        "program website url": "https://cla.csulb.edu/departments/aaas/graduate-credential/",
        "Accreditation status": null,
        "Level": "Master of Arts",
        "Program name": "Master of Arts in Japanese Language & Pedagogy",
        "Program Page url": "https://cla.csulb.edu/departments/aaas/graduate-credential/"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Accountancy (MSA) is a 30-unit cohort program designed to provide students with the technical knowledge, communication skills, and critical thinking abilities for a successful career in public or corporate accounting. The program is specifically intended for students who have completed an undergraduate degree with a major in accounting from an AACSB-accredited university. The program is full-time, finishing in 10 months from August to May.",
        "program website url": "https://www.csulb.edu/college-of-business/accountancy/master-of-science-in-accountancy",
        "Accreditation status": "The College of Business and its Accountancy programs are AACSB-accredited.",
        "Program name": "Master of Science in Accountancy",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Finance (MSF) program at California State University, Long Beach (CSULB) provides a quantitative and comprehensive curriculum that offers in-depth exposure to the principles and practices of corporate finance, investments, and risk management. With its advanced curriculum, the program provides a unique combination of a strong foundation in finance principles and cutting-edge practical knowledge. Students gain hands-on experiences with financial databases (Bloomberg, Morningstar, etc.) and software (Crystal Ball, Python, etc.) from our world-class faculty. The program is specifically designed to prepare students for careers in the finance profession and for professional certifications, such as the Chartered Financial Analyst (CFA) and Certified Financial Planner (CFP) designations.",
        "program website url": "https://www.csulb.edu/college-of-business/finance/master-of-science-in-finance",
        "Accreditation status": "The College of Business is accredited by AACSB International - The Association to Advance Collegiate Schools of Business.",
        "Program name": "Master of Science in Finance",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Information Systems (MSIS) program is designed for students who want to become leaders at the intersection of information systems and management. The program’s mission is to educate business professionals to become leaders who can align information technology with business needs by applying best-practice management techniques and leveraging appropriate IT tools. The MSIS program integrates a core business curriculum with a set of courses that focus on key aspects of information systems. The coursework balances theoretical concepts and practical applications. The program is flexible to accommodate students with or without a technical background. The program has been classified as a STEM (Science, Technology, Engineering, and Mathematics) program. The STEM designation allows eligible graduates on student visas access to an Optional Practical Training (OPT) extension, helping them to stay and work in the U.S. for up to three years after graduation.",
        "program website url": "https://www.csulb.edu/college-of-business/information-systems/master-of-science-in-information-systems-msis",
        "Accreditation status": "The College of Business is accredited by AACSB International at both the undergraduate and graduate levels.",
        "Program name": "Master of Science in Information Systems",
        "Program Page url": "https://www.csulb.edu/college-of-business/information-systems"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Marketing Analytics (MSMA) is a one-year, 30-unit, cohort-based program that prepares students for marketing careers in our data-driven world. The MSMA is a STEM-designated program. This intensive program integrates marketing strategy, research, and data analytics to provide students with the advanced knowledge and skills necessary to succeed in a wide array of marketing careers. MSMA graduates will be able to: Analyze marketing data for strategic decision making; Understand and apply marketing research tools and techniques; Design, implement, and evaluate marketing strategies; Create effective data visualizations; Present and communicate complex information clearly and persuasively.",
        "program website url": "https://www.csulb.edu/college-of-business/master-of-science-in-marketing-analytics",
        "Accreditation status": "The College of Business, which offers this program, is accredited by the Association to Advance Collegiate Schools of Business (AACSB).",
        "Level": "Master of Science",
        "Program name": "Master of Science in Marketing Analytics",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": [
            "Finance",
            "Management & Human Resources Management",
            "Marketing"
        ],
        "description": "The Master of Business Administration (MBA) is a general management program that emphasizes a case-based, team-oriented, and hands-on learning approach. Students have the opportunity to participate in a variety of high-impact activities, such as case competitions, consulting projects with real clients, and a two-week international study trip. Graduates of our programs become transformational leaders, making a difference in the public and private sectors both locally and internationally.",
        "program website url": "https://www.csulb.edu/college-of-business/master-of-business-administration-mba",
        "Accreditation status": "The CSULB College of Business is an AACSB International accredited school, a recognition achieved by only one-third of business schools in the U.S. and 15% worldwide.",
        "Level": "MBA",
        "Program name": "Master of Business Administration (MBA)",
        "Program Page url": "https://business.fsu.edu/graduate"
    },
    {
        "Concentration name": "Finance, Human Resources Management, Management Information Systems, Marketing",
        "description": "The Day/Time MBA is a 48-unit lock-step program designed to be completed in 21 months. It is the only MBA program at CSULB that is open to all majors including those without any business background. Students are admitted as a cohort and take all classes together, fostering a collaborative environment, team spirit, and a strong network. Students may choose one of four areas of specialization: Finance, Human Resources Management, Management Information Systems, or Marketing. GMAT/GRE may be waived. Please visit our GMAT/GRE Waiver Policy page for more details.",
        "program website url": "https://www.csulb.edu/cob-graduate-programs/mba-programs/day-time-mba",
        "Accreditation status": "The College of Business is accredited by the Association to Advance Collegiate Schools of Business (AACSB) at both the undergraduate and graduate levels.",
        "Program name": "Master of Business Administration (MBA) Accelerated",
        "Program Page url": "https://www.csulb.edu/cob-graduate-programs/mba-programs/day-time-mba"
    },
    {
        "Concentration name": "Finance, Global Logistics & Supply Chain Management, Human Resources Management, Information Systems, Management, Marketing",
        "description": "The Evening MBA Program is designed for working professionals who wish to pursue a graduate business degree on a part-time basis. Classes are offered Monday through Thursday evenings. The program provides an integrated perspective of business, with an emphasis on the global and technological environment. Coursework encompasses all business functions, including accounting, finance, human resources, information systems, law, management, marketing, and operations. The Evening MBA is a 48-unit program.",
        "program website url": "https://www.csulb.edu/college-of-business/evening-mba",
        "Accreditation status": "The College of Business is one of a select number of institutions to have earned dual accreditation from the Association to Advance Collegiate Schools of Business (AACSB) for both its Business and Accounting programs.",
        "Level": "MBA",
        "Program name": "Master of Business Administration (MBA) Evening",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Online MBA program at CSULB is a 2-year cohort program that admits for the Fall semester only. The curriculum is specifically designed for working professionals to enhance their career opportunities. It is delivered in a fully online format and is an accelerated program with a structured schedule.",
        "program website url": "https://www.csulb.edu/college-of-business/online-mba",
        "Accreditation status": "The College of Business is accredited by the Association to Advance Collegiate Schools of Business (AACSB) at both the undergraduate and graduate levels.",
        "Level": "MBA",
        "Program name": "Master of Business Administration (MBA) Online",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": [
            "Adult-Gerontology Acute Care Nurse Practitioner (AGACNP)",
            "Adult-Gerontology Primary Care Nurse Practitioner (AGPCNP)",
            "Family Nurse Practitioner (FNP)",
            "Pediatric Primary Care Nurse Practitioner (PNP)",
            "Psychiatric-Mental Health Nurse Practitioner (PMHNP)",
            "Nurse Educator (NE)",
            "Nursing and Health Systems Executive Management (NHEM)"
        ],
        "description": "The Master of Science degree in Nursing is designed to prepare advanced practice nurses to function in a variety of health care settings. The curriculum is designed to provide a foundation for doctoral study. The graduate will be able to: Utilize theory and research in a specialized area of advanced nursing practice and in the analysis of health care issues; Demonstrate competence in a specialized role of advanced nursing practice; Participate in the planning, implementation, and evaluation of health care; Identify and analyze health care issues for the purpose of initiating and promoting change; Collaborate with other health care professionals and consumers in the planning and delivery of health care; Identify and pursue nursing research problems and utilize research findings; Promote the nursing profession through professional and community activities; Assume a leadership role in nursing and health care; Demonstrate a commitment to life-long learning to maintain competence in advanced nursing practice.",
        "program website url": "https://www.csulb.edu/college-of-health-human-services/school-of-nursing/msn-program-overview",
        "Accreditation status": "The baccalaureate degree program in nursing, master's degree program in nursing, and Doctor of Nursing Practice program at California State University Long Beach are accredited by the Commission on Collegiate Nursing Education, 655 K Street NW, Suite 750, Washington, DC 20001, 202-887-6791.",
        "Program name": "Master of Science in Nursing",
        "Program Page url": "https://www.csulb.edu/college-of-health-human-services/graduate-programs"
    },
    {
        "Concentration name": [
            "Aerospace Engineering",
            "Mechanical Engineering",
            "Civil Engineering"
        ],
        "description": "The Doctor of Philosophy (Ph.D.) in Engineering and Computational Mathematics is an interdisciplinary program jointly offered by the College of Engineering (COE) and the College of Natural Sciences and Mathematics (CNSM). This is an innovative, research-oriented doctoral program whose primary purpose is to educate the next generation of engineers, scientists, and mathematicians to use high-performance computing to solve complex, large-scale, and interdisciplinary problems of interest to society. Students graduating from this program will possess the advanced computational and mathematical skills needed to develop innovative solutions for aerospace, civil, and mechanical engineering systems, as well as in other related science and engineering fields. The Ph.D. in Engineering and Computational Mathematics is designed as a full-time program. The doctoral degree is awarded in recognition of a student’s demonstrated ability to make a significant and original contribution to research in engineering or applied science. Students will be required to develop a solid foundation in their chosen engineering discipline and mathematics, to pass a series of examinations, and to conduct a significant and original research investigation. The outcome of the research is to be presented in a written dissertation and defended in a final oral examination. Graduates of the program will be well prepared for a career in academia or industry.",
        "program website url": "https://www.csulb.edu/college-of-engineering/engineering-doctoral-studies",
        "Accreditation status": null,
        "Level": "Doctoral",
        "Program name": "Doctor of Philosophy in Engineering and Computational Mathematics",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/engineering-doctoral-studies"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Doctorate in Educational Leadership",
        "Program Page url": "https://www.baypath.edu/academics/graduate-programs/educational-leadership-edd/"
    },
    {
        "Concentration name": "Pre-K-12 Educational Leadership, Community College/Higher Education Leadership, Social and Cultural Analysis of Education (SCAE)",
        "description": "The Doctor of Education in Educational Leadership is a 60-unit program that is dedicated to developing the next generation of Pre-K-12 school, community college, and higher education administrators. The program is specifically designed to meet the needs of working professionals. All classes are offered in the evenings during the fall, spring, and summer semesters. The program of study is designed for students to complete their coursework in two years and the dissertation within three years. The Educational Leadership Ed.D. Program is a cohort-based program. Students are admitted each fall and progress through the program in a learning community. Students will engage in an applied dissertation of practice to address a current, relevant problem within their educational organizations.",
        "program website url": "https://www.csulb.edu/college-of-education/doctor-education-educational-leadership-edd",
        "Accreditation status": null,
        "Program name": "Doctorate in Educational Administration",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": "Community College/Higher Education Leadership Option",
        "description": "The Educational Leadership doctoral program at California State University, Long Beach is designed to prepare transformative leaders for the complex challenges and opportunities in P-12 schools and districts and in community colleges and higher education institutions.\n\nThe three-year, 60-unit program provides a unique opportunity for a cohort of students from P-12 and post-secondary education organizations to learn and work together on issues of mutual interest. The curriculum has a strong focus on social justice and equity, leadership, evidence-based decision making, and effective management of fiscal and human resources.\n\nStudents complete the program within a cohort model of approximately 20-25 students. Classes meet face-to-face on Saturdays, and online activities are also required. Two 8-week courses are taken each semester (fall, spring and summer) during the first two years of the program. During the third year, students focus on their dissertation research. Courses are taught by full-time faculty in the College of Education, and by experienced administrator-scholars.",
        "program website url": "https://www.csulb.edu/college-of-education/educational-doctorate-educational-leadership",
        "Accreditation status": null,
        "Program name": "Doctorate in Higher Education Administration",
        "Program Page url": "https://www.csulb.edu/college-of-education/educational-doctorate-educational-leadership"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Advanced Paralegal is a 30-unit program that provides students with a comprehensive education in practical paralegal skills. Students receive instruction in the latest computer technology including online legal research. Substantive law courses are taught by members of the judiciary and practicing attorneys. The program is designed to meet the needs of working adults. All courses are held on Saturdays at the CSULB campus. Courses are completed in a prescribed sequence during a 14-month period. For more information, visit the Certificate in Advanced Paralegal website.",
        "program website url": "https://www.csulb.edu/program/advanced-paralegal-certificate",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Advanced Paralegal",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Agile Project Management is designed for project managers, product owners, Scrum masters, and other professionals who seek to deliver business value through the adoption of Agile methodologies. Participants will gain the knowledge and skills needed to effectively lead Agile teams, manage Agile projects, and support organizational change toward a more flexible and adaptive approach.\n\nIn this program, you will gain an understanding of the concepts and techniques of Agile as an approach to project management. You will discover the different approaches within Agile, focusing on the ones that are most popular, like Scrum, Kanban, Lean, and extreme programming (XP). You will also gain an understanding of how to lead and motivate Agile teams by gaining insights into self-organization, team empowerment, and servant leadership.",
        "program website url": "https://www.cpace.csulb.edu/courses/certificate-in-agile-project-management",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Agile Project Management",
        "Program Page url": "https://www.cpace.csulb.edu/courses/certificate-programs"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Applied Analytics and Machine Learning for Higher Education provides higher education professionals, institutional researchers and other professionals with advanced training in data analytics and machine learning. This program equips students with the knowledge and skills needed to understand and implement machine learning algorithms and computational techniques to solve a variety of problems in institutional research, strategic planning, and enrollment management.",
        "program website url": "https://www.csulb.edu/college-of-education/certificate-in-applied-analytics-and-machine-learning-for-higher-education",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Applied Analytics and Machine Learning for Higher Education",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "The Certified Nursing Assistant (CNA) program at CSULB is an intensive 18-day program that prepares students to provide basic nursing care in a variety of healthcare settings. This non-credit program is an excellent starting point for those interested in pursuing a career in nursing or other healthcare fields.\n\nStudents will receive 72 hours of classroom instruction and 128 hours of clinical experience, which provides hands-on training in a skilled nursing facility. The curriculum includes training in patient rights, communication, safety, observation, reporting, and assisting residents with daily living activities. Students will also learn how to take and record vital signs, as well as how to provide personal care such as bathing, dressing, and feeding.\n\nUpon completion of the program, students will be eligible to take the California Nurse Assistant Competency Examination to become a Certified Nursing Assistant (CNA). This program fulfills the requirements of the California Department of Public Health for CNA training. Please note that employment as a CNA requires a criminal background check.",
        "program website url": "https://www.cpace.csulb.edu/courses/certified-nursing-assistant",
        "Accreditation status": "This program fulfills the requirements of the California Department of Public Health for CNA training.",
        "Level": "Certificate",
        "Program name": "Certificate in Certified Nursing Assistant (CNA)",
        "Program Page url": "https://www.cpace.csulb.edu/courses/certified-nursing-assistant"
    },
    {
        "Concentration name": null,
        "description": "The Clinical Medical Assistant program at CSULB is one of the premier medical assistant programs in Southern California. Offered in partnership with nationally recognized Condensed Curriculum International (CCI), this course will prepare you to work as a professional in multiple healthcare settings. Medical assistants with a clinical background can perform various clinical tasks including assisting with the administration of medications, minor procedures, performing an EKG, obtaining laboratory specimens for testing, educating patients, and other related tasks. This program also includes an optional clinical externship at a local healthcare provider, which will provide you with 160 hours of hands-on experience.",
        "program website url": "https://www.cpie.csulb.edu/courses/certificate-programs/clinical-medical-assistant",
        "Accreditation status": null,
        "Program name": "Certificate in Clinical Medical Assistant",
        "Program Page url": "https://www.youtube.com/watch?v=Uki3jDXHaXk"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Collections Management for Costume and Textiles is designed to provide students with the knowledge and practical experience necessary to manage, preserve, and interpret costume and textile collections. The certificate is a valuable asset to those interested in working in museums, historical societies, and other cultural institutions with costume and textile collections. It is also beneficial to those who wish to work as private collection managers or consultants. The curriculum combines the theoretical and practical aspects of collection management.",
        "program website url": "https://www.csulb.edu/program/certificate-collections-management-costume-and-textiles",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Collections Management for Costume and Textiles",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    },
    {
        "Concentration name": null,
        "description": "Crime analysis is a law enforcement function that involves systematic analysis for identifying and analyzing patterns and trends in crime and disorder. Information on patterns can help law enforcement agencies deploy resources in a more effective manner, and assist detectives in identifying and apprehending suspects. Crime analysis also plays a role in devising solutions to crime problems, and developing crime prevention strategies. The Certificate in Crime and Intelligence Analysis is a two-semester program designed to provide a comprehensive introduction to the theory and practice of crime and intelligence analysis. The program is taught by faculty who are specialists in crime analysis, as well as experienced practitioners in the field.",
        "program website url": "https://www.cpie.csulb.edu/courses/crime-and-intelligence-analysis-certificate-program",
        "Accreditation status": null,
        "Program name": "Certificate in Crime and Intelligence Analysis Program",
        "Program Page url": "https://www.youtube.com/watch?v=RVl81T6x11M"
    },
    {
        "Concentration name": null,
        "description": "As the digital world continues to expand and grow, it is becoming increasingly important for companies to meet consumers where they are. In this program, you will develop the digital marketing skills needed for a variety of roles in the industry. Learn how to create and implement an effective digital marketing strategy, leveraging social media platforms, SEO tactics, and digital advertising. Discover how to track campaign results through web and social media analytics in order to calculate ROI and drive business growth. This program is offered in partnership with GreenFig, a leading industry-driven education company. No previous experience is required to enroll.",
        "program website url": "https://www.cpace.csulb.edu/courses/digital-marketing-certificate",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Digital Marketing",
        "Program Page url": "https://www.cpace.csulb.edu/"
    },
    {
        "Concentration name": null,
        "description": "The Certificate in Geographic Information Science (GIScience) is a 16-unit program for individuals who wish to acquire GIScience knowledge and skills for their profession. The certificate is especially useful for individuals with a degree in Geography or a related field (e.g. Environmental Science and Policy, Geology, Anthropology, Engineering, Urban Planning, etc.) who are returning to the university for specialized training in GIScience. The program offers a solid theoretical background in GIScience as well as advanced technical skills that are attractive to employers in both the public and private sectors. The certificate is offered completely face-to-face, so that we can offer students hands-on mentoring opportunities.",
        "program website url": "https://www.csulb.edu/college-of-liberal-arts/geography/certificate-in-geographic-information-science",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Geographic Information Science",
        "Program Page url": "https://www.csulb.edu/graduate-studies"
    }
]