[
    {
        "Concentration name": [
            "Aviation/Aerospace Education Technology",
            "Aviation/Aerospace Management",
            "Aviation Safety Management Systems",
            "Air Traffic Management",
            "Space Studies",
            "Unmanned Aircraft Systems",
            "Aviation/Aerospace Operations"
        ],
        "description": "The Master of Science in Aeronautics (MSA) is Embry-Riddle's flagship graduate program, offering a technical, professional-oriented, and broad-based aviation/aerospace education. The MSA degree is for students who want to advance their current knowledge and experience in the aviation/aerospace industry, as well as for those who are seeking to transition into the field.\n\nThe Master of Science in Aeronautics degree program builds on Embry-Riddle’s strong aviation foundation, providing students with a deep understanding of aviation and aerospace operations, safety, security, and regulations. It is a professionally oriented program designed to meet the demands of the modern aerospace industry.\n\nStudents will gain a broad perspective on all facets of aeronautics, including air transportation, aircraft systems, human factors, maintenance management, aviation safety, and more.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Aeronautics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Aviation and Aerospace Sustainability",
        "description": "The Master of Science in Aeronautics (MSA) degree is a broad, yet deep program designed to provide aviation and aerospace professionals with a keen understanding of aviation and aerospace operations, safety, security, systems, quality and management. Offered by the College of Aeronautics, the MSA is a completely online degree that allows students the flexibility to work on their studies anytime, anywhere in the world.\n\nThe curriculum provides a strong, technical foundation for those looking to advance their career. Graduates are prepared for leadership and management roles in all segments of aviation and aerospace, including airlines, airports, corporate aviation, government, and the U.S. military. The MSA has been a flagship, online program for Embry-Riddle since 1993 and is the academic pillar of our Worldwide Campus.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": "The Master of Science in Aeronautics is accredited by the Aviation Accreditation Board International (AABI).",
        "Level": "Master's",
        "Program name": "Master of Science in Aeronautics with Specialization in Aviation and Aerospace Sustainability",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Small Unmanned Aircraft Systems (sUAS) Operation",
        "description": "The Master of Science in Aeronautics (MSA) degree gives students a technical look into the aviation and aerospace industry. Students gain the specific knowledge and skills needed to elevate their careers, whether that’s in flight, maintenance, safety, education or another related field.\n\nThis graduate program is designed for aviation professionals looking to advance their knowledge and for students who have a bachelor’s degree but wish to transition into the aviation industry. Graduates of the M.S. in Aeronautics program are set up for a competitive advantage to advance their careers.\n\nWithin the Small Unmanned Aircraft Systems (sUAS) Operation specialization, students will learn about topics critical to the sUAS operation industry including sUAS design, control and navigation, applications, data collection and processing as well as safety and human factors.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Aeronautics with Specialization in Small Uncrewed Aircraft Systems (sUAS) Operations",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Uncrewed and Autonomous Systems",
        "description": "The Master of Science in Aeronautics (MSA) is a multi-disciplinary program that combines a core of aviation and aerospace courses with a choice of specialization options, enabling you to tailor a degree program that elevates your career. The MSA program is an online program that offers both convenience and quality and has been ranked as one of the best online graduate programs for the past seven years by U.S. News & World Report. Build on your aviation/aerospace foundation as you work toward a career in management with a degree that strategically positions you for growth. The program is ideal for professionals already in an aviation/aerospace career and for those who wish to enter the field. As an MSA graduate, you will have the skills necessary to succeed as a leader in today’s demanding aviation/aerospace industry. The Uncrewed and Autonomous Systems specialization focuses on the operational and safety aspects of uncrewed and autonomous systems, including design, development, policy, and procedures. Explore topics related to uncrewed and autonomous systems, such as command and control, human factors, data links, and payloads.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": null,
        "Program name": "Master of Science in Aeronautics with Specialization in Uncrewed and Autonomous Systems",
        "Program Page url": "https://erau.edu/degrees/master/aeronautics"
    },
    {
        "Concentration name": "Space Operations",
        "description": "The Master of Science in Aeronautics (MSA) has a justly-earned reputation as a broad, technically-oriented professional degree program that has consistently attracted people already established, or seeking to establish, a career in aviation or aerospace. The degree prepares graduates for high-level, leadership positions in government and industry.\n\nThe MSA degree is a 30-credit-hour graduate program, offered fully online and at many of our Worldwide Campus locations, that students typically complete in two years. Students are required to take five core courses that cover core aspects of aeronautics, and then select five additional courses from one of several specializations.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Aeronautics with Specialization in Space Operations",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Aviation Safety",
        "description": "The Master of Science in Aeronautics (MSA) degree is a broad-based, flexible program designed for the aviation and aerospace professional. The MSA enhances your knowledge and pursuit of opportunity within the industry, covering topics from airport operations to aircraft design and beyond. In this program, students will gain an advanced understanding of aeronautics and the skills required to be a leader in the aviation industry. Our Aviation Safety specialization provides students with the technical skills required in the areas of accident investigation, safety management and human factors in aviation.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Aeronautics with Specialization in Aviation Safety",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Human Factors",
        "description": "The MSA Human Factors specialization is a multidisciplinary program that applies knowledge of human performance, limitations, and capabilities to the design of systems. The curriculum offers a broad education in the human factors discipline focusing on the human component in the design, development and operation of complex human-machine systems. The program provides graduates with the knowledge and skills necessary to be successful human factors professionals. Graduates are prepared for doctoral level studies in human factors or for a career as a human factors practitioner in government or industry. Program graduates will be qualified for positions in the military, civil and general aviation sectors of the aviation industry as well as other areas such as medical, automotive and nuclear fields.",
        "program website url": null,
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Aeronautics with Specialization in Human Factors",
        "Program Page url": "https://commons.erau.edu/cgi/viewcontent.cgi?article=1011&context=db-sgs-newletter"
    },
    {
        "Concentration name": "Aviation Maintenance",
        "description": "A leader in aviation education, Embry-Riddle's Master of Science in Aeronautics offers an opportunity for students to not only obtain an advanced, competitive edge in the field, but also to choose a specialization that is tailored to their unique interests and career goals. Students in the Aeronautics master's degree program learn in a dynamic, high-tech environment from faculty who are experts in their fields. Embry-Riddle's alumni network and industry partnerships are a valuable resource for students to leverage when seeking mentorship and career advancement opportunities. The Master of Science in Aeronautics is a broad, flexible program that provides students with a solid technical foundation in aeronautics and the ability to customize their curriculum in one of our diverse areas of specialization.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Aeronautics with Specialization in Aviation Maintenance",
        "Program Page url": "https://erau.edu/degrees/master/aeronautics"
    },
    {
        "Concentration name": "Aviation Cybersecurity",
        "description": "The Master of Science in Aeronautics (MSA) degree is a broad, flexible program that allows you to customize your coursework in an area of specialization. With the MSA, you can combine your existing technical expertise with an advanced aeronautics curriculum to prepare for an aviation/aerospace career in fields such as airline management, aviation safety, education, or airport management. The MSA curriculum is built upon a required core of 3 courses: Air Transportation, Aircraft and Spacecraft Development, and Aeronautical Research. These courses prepare students to investigate and solve problems currently facing the aviation and aerospace industries. MSA students then work with their advisors to customize a curriculum that matches their interests and career goals by choosing from a wide variety of electives and an area of specialization.",
        "program website url": "https://erau.edu/degrees/master/aeronautics",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Aeronautics with Specialization in Aviation Cybersecurity",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Aerospace Business Analytics degree from Embry-Riddle provides the analytical skills and business acumen necessary to expertly analyze and communicate critical business data to key decision-makers.\n\nStudents will develop their quantitative and analytical skills by blending business classes in areas such as finance, economics and statistics with aviation-related courses in subjects such as air transportation management and airline economics.\n\nEmbry-Riddle’s unique program emphasizes application over theory by combining the study of aerospace business with data analytics. Students will learn how to approach, analyze and communicate information in order to develop better business practices and results.\n\nAvailable at Embry-Riddle’s Daytona Beach Campus, this degree is ideal for those who want to use their data and analytical skills to work in the aerospace and aviation sectors. The curriculum is focused on producing expert analysts who possess the creative thinking and problem-solving skills needed to succeed in business.",
        "program website url": "https://erau.edu/degrees/master/aerospace-business-analytics",
        "Accreditation status": "The Master of Science in Aerospace Business Analytics is accredited by the Association of Collegiate Business Schools and Programs (ACBSP).",
        "Level": "Master's",
        "Program name": "Master of Science in Aerospace Business Analytics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": [
            "Aerodynamics and Propulsion",
            "Structural Mechanics and Materials",
            "Guidance, Navigation, and Control"
        ],
        "description": "The Master of Science in Aerospace Engineering program at Embry-Riddle prepares graduates for success in the field of aerospace engineering. The curriculum provides an enhanced understanding and expertise in the disciplines of Aerodynamics & Propulsion, Dynamics & Control, and Structures & Materials. Graduates are ready for careers in design, development, and testing of aerospace vehicles and systems, as well as for doctoral study. The M.S.A.E. program is offered at both the Daytona Beach and Prescott campuses. While the curriculum is identical, each campus offers unique research opportunities and faculty expertise.",
        "program website url": "https://erau.edu/degrees/master/aerospace-engineering",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Aerospace Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Master of Science in Aerospace Engineering with Concentration in Aerodynamics, Propulsion, Computational Aero and Fluid Dynamics, Transition and Turbulence, Aeroacoustics, Heat Transfer, and Combustion",
        "Program Page url": "https://pe.gatech.edu/degrees/aerospace-engineering"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Master of Science in Aerospace Engineering with Concentration in Dynamics and Control",
        "Program Page url": "https://www.csulb.edu/college-of-engineering/master-of-science-aerospace-engineering"
    },
    {
        "Concentration name": "Structures and Materials",
        "description": "The Master of Science in Aerospace Engineering (M.S.A.E.) degree gives students the opportunity to enhance their skills in the design, development, and testing of aircraft and spacecraft. Students at Embry-Riddle Aeronautical University are able to specialize their degree, preparing them for the demands of the ever-evolving aerospace and aviation industry. The M.S.A.E. degree is housed in the Department of Aerospace Engineering in the College of Engineering. Students will have the opportunity to specialize their studies in one of three areas: Aerodynamics and Propulsion, Dynamics and Control, or Structures and Materials. This specialized degree program allows students to build on their engineering skills and become a more valuable asset in their field.",
        "program website url": "https://erau.edu/degrees/master/aerospace-engineering?campus=daytona-beach",
        "Accreditation status": null,
        "Level": "Master of Science",
        "Program name": "Master of Science in Aerospace Engineering with Concentration in Structures and Materials",
        "Program Page url": "https://daytonabeach.erau.edu/-/media/files/daytona-beach/college-of-engineering/aerospace-engineering/032818-coe-newsletter-final-electronic.pdf"
    },
    {
        "Concentration name": null,
        "description": null,
        "program website url": null,
        "Accreditation status": null,
        "Level": null,
        "Program name": "Master of Science in Airline Management",
        "Program Page url": "https://research.com/advice/is-an-aviation-management-online-degree-worth-it"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Airport and Air Mobility Management is designed to equip students with the skills and knowledge necessary to successfully lead, manage and operate airports and related businesses in the 21st century. The program curriculum includes a core component that integrates foundational business and aviation principles with a strong focus on airport operations, planning and management. Students will learn the interrelationships of the various components of the airport environment and its associated air mobility ecosystem. Students will also be exposed to strategic issues impacting the industry. These topics include accommodating new entrants, enhancing passenger experience, ensuring safety and security, and increasing efficiency and revenue generation, while maintaining a commitment to social and environmental responsibility.",
        "program website url": "https://erau.edu/degrees/master/airport-air-mobility-management",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Airport and Air Mobility Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Airworthiness Engineering (MSAE) degree is for students who want to design and certify new aircraft. This degree provides a solid foundation of engineering knowledge and skills necessary for a successful career in the airworthiness engineering field.\n\nWith a curriculum that focuses on the practical application of engineering, the program equips students with the knowledge needed for the design, development and certification of safe aircraft. Students will also gain an understanding of airworthiness engineering processes and the regulations that govern the aircraft industry.\n\nStudents who already have a degree in aerospace, mechanical or another related engineering field and are interested in the design, development and certification of aircraft will benefit from this unique program.\n\nThe MSAE program is housed in the Department of Aerospace Engineering in the College of Engineering. It’s a 30-credit-hour program that includes an option for a thesis or a non-thesis track.",
        "program website url": "https://erau.edu/degrees/master/airworthiness-engineering",
        "Accreditation status": null,
        "Level": "Master",
        "Program name": "Master of Science in Airworthiness Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": [
            "Aviation Management",
            "Aviation Safety Management Systems",
            "Unmanned Aircraft Systems",
            "Space Operations",
            "Aviation/Aerospace Sustainability",
            "Air Traffic Management",
            "Aviation/Aerospace Operations"
        ],
        "description": "The Master of Science in Aviation (MSA) degree provides students with a technical and specialized professional education about aviation. Students gain an in-depth, comprehensive and commanding knowledge of aviation and are prepared for a variety of leadership roles in the industry. The program is best suited for students who want to advance their knowledge and career in aviation, but it is also suitable for professionals in other fields looking for a transition into aviation. Students in the program explore all facets of the aerospace industry, including air traffic management, airport design and development, airline operations, aviation safety and security, and aircraft maintenance management. The curriculum also delves into the legal, regulatory, and labor aspects of the industry, as well as environmental issues and challenges. This comprehensive approach provides graduates with the knowledge and skills needed to succeed in various aviation roles, such as airline manager, airport manager, air traffic controller, aviation safety inspector, and aviation consultant. With an MSA degree from Embry-Riddle, graduates are well-equipped to advance their careers and make a significant impact in the aviation industry.",
        "program website url": "https://erau.edu/degrees/master/aviation",
        "Accreditation status": "The Master of Science in Aviation is accredited by the Aviation Accreditation Board International (AABI).",
        "Level": "Master",
        "Program name": "Master of Science in Aviation",
        "Program Page url": "https://erau.edu/degrees/master/aviation"
    },
    {
        "Concentration name": null,
        "description": "The Master of Business Administration in Aviation Management (MBA-AM) degree from Embry-Riddle Aeronautical University provides a strong foundation for success in any facet of the global aviation business world. The MBA-AM degree provides a traditional business skill set but has a unique focus on aviation and aerospace industries. Students with a technical background get the business acumen they need to become managers and executives while those with a business background learn the ins-and-outs of the highly specialized aviation industry. The MBA-AM degree is offered completely online, allowing you to tailor your education to your schedule. Many faculty members have years of experience working in the aviation industry, and class sizes are small so you'll receive the individual attention you deserve. The MBA-AM degree has a wide variety of career opportunities, and we have the tools to help you reach your goals.",
        "program website url": "https://erau.edu/degrees/master/business-administration-aviation-management",
        "Accreditation status": "This program is accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Program name": "Master of Business Administration in Aviation Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": [
            "Cybersecurity Engineering",
            "Data Science"
        ],
        "description": "The Master of Science in Computer Science (MSCS) is a 30-credit-hour program that provides students with strong foundations and professionally oriented and advanced technical skills in computer science. The program is specifically designed to enable students to pursue leadership positions in computer science in the business, industrial, governmental and educational sectors. Students will not only be engaged in theoretical studies, but they will gain hands-on experience by applying those studies to real-world projects. The Computer Science master's degree program is housed in the Department of Electrical Engineering and Computer Science in the College of Engineering.",
        "program website url": "https://erau.edu/degrees/master/computer-science",
        "Accreditation status": null,
        "Level": "Masters",
        "Program name": "Master of Science in Computer Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Aviation & Aerospace, Business Analytics, Cybersecurity",
        "description": "The Master of Science in Data Science degree at Embry-Riddle prepares its students for careers that apply data analysis, visualization, and machine learning to solve real-world problems. The program is inherently interdisciplinary, focusing on the application of data science to business intelligence, aviation, and aerospace.\n\nThe curriculum combines a core of data science theory and methods with three specializations for students to explore their interests: Aviation & Aerospace, Business Analytics, and Cybersecurity.\n\nStudents will use modern techniques and tools in programming, statistics, machine learning, and data management to store, process, analyze, manage, and visualize big data. They will also build the skills to communicate the results of their analyses to a broad audience.",
        "program website url": "https://erau.edu/degrees/master/data-science",
        "Accreditation status": null,
        "Program name": "Master of Science in Data Science",
        "Program Page url": "https://www.youtube.com/watch?v=dCJX6HUn-IY"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Engineering Management degree is designed for experienced professionals from a variety of engineering disciplines who want to advance into management roles. Today’s engineering managers need to possess both technical expertise and business acumen to successfully lead teams and projects, and the curriculum is specifically designed to meet this demand. Students will acquire specialized skills in finance, marketing, human resources, and project management in combination with systems engineering, quality control, and supply chain management. Graduates will be equipped to manage technical teams, complex projects, and global operations in a variety of industries, including aerospace, manufacturing, and technology.",
        "program website url": "https://worldwide.erau.edu/degrees/master/engineering-management",
        "Accreditation status": "Embry-Riddle Aeronautical University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award degrees at the associate, baccalaureate, masters and doctorate levels.",
        "Program name": "Master of Science in Engineering Management",
        "Program Page url": "https://engineeringmanagement.org/programs/embry-riddle-aeronautical-university-worldwide-online-mem/"
    },
    {
        "Concentration name": [
            "Human Factors in Aviation",
            "Human Factors in Systems Engineering",
            "Human Factors in User Experience"
        ],
        "description": "The Master of Science in Human Factors is an online degree that focuses on optimizing human performance and safety through the design of systems, products and work environments.\n\nThe 30-credit-hour program builds on the foundations of human factors and allows students to explore areas related to their specific interests through one of three specializations.\n\nAt Embry-Riddle, students receive a world-class education from highly knowledgeable faculty who have decades of practical industry experience.\n\nThe curriculum focuses on both the theoretical and practical application of human factors and is designed for working professionals who want to advance their careers and leadership roles.\n\nThe program culminates in a human factors capstone project where students will work with faculty to research and solve a real-world problem.",
        "program website url": "https://erau.edu/degrees/master/human-factors",
        "Accreditation status": null,
        "Program name": "Master of Science in Human Factors",
        "Program Page url": "https://www.eaap.net/read/6104/erau-master-of-science-in-human.html"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Human Security & Resilience (MSHSR) is an online 30-credit-hour program that prepares graduates to analyze and respond to a wide array of man-made and natural threats to human security. The program provides students with an in-depth understanding of the major theories and practices in the fields of security and resilience. The core curriculum provides a solid foundation in the key areas of the discipline, to include: security policy and practice, hazard mitigation and resilience, research methods and analytical techniques. The MSHSR degree prepares students for careers in government, the private sector and non-governmental organizations with a focus on national and international security. Students will be well-positioned to pursue advanced doctoral studies in a wide array of fields, including security studies, international relations, political science, public policy and criminal justice. The M.S. in Human Security & Resilience degree program is part of ERAU’s Security and Emergency Services department in the College of Arts and Sciences.",
        "program website url": "https://erau.edu/degrees/master/human-security-resilience",
        "Accreditation status": null,
        "Program name": "Master of Science in Human Security and Resilience",
        "Program Page url": "https://www.youtube.com/watch?v=giXF02tKNLc"
    },
    {
        "Concentration name": "Engineering Management, Global Management, Leadership, Operations Management",
        "description": "The Master of Science in Management (MSM) degree program provides students with a quality, graduate-level learning experience that will equip them with the skills and abilities to manage and lead organizations effectively. The MSM program is a 30-credit-hour graduate degree program that focuses on management and leadership skills. Experienced managers and technical professionals from all disciplines will benefit from the program, as it has been designed to provide the necessary skills and knowledge for a leader in any technical-oriented business. The program equips graduates to oversee and manage diverse teams, projects and processes to reach organizational goals. Coursework within the program develops a student’s core competency and proficiency in the areas of accounting, finance, economics, human resources, marketing, business development, leadership and project management. Students will be able to customize their degree with a specialization in Engineering Management, Global Management, Leadership or Operations Management.",
        "program website url": "https://erau.edu/degrees/master/management",
        "Accreditation status": "The Master of Science in Management is accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Program name": "Master of Science in Management",
        "Program Page url": "https://www.mim-compass.com/universities/embry-riddle-aeronautical-university/master-of-science-in-management-online"
    },
    {
        "Concentration name": "High-Performance Vehicles, Robotics and Unmanned Autonomous Systems",
        "description": "With a Master of Science in Mechanical Engineering (MSME), students can either broaden their mechanical engineering education or focus on a specific area of interest. At Embry-Riddle, students are encouraged to innovate and explore a multitude of mechanical engineering fields, such as robotics, unmanned vehicles, space systems, energy, and biomedical systems. The MSME program is focused on advanced topics within mechanical engineering, and our state-of-the-art labs and facilities ensure students have access to the tools they need for in-depth research and development.\nThe MSME program is offered at both the Daytona Beach Campus and the Prescott Campus and is housed in the Department of Mechanical Engineering in the College of Engineering.\nStudents will learn from experienced faculty who share their expertise in fields such as:\nRobotics\nEnergy systems\nUnmanned autonomous systems\nHigh-performance vehicles\nAdvanced materials and manufacturing\nSpacecraft systems\nThe Daytona Beach Campus offers thesis and non-thesis options, with specializations available in High-Performance Vehicles and Robotics and Unmanned Autonomous Systems.\nThe Prescott Campus offers a thesis option only.\nThe program’s objective is to produce graduates who have in-depth knowledge of mechanical engineering and can creatively apply their knowledge to the synthesis, design and analysis of complex systems for aerospace and general engineering applications.",
        "program website url": "https://erau.edu/degrees/master/mechanical-engineering",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Mechanical Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Occupational Safety Management is for students with an undergraduate background in occupational safety or a related field. The 30-credit program is designed to provide students with the knowledge to establish and manage occupational safety programs within various professional environments, such as aviation, military and manufacturing. The degree program offers a unique experience to students by allowing them to work with the latest technologies while learning from faculty members who are industry experts and have firsthand knowledge of working in the field. Students will get hands-on experience and learn to apply their knowledge to solve critical industry challenges. Upon completing this program, graduates will have the necessary skills to effectively manage safety programs within the industry of their choice. This degree also provides a competitive edge for working professionals who are seeking advancement in their careers.",
        "program website url": "https://erau.edu/degrees/master/occupational-safety-management",
        "Accreditation status": "The Master of Science in Occupational Safety Management degree is accredited by the Aviation Accreditation Board International (AABI).",
        "Level": "Master's",
        "Program name": "Master of Science in Occupational Safety Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Space Operations (M.S.S.O.) is an exciting and unique program that provides students with a broad and deep understanding of the space environment, space systems and space operations. The program is designed for students who want to work in the military, government or commercial space sectors as space systems operators, managers, analysts, or policymakers. The M.S.S.O. program is a 30-credit-hour program that can be completed in as little as 18 months. The program is offered completely online, allowing for maximum flexibility for students who are working professionals or who are geographically dispersed.\n\nThe M.S.S.O. is tailored to both the military and civilian professional looking to master all aspects of space systems, from the policies and laws that govern their use to the technical understanding of how space systems are designed and operated. Students in the Space Operations degree program will learn about orbital mechanics, space environment, spacecraft systems, space operations, space policy and law, space systems management and space systems applications.\n\nThe program culminates in a capstone project that allows students to apply their knowledge and skills to a real-world space operations problem.",
        "program website url": "https://erau.edu/degrees/master/space-operations",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Space Operations",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Master of Science in Systems Engineering (MSSE) degree program at Embry-Riddle is focused on preparing students for an exciting career designing and managing complex engineering projects. The curriculum provides a strong foundation in systems engineering and management with a focus on meeting the needs of the industry.\n\nThe 30-credit-hour program provides a strong foundation and bridges multiple disciplines. Students will explore all aspects of systems, including requirements definition, system design and development, and systems verification and validation. Students will learn the tools and techniques to manage complex systems both from a technical and management perspective.\n\nEmbry-Riddle's Systems Engineering graduates are prepared to create and execute complex projects that require broad technical and management backgrounds. They have been hired by a wide range of companies, including Rockwell Collins, The Boeing Company, and The Federal Aviation Administration.",
        "program website url": "https://erau.edu/degrees/master/systems-engineering",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Systems Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Embry-Riddle Master of Science in Uncrewed Systems (MSUS) is a non-engineering degree that focuses on this emerging industry by addressing topics including policy, ethics, design, and management. This degree program prepares students for leadership and management positions that require industry expertise. Graduates of this program will be equipped with the knowledge and skills necessary to manage uncrewed systems programs over their life cycle, including their design and development, operation and management, and policy issues. The MSUS degree program is housed in the Department of Graduate Studies within the College of Aeronautics.",
        "program website url": "https://erau.edu/degrees/master/uncrewed-systems",
        "Accreditation status": null,
        "Level": "Master's",
        "Program name": "Master of Science in Uncrewed Systems",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": [
            "Aerodynamics and Propulsion",
            "Dynamics and Control",
            "Structures and Materials"
        ],
        "description": "The Doctor of Philosophy in Aerospace Engineering degree program at Embry-Riddle focuses on theoretical and practical training for those interested in performing and managing original and leading-edge research. The degree prepares graduates for careers in research and development in industry, academia and government. The curriculum is broad and flexible, emphasizing both theoretical studies and hands-on, practical applications. The program allows for a choice of three areas of specialization: Aerodynamics and Propulsion, Dynamics and Control, and Structures and Materials. These areas represent the major disciplines in aerospace engineering. The Ph.D. in Aerospace Engineering program at ERAU is housed in the Department of Aerospace Engineering in the College of Engineering. The Ph.D. degree has a strong research focus and is a key initiative to help elevate the university to a national level of prominence in engineering and research. The program also supports the university’s goal to build a strong graduate studies and research enterprise.",
        "program website url": "https://erau.edu/degrees/aerospace-engineering-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Aerospace Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": [
            "Aviation Safety and Human Factors",
            "Aviation Operations",
            "Interdisciplinary"
        ],
        "description": "The Ph.D. in Aviation program helps students with an established background in aviation prepare to become leading researchers and scholars who can make significant contributions to the field of aviation. This degree gives candidates the skills to solve current problems facing the aviation industry and the ability to define future needs. The program is designed to develop highly skilled researchers who have a broad knowledge of aviation and a deep theoretical understanding of a specific area of interest. Students may focus their studies on one of three specializations: Aviation Safety and Human Factors, Operations, or an Interdisciplinary specialization. In addition to rigorous, research-based coursework, students must complete a comprehensive examination and a dissertation showing mastery of a specific subject area. Upon graduation, Ph.D. in Aviation students are prepared for careers as university faculty, industry and government leaders, and senior researchers.",
        "program website url": "https://erau.edu/degrees/aviation-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Aviation",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Aviation Safety and Security",
        "description": "The Ph.D. in Aviation degree program at Embry-Riddle's Daytona Beach Campus provides students with a research-based curriculum within a diverse, intellectually versatile, and multi-disciplinary environment. Students will be a part of a program that moves them beyond a dissertation as they position themselves to make a significant contribution to their field.\n\nThe university fosters a highly research-oriented, inquiry-based approach to education in which faculty mentor students who share a passion for aviation and a desire to conduct original research. The program prepares its graduates for careers as university faculty and researchers, or as leaders in government and industry.\n\nThrough a commitment to research and teaching, Ph.D. students will have an opportunity to make a lasting impact on the future of the aviation industry. Specializing in Aviation Safety and Security, Aviation Operations, or in an intradisciplinary combination of the two, the program gives students the chance to pursue their topics of interest.",
        "program website url": "https://erau.edu/degrees/doctorate/aviation",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Aviation with Specialization in Aviation Safety",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Aviation Human Factors",
        "description": "The Ph.D. in Aviation program at Embry-Riddle’s Daytona Beach Campus provides students with a cognitive and culturally diverse research-driven curriculum that is focused on addressing the problems facing the aviation field. The Ph.D. in Aviation program prepares students to become scholar-practitioners, leading and serving the aviation industry as researchers, consultants, leaders and educators. Through this program, students have the chance to make a lasting impact on the aviation field.",
        "program website url": "https://erau.edu/degrees/doctorate/aviation",
        "Accreditation status": null,
        "Program name": "PhD in Aviation with Specialization in Aviation Human Factors",
        "Program Page url": "https://www.prnewswire.com/news-releases/embry-riddle-aeronautical-university-introduces-phd-in-human-factors-gains-highest-accreditation-from-sacs-commission-on-colleges-271427091.html"
    },
    {
        "Concentration name": "Aviation Operations",
        "description": "The Ph.D. in Aviation program at Embry-Riddle Aeronautical University is designed to prepare students with cognitive research skills to solve acute problems facing the field of aviation and advance the discipline. Through the Ph.D. program, students have the chance to pursue the discipline in a diverse, intellectually versatile and multi-disciplinary environment. Embry-Riddle Aeronautical University offers this program online and at our Daytona Beach campus. This flexibility brings the quality of an Embry-Riddle education to you, no matter where you are in the world. The Ph.D. in Aviation program is geared toward aviation professionals, including flight crew members, air traffic controllers, airline technical representatives, aviation maintenance managers, government employees and aviation educators who are looking to take their careers to the next level. Students will gain the knowledge and research skills that are required for leadership roles in academia, government agencies and the aviation/aerospace industry.",
        "program website url": "https://erau.edu/degrees/doctoral/aviation",
        "Accreditation status": "Embry-Riddle Aeronautical University is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award degrees at the associate, baccalaureate, masters, and doctorate levels.",
        "Level": "Doctoral",
        "Program name": "PhD in Aviation with Specialization in Aviation Operations",
        "Program Page url": "https://erau.edu/degrees/doctoral/aviation"
    },
    {
        "Concentration name": "Intradisciplinary",
        "description": "The Ph.D. in Aviation degree program at Embry-Riddle is designed to prepare students with cognitive research skills to solve acute problems facing the field of aviation and to advance the discipline. The Ph.D. in Aviation program produces outstanding scholars to lead in the field of aviation. Through this program, students have the chance to pursue a passion for aviation in a diverse, intellectually versatile, and multidisciplinary environment. The program, which is STEM-based, is geared to both full-time and working-professional students and is available on campus in Daytona Beach, Florida, or online through our Worldwide Campus. Students in the Ph.D. in Aviation program can pursue one of three specializations: Aviation Safety and Human Factors, Aviation Operations, or Intradisciplinary. The program requires 60 credit hours beyond a master's degree.",
        "program website url": "https://erau.edu/degrees/aviation-phd",
        "Accreditation status": null,
        "Program name": "PhD in Aviation with Specialization in Intradisciplinary",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Embry-Riddle Doctor of Aviation Business Administration (D.A.B.A) is the first of its kind in the nation. It is designed for experienced professionals looking to further their knowledge and skills in the field of aviation business. This terminal degree program provides students with a rigorous, research-based curriculum that prepares them for leadership roles in the aviation industry.\n\nThe D.A.B.A. program has three primary objectives. First, it will provide students with a strong foundation in aviation business theory and practice. Second, it will develop students’ research and analytical skills so they can identify and solve complex problems in the aviation industry. Third, it will prepare students for leadership roles in the aviation industry by teaching them how to effectively manage people, resources and projects.\n\nStudents in the D.A.B.A. program will learn about a wide range of topics, including aviation finance, marketing, operations, and strategy. They will also learn how to conduct research and write scholarly papers. Upon graduation, students will be prepared to pursue careers as executives, consultants, and researchers in the aviation industry.",
        "program website url": "https://erau.edu/degrees/doctorate/aviation-business-administration",
        "Accreditation status": "The Doctor of Aviation Business Administration program is accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Doctoral",
        "Program name": "Doctor of Aviation Business Administration",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": "Computer Science, Cybersecurity Engineering, Data Science, Electrical Engineering, Robotics and Autonomous Systems, Systems Engineering",
        "description": "The Ph.D. in Electrical Engineering & Computer Science program provides students with the skills and experience to become the next generation of leaders in academia and industry. Students will become experts in an area of their choice while broadening their knowledge of electrical engineering and computer science through a flexible, customizable curriculum. The program provides the necessary research skills to develop independent research and contribute to the body of knowledge in their specific areas of expertise. A combination of faculty mentors from both the Electrical, Computer, Software and Systems Engineering Department (ECSSE) and the College of Arts and Sciences (COAS) ensures a supportive and diverse learning environment for Ph.D. students.",
        "program website url": "https://erau.edu/degrees/doctorate/electrical-engineering-computer-science",
        "Accreditation status": null,
        "Program name": "PhD in Electrical Engineering & Computer Science",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": [
            "Space Physics",
            "Atmospheric Physics",
            "Remote Sensing",
            "Optical & Photonic Engineering",
            "Materials Physics"
        ],
        "description": "Embry-Riddle’s Ph.D. in Engineering Physics program is designed for students with a passion for physics and a desire to pursue their interests through research at the highest level. Students have the opportunity to work alongside leading experts in the field, utilizing sophisticated equipment and facilities to help push the boundaries of science.\n\nThe program’s mission is to produce professionals who can conduct, lead, and manage original research in government or industry, or join the academia.\n\nResearch specializations are available in Space Physics, Atmospheric Physics, Remote Sensing, Optical & Photonic Engineering, and Materials Physics.\n\nOur doctoral candidates are immersed in an interdisciplinary environment with close ties to the departments of aerospace, mechanical, and electrical engineering, as well as being part of ERAU's rapidly expanding research programs.",
        "program website url": "https://erau.edu/degrees/doctorate/engineering-physics",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Engineering Physics",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": [
            "Flight Deck/Cockpit Design",
            "Training and Simulation",
            "Unmanned Systems"
        ],
        "description": "The Embry-Riddle Ph.D. in Human Factors is designed for students who wish to further their knowledge of human capabilities and limitations, and to apply this knowledge to the design, operation, and maintenance of the systems and technologies that we use every day. The interdisciplinary doctoral program emphasizes both research and practice in the application of human factors principles.\n\nThe degree is housed in the Department of Human Factors and Behavioral Neurobiology in the College of Arts and Sciences on the Daytona Beach Campus.\n\nStudents who earn a Ph.D. in Human Factors will possess the knowledge and skills to make significant research contributions or to be a practitioner in high-technology settings like aviation, aerospace, healthcare, and surface transportation.\n\nThe program offers a diverse yet structured curriculum, allowing students from a variety of backgrounds to pursue their academic goals. Ph.D. students will learn about human factors and ergonomics, cognitive psychology, perception, research design, and statistics. They will have the opportunity to take specialized courses in areas such as human-computer interaction, automation, organizational behavior, accident investigation, and simulation.\n\nDoctoral students are required to conduct original, empirical research as part of their dissertation. Throughout their studies at Embry-Riddle, students in the Human Factors Ph.D. program will work closely with a faculty mentor to develop and refine their research ideas.",
        "program website url": "https://erau.edu/degrees/doctoral/human-factors",
        "Accreditation status": null,
        "Program name": "PhD in Human Factors",
        "Program Page url": "https://erau.edu/degrees/doctoral/human-factors"
    },
    {
        "Concentration name": "Aerospace Structures and Materials, Robotics and Autonomous Systems, Thermal Sciences",
        "description": "The Ph.D. in Mechanical Engineering program at Embry-Riddle provides an innovative curriculum that combines a strong research-based foundation with an emphasis on aerospace and aviation applications. The doctoral program prepares students to become highly-skilled researchers, university professors, and industry leaders. Students will not only possess expertise in their field of study, but will also have the tools to discover, generate, apply, and transmit new knowledge.\n\nFrom designing more efficient aircraft engines to developing new sources of energy, mechanical engineers make a difference in the world by developing creative solutions. The program combines a strong research-based foundation with an emphasis on aerospace and aviation applications, while also embracing broader applications.\n\nCoursework will cover theory and application in areas of mechanical engineering such as advanced materials, instrumentation and data acquisition, computational fluid dynamics, multiphase flow, and more. Students will also complete a required teaching practicum.",
        "program website url": "https://erau.edu/degrees/mechanical-engineering-phd",
        "Accreditation status": null,
        "Level": "PhD",
        "Program name": "PhD in Mechanical Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Certificate of Completion in Airline Management program offers business-focused courses designed to give students a comprehensive understanding of the airline industry, covering topics such as airline operations, management, marketing, finance, and economics. Students will gain the skills and knowledge necessary to succeed in various roles within the airline industry, including positions in airline management, operations, marketing, and finance. The program is ideal for individuals seeking to enter the airline industry, as well as for current airline professionals looking to advance their careers. The program culminates in a capstone course that allows students to apply their knowledge to a real-world airline management project.",
        "program website url": "https://erau.edu/degrees/certificate-airline-management",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Certificate in Airline Management",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Airworthiness Engineering is a 12-credit graduate-level, non-degree program for working professionals and graduate students who want to develop or expand their skills in the field of airworthiness engineering. This certificate program provides a strong foundation of knowledge in aircraft certification and continuing airworthiness for students with a bachelor's degree in engineering or a related technical discipline. The knowledge gained from this program can assist engineers and managers in developing safe, airworthy aircraft. This certificate program is offered through Embry-Riddle’s Worldwide & Online Campus.",
        "program website url": "https://erau.edu/degrees/graduate-certificate-airworthiness-engineering",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Airworthiness Engineering",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "Embry-Riddle’s Graduate Certificate in Human Factors program provides students with a solid foundation in human factors principles and practices. The program is designed for working professionals who want to expand their knowledge in human factors or are looking to switch careers. Students will gain the skills to design and evaluate systems that are safe, effective and desirable for human use. The certificate program requires the completion of four courses, which may also be applied toward a Master of Science in Human Factors degree. Graduates with this certificate are prepared for careers in a variety of industries, including aviation, healthcare, automotive and consumer products.",
        "program website url": "https://erau.edu/degrees/graduate-certificate-human-factors",
        "Accreditation status": null,
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Human Factors",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "The Graduate Certificate in Marketing provides students with skills critical for any professional seeking to move into a leadership position. The coursework offers opportunities to develop and implement marketing strategies, while strengthening the overall understanding of organizational behavior and structure. Students gain the skills to develop, implement and control marketing activities, combined with the core values to rise to the top of an organization. This certificate will also develop critical thinking skills that are necessary to evaluate global marketing issues.",
        "program website url": "https://erau.edu/degrees/certificate/marketing",
        "Accreditation status": "The David B. O'Maley College of Business at Embry-Riddle Aeronautical University is accredited by the Accreditation Council for Business Schools and Programs (ACBSP).",
        "Level": "Certificate",
        "Program name": "Graduate Certificate in Marketing",
        "Program Page url": "https://erau.edu/degrees"
    },
    {
        "Concentration name": null,
        "description": "As industries like aviation, aerospace, manufacturing, technology and healthcare become more complex, the need for skilled project managers continues to rise. The Graduate Certificate in Project Management from Embry-Riddle provides students with the foundational expertise required to effectively manage projects and can be a valuable differentiator when it comes to job opportunities and career advancement.\n\nStudents learn the processes and techniques needed to improve project efficiency and organizational effectiveness. The certificate also serves as an excellent pathway to the Master of Science in Project Management (MSPM) degree. Credits completed in the certificate program may be transferred into the MSPM degree with departmental approval.",
        "program website url": "https://erau.edu/degrees/graduate-certificate-project-management",
        "Accreditation status": null,
        "Program name": "Graduate Certificate in Project Management",
        "Program Page url": "https://erau.edu/degrees"
    }
]